05-03-funcoes-primitivas.org
#+setupfile: static/setupfile.org
#+html_link_up: 05-axiomas.html
#+title: Funções primitivas
#+options: toc:t
#+startup: content

#+property: header-args:rust :tangle src/axioms/primitives.rs

Arquivo: ~axioms/primitives.rs~.


** Importações

#+begin_src rust
//use std::fs::File;
use gc::Gc;
use crate::core::{
    Maj,
    MajState
};
use super::predicates::{
    maj_eq,
    maj_nilp,
    maj_consp,
    maj_errorp,
    maj_stringp,
    maj_numberp,
    maj_vectorp,
    maj_proper_list_p
};
use crate::{ maj_list, maj_destructure_args };
use super::MajRawSym;
use num_traits::FromPrimitive;
use crate::axioms::utils::{ simplify_frac, simplify_frac_coerce };
use crate::core::types::MajVectorType;
#+end_src

** ~(cons x y)~

#+begin_src rust
pub fn maj_cons(x: Gc<Maj>, y: Gc<Maj>) -> Gc<Maj> {
    if maj_errorp(x.clone()).to_bool() {
        x
    } else if maj_errorp(y.clone()).to_bool() {
        y
    } else {
        Maj::cons(x, y)
    }
}
#+end_src

** ~(car x)~

#+begin_src rust
pub fn maj_car(x: Gc<Maj>) -> Gc<Maj> {
    match &*x.clone() {
        Maj::Sym(_) => {
            if maj_nilp(x.clone()).to_bool() {
                return Maj::nil();
            }
        },
        Maj::Cons { car, cdr: _ } => {
            return car.clone();
        },
        _ => {}
    }
    maj_err(Maj::string("{} is not a cons cell"),
            maj_list!(x))
}
#+end_src

** ~(cdr x)~

#+begin_src rust
pub fn maj_cdr(x: Gc<Maj>) -> Gc<Maj> {
    match &*x.clone() {
        Maj::Sym(_) => {
            if maj_nilp(x.clone()).to_bool() {
                return Maj::nil();
            }
        },
        Maj::Cons { car: _, cdr } => {
            return cdr.clone();
        },
        _ => {}
    }
    maj_err(Maj::string("{} is not a cons cell"),
            maj_list!(x))
}
#+end_src

