05-03-funcoes-primitivas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2022-10-23 dom 23:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Funções primitivas</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="05-axiomas.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Funções primitivas</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd26fe14">1. Importações</a></li>
<li><a href="#org212ab3c">2. <code>(cons x y)</code></a></li>
<li><a href="#orge7a5fdd">3. <code>(car x)</code></a></li>
<li><a href="#orgb1f4437">4. <code>(cdr x)</code></a></li>
<li><a href="#orgd599729">5. <code>(copy x)</code></a></li>
<li><a href="#org2cfa17f">6. <code>(length x)</code></a></li>
<li><a href="#orgf28f30f">7. <code>(depth x)</code></a></li>
<li><a href="#orgdf22f9d">8. <code>(type x)</code></a></li>
<li><a href="#org626882e">9. <code>(intern x)</code></a></li>
<li><a href="#orgdedea08">10. <code>(name x)</code></a></li>
<li><a href="#orgf5be62a">11. <code>(get-environment type)</code></a></li>
<li><a href="#org76b33f1">12. <code>(coin)</code></a></li>
<li><a href="#org414a441">13. <code>(sys com . args)</code></a></li>
<li><a href="#orgf7a2f5e">14. <code>(format fmt . rest)</code></a></li>
<li><a href="#orgc8ddf92">15. <code>(err fmt . rest)</code></a></li>
<li><a href="#orgfff673b">16. <code>(warn fmt . rest)</code></a></li>
<li><a href="#org0d440f3">17. <code>(list . rest)</code></a></li>
<li><a href="#orged2ac09">18. <code>(append . rest)</code></a></li>
<li><a href="#orgc41b0f4">19. <code>(last x)</code></a></li>
<li><a href="#org6697d56">20. <code>(reverse x)</code></a></li>
<li><a href="#orge8ea921">21. <code>(nthcdr n lst)</code></a></li>
<li><a href="#org6c6c88c">22. <code>(nth n lst)</code></a></li>
<li><a href="#orgfd8c4c0">23. <code>(macroexpand-1 x)</code></a></li>
<li><a href="#org5284f8a">24. <span class="todo TODO">TODO</span> <code>(macroexpand x)</code></a></li>
<li><a href="#orgaea254e">25. <code>(not x)</code></a></li>
<li><a href="#orgd382459">26. <code>(gensym)</code></a></li>
<li><a href="#org0e58517">27. Funções numéricas</a>
<ul>
<li><a href="#org926f802">27.1. <code>(number-coerce x subtype)</code></a></li>
<li><a href="#org21a5e79">27.2. <code>(real-part x)</code></a></li>
<li><a href="#org03ed51b">27.3. <code>(imag-part x)</code></a></li>
<li><a href="#org33aab02">27.4. <code>(numer x)</code></a></li>
<li><a href="#org76eb121">27.5. <code>(denom x)</code></a></li>
<li><a href="#org317c11b">27.6. <code>(richest-number-type x y)</code></a></li>
<li><a href="#orgfdc67db">27.7. <code>(rich-number-coerce x y)</code></a></li>
<li><a href="#orga04262f">27.8. <code>(iota n)</code></a></li>
</ul>
</li>
<li><a href="#orgb4b2bd3">28. <span class="todo TODO">TODO</span> Funções de comparação</a>
<ul>
<li><a href="#org67cdc05">28.1. Funções de ajuda e ferramentas</a>
<ul>
<li><a href="#org1b77933">28.1.1. Ajudante de coerções aritméticas</a></li>
<li><a href="#org2be9dc1">28.1.2. Tipos de despacho de aritmética</a></li>
<li><a href="#orge7213bc">28.1.3. Ajudante de despacho de aritmética</a></li>
<li><a href="#org0de633e">28.1.4. Comparação por igualdade</a></li>
<li><a href="#org8bfc5c1">28.1.5. Comparação de maior que / menor que</a></li>
</ul>
</li>
<li><a href="#org0244a0a">28.2. <code>(= x y . rest)</code></a></li>
<li><a href="#org60804c5">28.3. <code>(float= x y)</code></a></li>
<li><a href="#org14e3a1c">28.4. <code>(&gt; x y . rest)</code></a></li>
<li><a href="#org2124622">28.5. <code>(&lt; x y . rest)</code></a></li>
<li><a href="#orge793585">28.6. <code>(&gt;= x y . rest)</code></a></li>
<li><a href="#orge837e09">28.7. <code>(&lt;= x y . rest)</code></a></li>
</ul>
</li>
<li><a href="#orgb3cb4f9">29. Funções aritméticas</a>
<ul>
<li><a href="#org2efa026">29.1. Funções de ajuda e ferramentas</a>
<ul>
<li><a href="#org82e3635">29.1.1. Ajudante de soma</a></li>
<li><a href="#org189ca58">29.1.2. Ajudante de subtração</a></li>
<li><a href="#orgafa0365">29.1.3. Ajudante de multiplicação</a></li>
<li><a href="#org229d514">29.1.4. Ajudante de divisão</a></li>
</ul>
</li>
<li><a href="#orgc2bb12a">29.2. <code>(+ . rest)</code></a></li>
<li><a href="#orgbad963c">29.3. <code>(- . rest)</code></a></li>
<li><a href="#orgf807765">29.4. <code>(* . rest)</code></a></li>
<li><a href="#org454baf2">29.5. <code>(/ . rest)</code></a></li>
</ul>
</li>
<li><a href="#org847d885">30. Funções de streams</a>
<ul>
<li><a href="#orgece963d">30.1. Funções auxiliares</a>
<ul>
<li><a href="#org6e22c52">30.1.1. Desempacotamento de um File</a></li>
<li><a href="#org882ec1a">30.1.2. Testes de stream padrão</a></li>
</ul>
</li>
<li><a href="#org1403921">30.2. <code>(open-stream dir path)</code></a></li>
<li><a href="#orge4b63fe">30.3. <code>(close-stream x)</code></a></li>
<li><a href="#orge3ad0b5">30.4. <code>(stat x)</code></a></li>
<li><a href="#org6b5a5d1">30.5. <code>(read-char stream)</code></a></li>
<li><a href="#orgfe70f6b">30.6. <code>(peek-char stream)</code></a></li>
<li><a href="#orgb718d2a">30.7. <code>(write-char c stream)</code></a></li>
<li><a href="#org3eadbe1">30.8. <code>(write-string str stream)</code></a></li>
<li><a href="#org0705a60">30.9. <code>(write x stream)</code></a></li>
<li><a href="#orgeb9cc1c">30.10. <span class="todo TODO">TODO</span> <code>(read stream)</code></a></li>
</ul>
</li>
<li><a href="#org8a331f2">31. Funções de entrada e saída</a>
<ul>
<li><a href="#org976e6e6">31.1. <code>(terpri)</code></a></li>
<li><a href="#orga07aa3a">31.2. <code>(display x)</code></a></li>
<li><a href="#org243fde1">31.3. <span class="todo TODO">TODO</span> <code>(pretty-display x)</code></a></li>
<li><a href="#org13e79a7">31.4. <code>(print fmt . args)</code></a></li>
<li><a href="#orgf195a19">31.5. <span class="todo TODO">TODO</span> <code>(load path)</code></a></li>
</ul>
</li>
<li><a href="#org13cc223">32. Funções de vetores</a>
<ul>
<li><a href="#org16dba35">32.1. <code>(vec-type vec)</code></a></li>
<li><a href="#org7ceaa49">32.2. <code>(vec-push x vec)</code></a></li>
<li><a href="#orgf44e962">32.3. <code>(vec-insert pos x vec)</code></a></li>
<li><a href="#orgf8f51a5">32.4. <code>(vec-coerce vec type)</code></a></li>
<li><a href="#org95912f7">32.5. <code>(vector . rest)</code></a></li>
<li><a href="#orgf5a691b">32.6. <code>(vec-length vec)</code></a></li>
<li><a href="#org26b724f">32.7. <code>(vec-pop vec)</code></a></li>
<li><a href="#orgd8d5a46">32.8. <code>(vec-deq vec)</code></a></li>
<li><a href="#org212cdde">32.9. <code>(vec-at x vec)</code></a></li>
<li><a href="#orga58bee7">32.10. <code>(vec-set pos x vec)</code></a></li>
<li><a href="#org67d495f">32.11. <code>(vec-remove vec pos)</code></a></li>
</ul>
</li>
<li><a href="#org2f40199">33. Funções customizadas</a>
<ul>
<li><a href="#orgc4e8ef5">33.1. <code>(gc)</code></a></li>
<li><a href="#org53d9558">33.2. <code>(print-env type)</code></a></li>
<li><a href="#org425fb20">33.3. <code>(stack-state)</code></a></li>
</ul>
</li>
<li><a href="#org8f8802f">34. Registro em contexto global</a></li>
</ul>
</div>
</div>
<p>
Arquivo: <code>axioms/primitives.rs</code>.
</p>


<div id="outline-container-orgd26fe14" class="outline-2">
<h2 id="orgd26fe14"><span class="section-number-2">1.</span> Importações</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #6a9955;">//</span><span style="color: #6a9955;">use std::fs::File;</span>
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">gc</span>::<span style="color: #4ec9b0;">Gc</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::{
    <span style="color: #4ec9b0;">Maj</span>,
    <span style="color: #4ec9b0;">MajState</span>
};
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">super</span>::<span style="color: #569cd6;">predicates</span>::{
    maj_eq,
    maj_nilp,
    maj_consp,
    maj_errorp,
    maj_stringp,
    maj_numberp,
    maj_vectorp,
    maj_proper_list_p
};
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::{ maj_list, maj_destructure_args };
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">super</span>::<span style="color: #4ec9b0;">MajRawSym</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">num_traits</span>::<span style="color: #4ec9b0;">FromPrimitive</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">utils</span>::{ simplify_frac, simplify_frac_coerce };
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajVectorType</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org212ab3c" class="outline-2">
<h2 id="org212ab3c"><span class="section-number-2">2.</span> <code>(cons x y)</code></h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_cons</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> maj_errorp(x.clone()).to_bool() {
        x
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_errorp(y.clone()).to_bool() {
        y
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #4ec9b0;">Maj</span>::cons(x, y)
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7a5fdd" class="outline-2">
<h2 id="orge7a5fdd"><span class="section-number-2">3.</span> <code>(car x)</code></h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_car</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">match</span> <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x.clone() {
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(_) =&gt; {
            <span style="color: #569cd6;">if</span> maj_nilp(x.clone()).to_bool() {
                <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::nil();
            }
        },
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Cons</span> { car, <span style="color: #9cdcfe;">cdr</span>: _ } =&gt; {
            <span style="color: #569cd6;">return</span> car.clone();
        },
        _ =&gt; {}
    }
    maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a cons cell"</span>),
            <span style="color: #c586c0;">maj_list!</span>(x))
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb1f4437" class="outline-2">
<h2 id="orgb1f4437"><span class="section-number-2">4.</span> <code>(cdr x)</code></h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_cdr</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">match</span> <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x.clone() {
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(_) =&gt; {
            <span style="color: #569cd6;">if</span> maj_nilp(x.clone()).to_bool() {
                <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::nil();
            }
        },
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Cons</span> { <span style="color: #9cdcfe;">car</span>: _, cdr } =&gt; {
            <span style="color: #569cd6;">return</span> cdr.clone();
        },
        _ =&gt; {}
    }
    maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a cons cell"</span>),
            <span style="color: #c586c0;">maj_list!</span>(x))
}
</pre>
</div>
</div>
</div>
