05-03-funcoes-primitivas.org
** ~(copy x)~

#+begin_src rust
pub fn maj_copy(x: Gc<Maj>) -> Gc<Maj> {
    match &*x.clone() {
        Maj::Cons { car, cdr } => {
            Maj::cons(car.clone(), cdr.clone())
        }
        _ => maj_err(
            Maj::string("{} is not a cons cell"),
            maj_list!(x))
    }
}
#+end_src

** ~(length x)~

#+begin_src rust
pub fn maj_length(x: Gc<Maj>) -> Gc<Maj> {
    if maj_nilp(x.clone()).to_bool() {
        Maj::integer(0)
    } else if !maj_consp(x.clone()).to_bool() {
        maj_err(
            Maj::string("{} is not a proper list"),
            maj_list!(x.clone()))
    } else {
        let mut itr    = x.clone();
        let mut length = 0;
        while maj_consp(itr.clone()).to_bool() {
            length += 1;
            itr = maj_cdr(itr);
        }
        Maj::integer(length)
    }
}
#+end_src

** ~(depth x)~

#+begin_src rust
fn maj_depth_helper(x: Gc<Maj>) -> i64 {
    use std::cmp;
    if !maj_consp(x.clone()).to_bool() {
        0
    } else {
        1 + cmp::max(maj_depth_helper(maj_car(x.clone())),
                     maj_depth_helper(maj_cdr(x)))
    }
}
#+end_src

#+begin_src rust
pub fn maj_depth(x: Gc<Maj>) -> Gc<Maj> {
    use crate::axioms::predicates::maj_atomp;
    if maj_nilp(x.clone()).to_bool() {
        Maj::integer(0)
    } else if maj_atomp(x.clone()).to_bool() {
        maj_err(Maj::string(
            "{} is an atom"), maj_list!(x))
    } else {
        Maj::integer(maj_depth_helper(x))
    }
}
#+end_src

** ~(type x)~

#+begin_src rust
pub fn maj_type(mut state: &mut MajState, x: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajNumber;
    Maj::symbol(
        &mut state,
        match &*x {
            Maj::Sym(_)              =>"symbol",
            Maj::Cons {
                car: _, cdr: _
            }                        => "cons",
            Maj::Stream(_)           => "stream",
            Maj::Char(_)             => "char",
            Maj::Number(num) => {
                match num.clone() {
                    MajNumber::Integer(_)     => "integer",
                    MajNumber::Float(_)       => "float",
                    MajNumber::Fraction(_, _) => "fraction",
                    MajNumber::Complex {
                        real: _, imag: _
                    }                         => "complex",
                }
            },
            Maj::Vector(_)            => "vector",
        })
}
#+end_src

** ~(intern x)~

#+begin_src rust
pub fn maj_intern(mut state: &mut MajState, x: Gc<Maj>) -> Gc<Maj> {
    match x.clone().stringify() {
        Some(string) => {
            if string == "" {
                Maj::nil()
            } else {
                Maj::symbol(&mut state, &string)
            }
        },
        None => {
            maj_err(Maj::string("{} is not a string"),
                    maj_list!(x))
        },
    }
}
#+end_src

** ~(name x)~

#+begin_src rust
pub fn maj_name(state: &MajState, x: Gc<Maj>) -> Gc<Maj> {
    use crate::printing::maj_format;
    if let Maj::Sym(_) = &*x.clone() {
        Maj::string(&maj_format(&state, x))
    } else {
        maj_err(Maj::string("{} is not a symbol"),
                maj_list!(x.clone()))
    }
}
#+end_src

