05-03-funcoes-primitivas.html

<div id="outline-container-orgd599729" class="outline-2">
<h2 id="orgd599729"><span class="section-number-2">5.</span> <code>(copy x)</code></h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_copy</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">match</span> <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x.clone() {
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Cons</span> { car, cdr } =&gt; {
            <span style="color: #4ec9b0;">Maj</span>::cons(car.clone(), cdr.clone())
        }
        _ =&gt; maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a cons cell"</span>),
            <span style="color: #c586c0;">maj_list!</span>(x))
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2cfa17f" class="outline-2">
<h2 id="org2cfa17f"><span class="section-number-2">6.</span> <code>(length x)</code></h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_length</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> maj_nilp(x.clone()).to_bool() {
        <span style="color: #4ec9b0;">Maj</span>::integer(0)
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> !maj_consp(x.clone()).to_bool() {
        maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a proper list"</span>),
            <span style="color: #c586c0;">maj_list!</span>(x.clone()))
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">itr</span>    = x.clone();
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">length</span> = 0;
        <span style="color: #569cd6;">while</span> maj_consp(itr.clone()).to_bool() {
            length += 1;
            itr = maj_cdr(itr);
        }
        <span style="color: #4ec9b0;">Maj</span>::integer(length)
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf28f30f" class="outline-2">
<h2 id="orgf28f30f"><span class="section-number-2">7.</span> <code>(depth x)</code></h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_depth_helper</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">i64</span> {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::cmp;
    <span style="color: #569cd6;">if</span> !maj_consp(x.clone()).to_bool() {
        0
    } <span style="color: #569cd6;">else</span> {
        1 + <span style="color: #569cd6;">cmp</span>::max(maj_depth_helper(maj_car(x.clone())),
                     maj_depth_helper(maj_cdr(x)))
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_depth</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_atomp;
    <span style="color: #569cd6;">if</span> maj_nilp(x.clone()).to_bool() {
        <span style="color: #4ec9b0;">Maj</span>::integer(0)
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_atomp(x.clone()).to_bool() {
        maj_err(<span style="color: #4ec9b0;">Maj</span>::string(
            <span style="color: #ce9178;">"{} is an atom"</span>), <span style="color: #c586c0;">maj_list!</span>(x))
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #4ec9b0;">Maj</span>::integer(maj_depth_helper(x))
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf22f9d" class="outline-2">
<h2 id="orgdf22f9d"><span class="section-number-2">8.</span> <code>(type x)</code></h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_type</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>, <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajNumber</span>;
    <span style="color: #4ec9b0;">Maj</span>::symbol(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
        <span style="color: #569cd6;">match</span> <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x {
            <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(_)              =&gt;<span style="color: #ce9178;">"symbol"</span>,
            <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Cons</span> {
                <span style="color: #9cdcfe;">car</span>: _, <span style="color: #9cdcfe;">cdr</span>: _
            }                        =&gt; <span style="color: #ce9178;">"cons"</span>,
            <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Stream</span>(_)           =&gt; <span style="color: #ce9178;">"stream"</span>,
            <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Char</span>(_)             =&gt; <span style="color: #ce9178;">"char"</span>,
            <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(num) =&gt; {
                <span style="color: #569cd6;">match</span> num.clone() {
                    <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Integer</span>(_)     =&gt; <span style="color: #ce9178;">"integer"</span>,
                    <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Float</span>(_)       =&gt; <span style="color: #ce9178;">"float"</span>,
                    <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Fraction</span>(_, _) =&gt; <span style="color: #ce9178;">"fraction"</span>,
                    <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Complex</span> {
                        <span style="color: #9cdcfe;">real</span>: _, <span style="color: #9cdcfe;">imag</span>: _
                    }                         =&gt; <span style="color: #ce9178;">"complex"</span>,
                }
            },
            <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(_)            =&gt; <span style="color: #ce9178;">"vector"</span>,
        })
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org626882e" class="outline-2">
<h2 id="org626882e"><span class="section-number-2">9.</span> <code>(intern x)</code></h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_intern</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>, <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">match</span> x.clone().stringify() {
        <span style="color: #4ec9b0;">Some</span>(string) =&gt; {
            <span style="color: #569cd6;">if</span> string == <span style="color: #ce9178;">""</span> {
                <span style="color: #4ec9b0;">Maj</span>::nil()
            } <span style="color: #569cd6;">else</span> {
                <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>string)
            }
        },
        <span style="color: #4ec9b0;">None</span> =&gt; {
            maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a string"</span>),
                    <span style="color: #c586c0;">maj_list!</span>(x))
        },
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdedea08" class="outline-2">
<h2 id="orgdedea08"><span class="section-number-2">10.</span> <code>(name x)</code></h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_name</span>(<span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajState</span>, <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">printing</span>::maj_format;
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(_) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x.clone() {
        <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, x))
    } <span style="color: #569cd6;">else</span> {
        maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a symbol"</span>),
                <span style="color: #c586c0;">maj_list!</span>(x.clone()))
    }
}
</pre>
</div>
</div>
</div>
