05-03-funcoes-primitivas.org
** ~(get-environment type)~

#+begin_src rust
pub fn maj_get_environment(
    mut state: &mut MajState,
    type_sym: Gc<Maj>,
    env: Gc<Maj>
) -> Gc<Maj> {
    if maj_eq(type_sym.clone(),
              Maj::symbol(&mut state, "lexical"))
        .to_bool()
    {
        env
    } else if maj_eq(type_sym.clone(),
                     Maj::symbol(&mut state, "global"))
        .to_bool()
    {
        state.get_global_env()
    } else {
        maj_err(
            Maj::string("Unknown environment type {}"),
            maj_list!(type_sym))
    }
}
#+end_src

** ~(coin)~

#+begin_src rust
pub fn maj_coin() -> Gc<Maj> {
    use rand::random;

    if random() {
        Maj::t()
    } else {
        Maj::nil()
    }
}
#+end_src

** ~(sys com . args)~

# TODO: Seria legal usar a API de Rust para redirecionar para o stream
# de saída padrão da própria linguagem.

#+begin_src rust
pub fn maj_sys(com: Gc<Maj>, args: Gc<Maj>) -> Gc<Maj> {
    use std::process::Command;

    if !maj_stringp(com.clone()).to_bool() {
        return maj_err(
            Maj::string("{} is not a string"),
            maj_list!(com));
    }

    let mut comm = Command::new(com.stringify().unwrap());

    let mut itr = args.clone();
    while !maj_nilp(itr.clone()).to_bool() {
        if let Maj::Cons { car, cdr } = &*itr.clone() {
            if !maj_stringp(car.clone()).to_bool() {
                return maj_err(
                    Maj::string("{} is not a string"),
                    maj_list!(car.clone()));
            } else {
                let _ = comm.arg(car.clone()
                                 .stringify()
                                 .unwrap());
                itr = cdr.clone();
            }
        } else {};
    }

    let result = match comm.status() {
        Ok(res) => res.code(),
        Err(_)  => None,
    };

    match result {
        Some(code) => Maj::integer(code as i64),
        None => maj_err(
            Maj::string("Error executing command {} {}"),
            maj_list!(com, args)),
    }
}
#+end_src

