05-03-funcoes-primitivas.html

<div id="outline-container-orgf5be62a" class="outline-2">
<h2 id="orgf5be62a"><span class="section-number-2">11.</span> <code>(get-environment type)</code></h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_get_environment</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">type_sym</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> maj_eq(type_sym.clone(),
              <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"lexical"</span>))
        .to_bool()
    {
        env
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_eq(type_sym.clone(),
                     <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"global"</span>))
        .to_bool()
    {
        state.get_global_env()
    } <span style="color: #569cd6;">else</span> {
        maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Unknown environment type {}"</span>),
            <span style="color: #c586c0;">maj_list!</span>(type_sym))
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org76b33f1" class="outline-2">
<h2 id="org76b33f1"><span class="section-number-2">12.</span> <code>(coin)</code></h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_coin</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">rand</span>::random;

    <span style="color: #569cd6;">if</span> random() {
        <span style="color: #4ec9b0;">Maj</span>::t()
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #4ec9b0;">Maj</span>::nil()
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org414a441" class="outline-2">
<h2 id="org414a441"><span class="section-number-2">13.</span> <code>(sys com . args)</code></h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_sys</span>(<span style="color: #9cdcfe;">com</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">args</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::<span style="color: #569cd6;">process</span>::<span style="color: #4ec9b0;">Command</span>;

    <span style="color: #569cd6;">if</span> !maj_stringp(com.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a string"</span>),
            <span style="color: #c586c0;">maj_list!</span>(com));
    }

    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">comm</span> = <span style="color: #4ec9b0;">Command</span>::new(com.stringify().unwrap());

    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">itr</span> = args.clone();
    <span style="color: #569cd6;">while</span> !maj_nilp(itr.clone()).to_bool() {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Cons</span> { car, cdr } = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*itr.clone() {
            <span style="color: #569cd6;">if</span> !maj_stringp(car.clone()).to_bool() {
                <span style="color: #569cd6;">return</span> maj_err(
                    <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a string"</span>),
                    <span style="color: #c586c0;">maj_list!</span>(car.clone()));
            } <span style="color: #569cd6;">else</span> {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = comm.arg(car.clone()
                                 .stringify()
                                 .unwrap());
                itr = cdr.clone();
            }
        } <span style="color: #569cd6;">else</span> {};
    }

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> = <span style="color: #569cd6;">match</span> comm.status() {
        <span style="color: #4ec9b0;">Ok</span>(res) =&gt; res.code(),
        <span style="color: #4ec9b0;">Err</span>(_)  =&gt; <span style="color: #4ec9b0;">None</span>,
    };

    <span style="color: #569cd6;">match</span> result {
        <span style="color: #4ec9b0;">Some</span>(code) =&gt; <span style="color: #4ec9b0;">Maj</span>::integer(code <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">i64</span>),
        <span style="color: #4ec9b0;">None</span> =&gt; maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Error executing command {} {}"</span>),
            <span style="color: #c586c0;">maj_list!</span>(com, args)),
    }
}
</pre>
</div>
</div>
</div>
