05-03-funcoes-primitivas.org
** ~(format fmt . rest)~

#+begin_src rust
pub fn maj_format_prim(
    state: &MajState,
    fmt: Gc<Maj>,
    rest: Gc<Maj>
) -> Gc<Maj> {
    if let Some(rfmt) = fmt.stringify() {
        let mut buffer = String::new();
        let mut expect_closebracket = false;
        let mut gulp_next = false;
        let mut curr_arg = rest.clone();
        for c in rfmt.chars() {
            if gulp_next {
                buffer.push(c);
                gulp_next = false;
            } else if expect_closebracket {
                if c == '}' {
                    use crate::printing::maj_format;
                    expect_closebracket = false;
                    if maj_nilp(curr_arg.clone()).to_bool() {
                        return maj_err(
                            Maj::string("Missing arguments on format"),
                            Maj::nil());
                    }
                    let cafirst = maj_car(curr_arg.clone());
                    let mut formatted =
                        if let Maj::Char(c) = &*cafirst.clone() {
                            String::from(format!("{}", c))
                        } else {
                            maj_format(&state, cafirst)
                        };
                    let len = formatted.len();
                    if (len >= 2)
                        && (formatted.chars().nth(0).unwrap() == '"')
                        && (formatted.chars().last().unwrap() == '"') {
                            formatted =
                                String::from(&formatted[1..(len-1)]);
                        }
                    buffer.push_str(formatted.as_str());
                    curr_arg = maj_cdr(curr_arg);
                }
            } else {
                match c {
                    '{' => expect_closebracket = true,
                    '\\' => gulp_next = true,
                    '}' => {
                        return maj_err(
                            Maj::string(
                                "Unmatched closing curly brace in {}"),
                            maj_list!(fmt));
                    },
                    _ => buffer.push(c),
                }
            }
        }
        if expect_closebracket {
            return maj_err(
                Maj::string("Unmatched opening curly brace in {}"),
                maj_list!(fmt));
        }
        Maj::string(buffer.as_ref())
    } else {
        maj_err(Maj::string("{} is not a string"),
                maj_list!(fmt))
    }
}
#+end_src

** ~(err fmt . rest)~

#+begin_src rust
pub fn maj_err(fmt: Gc<Maj>, rest: Gc<Maj>) -> Gc<Maj> {
    use crate::maj_dotted_list;

    if !maj_stringp(fmt.clone()).to_bool() {
        panic!("Cannot throw error: {} is not a string", fmt);
    } else if !maj_proper_list_p(rest.clone()).to_bool() {
        panic!("Cannot throw error: {} is not a proper list", rest);
    }

    maj_dotted_list!(Maj::lit(), Maj::error(), fmt, rest)
}
#+end_src

** ~(warn fmt . rest)~

#+begin_src rust
pub fn maj_warn(mut state: &mut MajState, fmt: Gc<Maj>,
                rest: Gc<Maj>, env: Gc<Maj>
) -> Gc<Maj> {
    let format = maj_format_prim(&state, fmt, rest);
    if maj_errorp(format.clone()).to_bool() {
        format
    } else {
        let stderr = Maj::symbol(&mut state, "*stderr*");
        let stderr = state.lookup(env, stderr);
        if maj_errorp(stderr.clone()).to_bool() {
            stderr
        } else {
            maj_write_string(
                &mut state, format, stderr.clone());
            maj_write_char(
                &mut state, Maj::character('\n'), stderr);
            Maj::nil()
        }
    }
}
#+end_src

** ~(list . rest)~

#+begin_src rust
#[inline]
pub fn maj_list(rest: Gc<Maj>) -> Gc<Maj> {
    rest
}
#+end_src

