05-03-funcoes-primitivas.html

<div id="outline-container-orgf7a2f5e" class="outline-2">
<h2 id="orgf7a2f5e"><span class="section-number-2">14.</span> <code>(format fmt . rest)</code></h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_format_prim</span>(
    <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">fmt</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Some</span>(rfmt) = fmt.stringify() {
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">buffer</span> = <span style="color: #4ec9b0;">String</span>::new();
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">expect_closebracket</span> = <span style="color: #569cd6;">false</span>;
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">gulp_next</span> = <span style="color: #569cd6;">false</span>;
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">curr_arg</span> = rest.clone();
        <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">c</span> <span style="color: #569cd6;">in</span> rfmt.chars() {
            <span style="color: #569cd6;">if</span> gulp_next {
                buffer.push(c);
                gulp_next = <span style="color: #569cd6;">false</span>;
            } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> expect_closebracket {
                <span style="color: #569cd6;">if</span> c == <span style="color: #ce9178;">'}'</span> {
                    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">printing</span>::maj_format;
                    expect_closebracket = <span style="color: #569cd6;">false</span>;
                    <span style="color: #569cd6;">if</span> maj_nilp(curr_arg.clone()).to_bool() {
                        <span style="color: #569cd6;">return</span> maj_err(
                            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Missing arguments on format"</span>),
                            <span style="color: #4ec9b0;">Maj</span>::nil());
                    }
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">cafirst</span> = maj_car(curr_arg.clone());
                    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">formatted</span> =
                        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Char</span>(c) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*cafirst.clone() {
                            <span style="color: #4ec9b0;">String</span>::from(<span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, c))
                        } <span style="color: #569cd6;">else</span> {
                            maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, cafirst)
                        };
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = formatted.len();
                    <span style="color: #569cd6;">if</span> (len &gt;= 2)
                        &amp;&amp; (formatted.chars().nth(0).unwrap() == <span style="color: #ce9178;">'"'</span>)
                        &amp;&amp; (formatted.chars().last().unwrap() == <span style="color: #ce9178;">'"'</span>) {
                            formatted =
                                <span style="color: #4ec9b0;">String</span>::from(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>formatted[1..(len-1)]);
                        }
                    buffer.push_str(formatted.as_str());
                    curr_arg = maj_cdr(curr_arg);
                }
            } <span style="color: #569cd6;">else</span> {
                <span style="color: #569cd6;">match</span> c {
                    <span style="color: #ce9178;">'{'</span> =&gt; expect_closebracket = <span style="color: #569cd6;">true</span>,
                    <span style="color: #ce9178;">'\\'</span> =&gt; gulp_next = <span style="color: #569cd6;">true</span>,
                    <span style="color: #ce9178;">'}'</span> =&gt; {
                        <span style="color: #569cd6;">return</span> maj_err(
                            <span style="color: #4ec9b0;">Maj</span>::string(
                                <span style="color: #ce9178;">"Unmatched closing curly brace in {}"</span>),
                            <span style="color: #c586c0;">maj_list!</span>(fmt));
                    },
                    _ =&gt; buffer.push(c),
                }
            }
        }
        <span style="color: #569cd6;">if</span> expect_closebracket {
            <span style="color: #569cd6;">return</span> maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Unmatched opening curly brace in {}"</span>),
                <span style="color: #c586c0;">maj_list!</span>(fmt));
        }
        <span style="color: #4ec9b0;">Maj</span>::string(buffer.as_ref())
    } <span style="color: #569cd6;">else</span> {
        maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a string"</span>),
                <span style="color: #c586c0;">maj_list!</span>(fmt))
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc8ddf92" class="outline-2">
<h2 id="orgc8ddf92"><span class="section-number-2">15.</span> <code>(err fmt . rest)</code></h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_err</span>(<span style="color: #9cdcfe;">fmt</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::maj_dotted_list;

    <span style="color: #569cd6;">if</span> !maj_stringp(fmt.clone()).to_bool() {
        <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Cannot throw error: {} is not a string"</span>, fmt);
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> !maj_proper_list_p(rest.clone()).to_bool() {
        <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Cannot throw error: {} is not a proper list"</span>, rest);
    }

    <span style="color: #c586c0;">maj_dotted_list!</span>(<span style="color: #4ec9b0;">Maj</span>::lit(), <span style="color: #4ec9b0;">Maj</span>::error(), fmt, rest)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfff673b" class="outline-2">
<h2 id="orgfff673b"><span class="section-number-2">16.</span> <code>(warn fmt . rest)</code></h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_warn</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>, <span style="color: #9cdcfe;">fmt</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                <span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">format</span> = maj_format_prim(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, fmt, rest);
    <span style="color: #569cd6;">if</span> maj_errorp(format.clone()).to_bool() {
        format
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stderr</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*stderr*"</span>);
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stderr</span> = state.lookup(env, stderr);
        <span style="color: #569cd6;">if</span> maj_errorp(stderr.clone()).to_bool() {
            stderr
        } <span style="color: #569cd6;">else</span> {
            maj_write_string(
                <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, format, stderr.clone());
            maj_write_char(
                <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'\n'</span>), stderr);
            <span style="color: #4ec9b0;">Maj</span>::nil()
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0d440f3" class="outline-2">
<h2 id="org0d440f3"><span class="section-number-2">17.</span> <code>(list . rest)</code></h2>
<div class="outline-text-2" id="text-17">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[inline]</span>
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_list</span>(<span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    rest
}
</pre>
</div>
</div>
</div>
