05-03-funcoes-primitivas.org
** ~(append . rest)~

#+begin_src rust
pub fn maj_append(rest: Gc<Maj>) -> Gc<Maj> {
    use crate::maj_dotted_list;
    use crate::axioms::predicates::maj_atomp;
    let car  = maj_car(rest.clone());
    let cdr  = maj_cdr(rest.clone());
    let cadr = maj_car(cdr.clone());
    let cddr = maj_cdr(cdr.clone());

    if maj_nilp(cdr.clone()).to_bool() {
        return car;
    }

    let mut itr = car.clone();
    let mut v = Vec::new();
    while !maj_nilp(itr.clone()).to_bool() {
        let cdar = maj_cdr(itr.clone());
        if maj_atomp(cdar.clone()).to_bool()
            && !maj_nilp(cdar.clone()).to_bool() {
                return maj_err(
                    Maj::string("Cannot append to dotted list"),
                    Maj::nil());
            }
        v.push(maj_car(itr.clone()));
        itr = cdar;
    }
    itr = cadr.clone();
    for obj in v.iter().rev() {
        itr = Maj::cons(obj.clone(), itr.clone());
    }
    maj_append(maj_dotted_list!(itr.clone(), cddr))
}
#+end_src

** ~(last x)~

#+begin_src rust
pub fn maj_last(x: Gc<Maj>) -> Gc<Maj> {
    if !maj_consp(x.clone()).to_bool() {
        return maj_err(
            Maj::string("{} is not a cons"),
            maj_list!(x));
    }

    let mut itr = x;
    loop {
        let cdr = maj_cdr(itr.clone());
        if !maj_consp(cdr.clone()).to_bool() {
            return itr;
        }
        itr = cdr;
    }
}
#+end_src

** ~(reverse x)~

#+begin_src rust
pub fn maj_reverse(x: Gc<Maj>) -> Gc<Maj> {
    use crate::axioms::predicates::maj_atomp;
    if !maj_consp(x.clone()).to_bool() {
        return maj_err(
            Maj::string("{} is not a cons"),
            maj_list!(x));
    }

    let mut itr = x.clone();
    let mut newlist = Maj::nil();
    while !maj_nilp(itr.clone()).to_bool() {
        newlist = Maj::cons(maj_car(itr.clone()), newlist);
        itr = maj_cdr(itr);
        let is_atom = maj_atomp(itr.clone()).to_bool();
        if is_atom && !maj_nilp(itr.clone()).to_bool() {
            return maj_err(
                Maj::string("Not a proper list: {}"),
                maj_list!(x));
        }
    }
    newlist
}
#+end_src

** ~(nthcdr n lst)~

#+begin_src rust
pub fn maj_nthcdr(n: Gc<Maj>, lst: Gc<Maj>) -> Gc<Maj> {
    use crate::axioms::predicates::maj_integerp;
    if maj_nilp(lst.clone()).to_bool() {
        return Maj::nil();
    }

    if !maj_integerp(n.clone()).to_bool() {
        return maj_err(Maj::string("{} is not an integer"),
                       maj_list!(n))
    }

    let mut num = n.to_integer().unwrap();
    if num < 0 {
        return maj_err(Maj::string("{} is not a valid index"),
                       maj_list!(n));
    }

    let mut iter = lst.clone();
    loop {
        if !maj_consp(iter.clone()).to_bool() &&
            !maj_nilp(iter.clone()).to_bool()
        {
            return maj_err(Maj::string("{} is not a list"),
                           maj_list!(iter));
        }
        if num <= 0 { break; }
        num -= 1;
        iter = maj_cdr(iter);
    }
    iter
}
#+end_src

** ~(nth n lst)~

#+begin_src rust
pub fn maj_nth(n: Gc<Maj>, lst: Gc<Maj>) -> Gc<Maj> {
    let cons = maj_nthcdr(n, lst);
    if maj_errorp(cons.clone()).to_bool() {
        cons
    } else {
        maj_car(cons)
    }
}
#+end_src

