05-03-funcoes-primitivas.html

<div id="outline-container-orged2ac09" class="outline-2">
<h2 id="orged2ac09"><span class="section-number-2">18.</span> <code>(append . rest)</code></h2>
<div class="outline-text-2" id="text-18">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_append</span>(<span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::maj_dotted_list;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_atomp;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">car</span>  = maj_car(rest.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">cdr</span>  = maj_cdr(rest.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">cadr</span> = maj_car(cdr.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">cddr</span> = maj_cdr(cdr.clone());

    <span style="color: #569cd6;">if</span> maj_nilp(cdr.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> car;
    }

    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">itr</span> = car.clone();
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">v</span> = <span style="color: #4ec9b0;">Vec</span>::new();
    <span style="color: #569cd6;">while</span> !maj_nilp(itr.clone()).to_bool() {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">cdar</span> = maj_cdr(itr.clone());
        <span style="color: #569cd6;">if</span> maj_atomp(cdar.clone()).to_bool()
            &amp;&amp; !maj_nilp(cdar.clone()).to_bool() {
                <span style="color: #569cd6;">return</span> maj_err(
                    <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Cannot append to dotted list"</span>),
                    <span style="color: #4ec9b0;">Maj</span>::nil());
            }
        v.push(maj_car(itr.clone()));
        itr = cdar;
    }
    itr = cadr.clone();
    <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">obj</span> <span style="color: #569cd6;">in</span> v.iter().rev() {
        itr = <span style="color: #4ec9b0;">Maj</span>::cons(obj.clone(), itr.clone());
    }
    maj_append(<span style="color: #c586c0;">maj_dotted_list!</span>(itr.clone(), cddr))
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc41b0f4" class="outline-2">
<h2 id="orgc41b0f4"><span class="section-number-2">19.</span> <code>(last x)</code></h2>
<div class="outline-text-2" id="text-19">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_last</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> !maj_consp(x.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a cons"</span>),
            <span style="color: #c586c0;">maj_list!</span>(x));
    }

    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">itr</span> = x;
    <span style="color: #569cd6;">loop</span> {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">cdr</span> = maj_cdr(itr.clone());
        <span style="color: #569cd6;">if</span> !maj_consp(cdr.clone()).to_bool() {
            <span style="color: #569cd6;">return</span> itr;
        }
        itr = cdr;
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6697d56" class="outline-2">
<h2 id="org6697d56"><span class="section-number-2">20.</span> <code>(reverse x)</code></h2>
<div class="outline-text-2" id="text-20">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_reverse</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_atomp;
    <span style="color: #569cd6;">if</span> !maj_consp(x.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a cons"</span>),
            <span style="color: #c586c0;">maj_list!</span>(x));
    }

    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">itr</span> = x.clone();
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">newlist</span> = <span style="color: #4ec9b0;">Maj</span>::nil();
    <span style="color: #569cd6;">while</span> !maj_nilp(itr.clone()).to_bool() {
        newlist = <span style="color: #4ec9b0;">Maj</span>::cons(maj_car(itr.clone()), newlist);
        itr = maj_cdr(itr);
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">is_atom</span> = maj_atomp(itr.clone()).to_bool();
        <span style="color: #569cd6;">if</span> is_atom &amp;&amp; !maj_nilp(itr.clone()).to_bool() {
            <span style="color: #569cd6;">return</span> maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Not a proper list: {}"</span>),
                <span style="color: #c586c0;">maj_list!</span>(x));
        }
    }
    newlist
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge8ea921" class="outline-2">
<h2 id="orge8ea921"><span class="section-number-2">21.</span> <code>(nthcdr n lst)</code></h2>
<div class="outline-text-2" id="text-21">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_nthcdr</span>(<span style="color: #9cdcfe;">n</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">lst</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_integerp;
    <span style="color: #569cd6;">if</span> maj_nilp(lst.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::nil();
    }

    <span style="color: #569cd6;">if</span> !maj_integerp(n.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not an integer"</span>),
                       <span style="color: #c586c0;">maj_list!</span>(n))
    }

    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">num</span> = n.to_integer().unwrap();
    <span style="color: #569cd6;">if</span> num &lt; 0 {
        <span style="color: #569cd6;">return</span> maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a valid index"</span>),
                       <span style="color: #c586c0;">maj_list!</span>(n));
    }

    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">iter</span> = lst.clone();
    <span style="color: #569cd6;">loop</span> {
        <span style="color: #569cd6;">if</span> !maj_consp(iter.clone()).to_bool() &amp;&amp;
            !maj_nilp(iter.clone()).to_bool()
        {
            <span style="color: #569cd6;">return</span> maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a list"</span>),
                           <span style="color: #c586c0;">maj_list!</span>(iter));
        }
        <span style="color: #569cd6;">if</span> num &lt;= 0 { <span style="color: #569cd6;">break</span>; }
        num -= 1;
        iter = maj_cdr(iter);
    }
    iter
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6c6c88c" class="outline-2">
<h2 id="org6c6c88c"><span class="section-number-2">22.</span> <code>(nth n lst)</code></h2>
<div class="outline-text-2" id="text-22">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_nth</span>(<span style="color: #9cdcfe;">n</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">lst</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">cons</span> = maj_nthcdr(n, lst);
    <span style="color: #569cd6;">if</span> maj_errorp(cons.clone()).to_bool() {
        cons
    } <span style="color: #569cd6;">else</span> {
        maj_car(cons)
    }
}
</pre>
</div>
</div>
</div>
