05-03-funcoes-primitivas.org
** ~(macroexpand-1 x)~

#+begin_src rust
pub fn maj_macroexpand_1(mut state: &mut MajState,
                         expr: Gc<Maj>,
                         env: Gc<Maj>) -> (Gc<Maj>, bool) {
    use crate::evaluator::application::expand_macro;

    if !maj_consp(expr.clone()).to_bool() {
        return (expr, true);
    }

    let mac = maj_car(expr.clone());
    let args = maj_cdr(expr.clone());

    let mac = state.lookup(env.clone(), mac);
    expand_macro(&mut state, mac, args, env)
}
#+end_src

** TODO ~(macroexpand x)~

** ~(not x)~

#+begin_src rust
#[inline]
pub fn maj_not(x: Gc<Maj>) -> Gc<Maj> {
    maj_nilp(x)
}
#+end_src

** ~(gensym)~

#+begin_src rust
#[inline]
pub fn maj_gensym(mut state: &mut MajState) -> Gc<Maj> {
    Maj::gensym(&mut state)
}
#+end_src

** Funções numéricas

