05-03-funcoes-primitivas.html

<div id="outline-container-orgfd8c4c0" class="outline-2">
<h2 id="orgfd8c4c0"><span class="section-number-2">23.</span> <code>(macroexpand-1 x)</code></h2>
<div class="outline-text-2" id="text-23">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_macroexpand_1</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                         <span style="color: #9cdcfe;">expr</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                         <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; (<span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #4ec9b0;">bool</span>) {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">evaluator</span>::<span style="color: #569cd6;">application</span>::expand_macro;

    <span style="color: #569cd6;">if</span> !maj_consp(expr.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> (expr, <span style="color: #569cd6;">true</span>);
    }

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">mac</span> = maj_car(expr.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">args</span> = maj_cdr(expr.clone());

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">mac</span> = state.lookup(env.clone(), mac);
    expand_macro(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, mac, args, env)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5284f8a" class="outline-2">
<h2 id="org5284f8a"><span class="section-number-2">24.</span> <span class="todo TODO">TODO</span> <code>(macroexpand x)</code></h2>
</div>

<div id="outline-container-orgaea254e" class="outline-2">
<h2 id="orgaea254e"><span class="section-number-2">25.</span> <code>(not x)</code></h2>
<div class="outline-text-2" id="text-25">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[inline]</span>
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_not</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    maj_nilp(x)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd382459" class="outline-2">
<h2 id="orgd382459"><span class="section-number-2">26.</span> <code>(gensym)</code></h2>
<div class="outline-text-2" id="text-26">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[inline]</span>
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_gensym</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #4ec9b0;">Maj</span>::gensym(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0e58517" class="outline-2">
<h2 id="org0e58517"><span class="section-number-2">27.</span> Funções numéricas</h2>
<div class="outline-text-2" id="text-27">
</div>
