05-03-funcoes-primitivas.org
*** ~(number-coerce x subtype)~

#+begin_src rust
pub fn maj_number_coerce(
    mut state: &mut MajState,
    subtype: Gc<Maj>,
    number: Gc<Maj>
) -> Gc<Maj> {
    use crate::printing::maj_format;
    use crate::axioms::predicates::maj_symbolp;

    if !maj_numberp(number.clone()).to_bool() {
        return maj_err(Maj::string("{} is not a number"),
                       maj_list!(number));
    }

    if !maj_symbolp(subtype.clone()).to_bool() {
        return maj_err(Maj::string("{} is not a symbol"),
                       maj_list!(subtype));
    }


    let number_type = maj_type(&mut state, number.clone());
    let number_type = number_type.to_raw_sym().unwrap();
    let number_type = FromPrimitive::from_u64(number_type)
        .unwrap();

    let coerce_type = subtype.to_raw_sym().unwrap();
    let coerce_type = FromPrimitive::from_u64(coerce_type);

    match number_type {
        MajRawSym::Integer => match coerce_type {
            Some(MajRawSym::Integer) => number,
            Some(MajRawSym::Float) => {
                Maj::float(number.to_forced_float().unwrap())
            },
            Some(MajRawSym::Fraction) => {
                Maj::fraction(number.to_integer().unwrap(), 1)
            },
            Some(MajRawSym::Complex) => {
                Maj::complex(number.clone(), Maj::float(0.0))
            },
            _ => maj_err(
                Maj::string("{} is not a number subtype"),
                maj_list!(subtype)),
        },
        MajRawSym::Float => match coerce_type {
            Some(MajRawSym::Integer) => {
                Maj::integer(number
                             .to_float()
                             .unwrap()
                             .trunc()
                             as i64)
            },
            Some(MajRawSym::Float) => number,
            Some(MajRawSym::Fraction) => {
                let mut buffer = maj_format(&state, number);
                let dot_index = buffer.find('.').unwrap();
                let denom_pow = (buffer.len() - dot_index - 1) as u32;
                let denom = 10_i64.pow(denom_pow);
                buffer.remove(dot_index);
                let frac =
                    Maj::fraction(buffer.parse().unwrap(), denom);
                simplify_frac(frac).unwrap()
            },
            Some(MajRawSym::Complex) => {
                Maj::complex(number.clone(), Maj::float(0.0))
            },
            _ => maj_err(
                Maj::string("{} is not a number subtype"),
                maj_list!(subtype)),
        },
        MajRawSym::Fraction => match coerce_type {
            Some(MajRawSym::Integer) => {
                Maj::integer(number.to_forced_float()
                             .unwrap()
                             .trunc()
                             as i64)
            },
            Some(MajRawSym::Float) => {
                Maj::float(number.to_forced_float()
                           .unwrap())
            },
            Some(MajRawSym::Fraction) => number,
            Some(MajRawSym::Complex) => {
                Maj::complex(number.clone(), Maj::float(0.0))
            },
            _ => maj_err(
                Maj::string("{} is not a number subtype"),
                maj_list!(subtype)),
        },
        MajRawSym::Complex => match coerce_type {
            Some(MajRawSym::Integer) |
            Some(MajRawSym::Float)   |
            Some(MajRawSym::Fraction) => {
                let realpart = maj_real_part(number);
                maj_number_coerce(&mut state, subtype, realpart)
            },
            Some(MajRawSym::Complex) => number,
            _ => maj_err(
                Maj::string("{} is not a number subtype"),
                maj_list!(subtype)),
        },
        _ => panic!("Symbol is not a number subtype"),
    }
}
#+end_src

