05-03-funcoes-primitivas.html
<div id="outline-container-org926f802" class="outline-3">
<h3 id="org926f802"><span class="section-number-3">27.1.</span> <code>(number-coerce x subtype)</code></h3>
<div class="outline-text-3" id="text-27-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_number_coerce</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">subtype</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">number</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">printing</span>::maj_format;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_symbolp;

    <span style="color: #569cd6;">if</span> !maj_numberp(number.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                       <span style="color: #c586c0;">maj_list!</span>(number));
    }

    <span style="color: #569cd6;">if</span> !maj_symbolp(subtype.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a symbol"</span>),
                       <span style="color: #c586c0;">maj_list!</span>(subtype));
    }


    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">number_type</span> = maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, number.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">number_type</span> = number_type.to_raw_sym().unwrap();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">number_type</span> = <span style="color: #4ec9b0;">FromPrimitive</span>::from_u64(number_type)
        .unwrap();

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">coerce_type</span> = subtype.to_raw_sym().unwrap();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">coerce_type</span> = <span style="color: #4ec9b0;">FromPrimitive</span>::from_u64(coerce_type);

    <span style="color: #569cd6;">match</span> number_type {
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span> =&gt; <span style="color: #569cd6;">match</span> coerce_type {
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span>) =&gt; number,
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span>) =&gt; {
                <span style="color: #4ec9b0;">Maj</span>::float(number.to_forced_float().unwrap())
            },
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span>) =&gt; {
                <span style="color: #4ec9b0;">Maj</span>::fraction(number.to_integer().unwrap(), 1)
            },
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span>) =&gt; {
                <span style="color: #4ec9b0;">Maj</span>::complex(number.clone(), <span style="color: #4ec9b0;">Maj</span>::float(0.0))
            },
            _ =&gt; maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number subtype"</span>),
                <span style="color: #c586c0;">maj_list!</span>(subtype)),
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span> =&gt; <span style="color: #569cd6;">match</span> coerce_type {
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span>) =&gt; {
                <span style="color: #4ec9b0;">Maj</span>::integer(number
                             .to_float()
                             .unwrap()
                             .trunc()
                             <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">i64</span>)
            },
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span>) =&gt; number,
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span>) =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">buffer</span> = maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, number);
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">dot_index</span> = buffer.find(<span style="color: #ce9178;">'.'</span>).unwrap();
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">denom_pow</span> = (buffer.len() - dot_index - 1) <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">u32</span>;
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">denom</span> = 10_<span style="color: #4ec9b0;">i64</span>.pow(denom_pow);
                buffer.remove(dot_index);
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">frac</span> =
                    <span style="color: #4ec9b0;">Maj</span>::fraction(buffer.parse().unwrap(), denom);
                simplify_frac(frac).unwrap()
            },
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span>) =&gt; {
                <span style="color: #4ec9b0;">Maj</span>::complex(number.clone(), <span style="color: #4ec9b0;">Maj</span>::float(0.0))
            },
            _ =&gt; maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number subtype"</span>),
                <span style="color: #c586c0;">maj_list!</span>(subtype)),
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span> =&gt; <span style="color: #569cd6;">match</span> coerce_type {
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span>) =&gt; {
                <span style="color: #4ec9b0;">Maj</span>::integer(number.to_forced_float()
                             .unwrap()
                             .trunc()
                             <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">i64</span>)
            },
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span>) =&gt; {
                <span style="color: #4ec9b0;">Maj</span>::float(number.to_forced_float()
                           .unwrap())
            },
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span>) =&gt; number,
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span>) =&gt; {
                <span style="color: #4ec9b0;">Maj</span>::complex(number.clone(), <span style="color: #4ec9b0;">Maj</span>::float(0.0))
            },
            _ =&gt; maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number subtype"</span>),
                <span style="color: #c586c0;">maj_list!</span>(subtype)),
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span> =&gt; <span style="color: #569cd6;">match</span> coerce_type {
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span>) |
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span>)   |
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span>) =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">realpart</span> = maj_real_part(number);
                maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, subtype, realpart)
            },
            <span style="color: #4ec9b0;">Some</span>(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span>) =&gt; number,
            _ =&gt; maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number subtype"</span>),
                <span style="color: #c586c0;">maj_list!</span>(subtype)),
        },
        _ =&gt; <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Symbol is not a number subtype"</span>),
    }
}
</pre>
</div>
</div>
</div>
