05-03-funcoes-primitivas.org
*** ~(real-part x)~

#+begin_src rust
pub fn maj_real_part(x: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajNumber;
    match &*x.clone() {
        Maj::Number(num) => {
            match &num.clone() {
                MajNumber::Complex {
                    real,
                    imag: _
                } => {
                    let real = &*real.clone();
                    Gc::new(Maj::Number(real.clone()))
                },
                _ => maj_err(Maj::string(
                    "{} is not a complex number"),
                    maj_list!(x)),
            }
        },
        _ => maj_err(Maj::string("{} is not a number"),
                     maj_list!(x)),
    }
}
#+end_src

*** ~(imag-part x)~

#+begin_src rust
pub fn maj_imag_part(x: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajNumber;
    match &*x.clone() {
        Maj::Number(num) => {
            match &num.clone() {
                MajNumber::Complex {
                    real: _,
                    imag
                } => {
                    let imag = &*imag.clone();
                    Gc::new(Maj::Number(imag.clone()))
                },
                _ => maj_err(Maj::string(
                    "{} is not a complex number"),
                    maj_list!(x)),
            }
        },
        _ => maj_err(Maj::string("{} is not a number"),
                     maj_list!(x)),
    }
}
#+end_src

*** ~(numer x)~

#+begin_src rust
pub fn maj_numer(x: Gc<Maj>) -> Gc<Maj> {
    if !maj_numberp(x.clone()).to_bool() {
        maj_err(Maj::string("{} is not a number"),
                maj_list!(x))
    } else {
        match x.clone().to_fraction() {
            Some((numer, _)) => Maj::integer(numer),
            None => maj_err(Maj::string("{} is not a fraction"),
                            maj_list!(x)),
        }
    }
}
#+end_src

*** ~(denom x)~

#+begin_src rust
pub fn maj_denom(x: Gc<Maj>) -> Gc<Maj> {
    if !maj_numberp(x.clone()).to_bool() {
        maj_err(Maj::string("{} is not a number"),
                maj_list!(x))
    } else {
        match x.clone().to_fraction() {
            Some((_, denom)) => Maj::integer(denom),
            None => maj_err(Maj::string("{} is not a fraction"),
                            maj_list!(x)),
        }
    }
}
#+end_src

