05-03-funcoes-primitivas.html

<div id="outline-container-org21a5e79" class="outline-3">
<h3 id="org21a5e79"><span class="section-number-3">27.2.</span> <code>(real-part x)</code></h3>
<div class="outline-text-3" id="text-27-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_real_part</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajNumber</span>;
    <span style="color: #569cd6;">match</span> <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x.clone() {
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(num) =&gt; {
            <span style="color: #569cd6;">match</span> <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>num.clone() {
                <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Complex</span> {
                    real,
                    <span style="color: #9cdcfe;">imag</span>: _
                } =&gt; {
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">real</span> = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*real.clone();
                    <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(real.clone()))
                },
                _ =&gt; maj_err(<span style="color: #4ec9b0;">Maj</span>::string(
                    <span style="color: #ce9178;">"{} is not a complex number"</span>),
                    <span style="color: #c586c0;">maj_list!</span>(x)),
            }
        },
        _ =&gt; maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                     <span style="color: #c586c0;">maj_list!</span>(x)),
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org03ed51b" class="outline-3">
<h3 id="org03ed51b"><span class="section-number-3">27.3.</span> <code>(imag-part x)</code></h3>
<div class="outline-text-3" id="text-27-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_imag_part</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajNumber</span>;
    <span style="color: #569cd6;">match</span> <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x.clone() {
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(num) =&gt; {
            <span style="color: #569cd6;">match</span> <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>num.clone() {
                <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Complex</span> {
                    <span style="color: #9cdcfe;">real</span>: _,
                    imag
                } =&gt; {
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">imag</span> = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*imag.clone();
                    <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(imag.clone()))
                },
                _ =&gt; maj_err(<span style="color: #4ec9b0;">Maj</span>::string(
                    <span style="color: #ce9178;">"{} is not a complex number"</span>),
                    <span style="color: #c586c0;">maj_list!</span>(x)),
            }
        },
        _ =&gt; maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                     <span style="color: #c586c0;">maj_list!</span>(x)),
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org33aab02" class="outline-3">
<h3 id="org33aab02"><span class="section-number-3">27.4.</span> <code>(numer x)</code></h3>
<div class="outline-text-3" id="text-27-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_numer</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> !maj_numberp(x.clone()).to_bool() {
        maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                <span style="color: #c586c0;">maj_list!</span>(x))
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #569cd6;">match</span> x.clone().to_fraction() {
            <span style="color: #4ec9b0;">Some</span>((numer, _)) =&gt; <span style="color: #4ec9b0;">Maj</span>::integer(numer),
            <span style="color: #4ec9b0;">None</span> =&gt; maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a fraction"</span>),
                            <span style="color: #c586c0;">maj_list!</span>(x)),
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org76eb121" class="outline-3">
<h3 id="org76eb121"><span class="section-number-3">27.5.</span> <code>(denom x)</code></h3>
<div class="outline-text-3" id="text-27-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_denom</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> !maj_numberp(x.clone()).to_bool() {
        maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                <span style="color: #c586c0;">maj_list!</span>(x))
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #569cd6;">match</span> x.clone().to_fraction() {
            <span style="color: #4ec9b0;">Some</span>((_, denom)) =&gt; <span style="color: #4ec9b0;">Maj</span>::integer(denom),
            <span style="color: #4ec9b0;">None</span> =&gt; maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a fraction"</span>),
                            <span style="color: #c586c0;">maj_list!</span>(x)),
        }
    }
}
</pre>
</div>
</div>
</div>
