05-03-funcoes-primitivas.org
*** ~(richest-number-type x y)~

#+begin_src rust
pub fn maj_richest_number_type(
    mut state: &mut MajState,
    x: Gc<Maj>,
    y: Gc<Maj>
) -> Gc<Maj> {
    if !maj_numberp(x.clone()).to_bool() {
        return maj_err(Maj::string("{} is not a number"),
                       maj_list!(x));
    }
    if !maj_numberp(y.clone()).to_bool() {
        return maj_err(Maj::string("{} is not a number"),
                       maj_list!(y));
    }

    let x_type = maj_type(&mut state, x.clone());
    let x_type_sym = x_type.to_raw_sym().unwrap();
    let x_type_sym = FromPrimitive::from_u64(x_type_sym).unwrap();

    let y_type = maj_type(&mut state, y.clone());
    let y_type_sym = y_type.to_raw_sym().unwrap();
    let y_type_sym = FromPrimitive::from_u64(y_type_sym).unwrap();

    match x_type_sym {
        MajRawSym::Integer => {
            match y_type_sym {
                MajRawSym::Integer  |
                MajRawSym::Float    |
                MajRawSym::Fraction |
                MajRawSym::Complex  => y_type,
                _ => unimplemented!(
                    "Usage of unknown number subtype"),
            }
        },
        MajRawSym::Float => {
            match y_type_sym {
                MajRawSym::Integer  => x_type,
                MajRawSym::Float    |
                MajRawSym::Fraction |
                MajRawSym::Complex  => y_type,
                _ => unimplemented!(
                    "Usage of unknown number subtype"),
            }
        },
        MajRawSym::Fraction => {
            match y_type_sym {
                MajRawSym::Integer |
                MajRawSym::Float   |
                MajRawSym::Fraction => x_type,
                MajRawSym::Complex  => y_type,
                _ => unimplemented!(
                    "Usage of unknown number subtype"),
            }
        },
        MajRawSym::Complex => {
            match y_type_sym {
                MajRawSym::Integer  |
                MajRawSym::Float    |
                MajRawSym::Fraction |
                MajRawSym::Complex  => x_type,
                _ => unimplemented!(
                    "Usage of unknown number subtype"),
            }
        },
        _ => unimplemented!("Usage of unknown number subtype"),
    }
}
#+end_src

*** ~(rich-number-coerce x y)~

#+begin_src rust
pub fn maj_rich_number_coerce(
    mut state: &mut MajState,
    x: Gc<Maj>,
    y: Gc<Maj>
) -> Gc<Maj> {
    let best_type = maj_richest_number_type(&mut state,
                                            x.clone(),
                                            y.clone());
    if maj_errorp(best_type.clone()).to_bool() {
        return best_type;
    }
    maj_list!(maj_number_coerce(&mut state,
                                best_type.clone(), x),
              maj_number_coerce(&mut state, best_type, y))
}
#+end_src

*** ~(iota n)~

#+begin_src rust
#[inline]
pub fn maj_iota(n: Gc<Maj>) -> Gc<Maj> {
    use crate::axioms::predicates::maj_integerp;
    let common_err = maj_err(
        Maj::string("iota expects a positive integer number"),
        Maj::nil());
    if !maj_integerp(n.clone()).to_bool() {
        common_err
    } else {
        let mut num = n.to_integer().unwrap();
        if num < 0 {
            common_err
        } else {
            let mut list = Maj::nil();
            while num > 0 {
                list = Maj::cons(Maj::integer(num - 1), list);
                num -= 1;
            }
            list
        }
    }
}
#+end_src

** TODO Funções de comparação

#+begin_src rust
use crate::axioms::predicates::maj_zerop;
#+end_src

*** Funções de ajuda e ferramentas
