05-03-funcoes-primitivas.html

<div id="outline-container-org317c11b" class="outline-3">
<h3 id="org317c11b"><span class="section-number-3">27.6.</span> <code>(richest-number-type x y)</code></h3>
<div class="outline-text-3" id="text-27-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_richest_number_type</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> !maj_numberp(x.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                       <span style="color: #c586c0;">maj_list!</span>(x));
    }
    <span style="color: #569cd6;">if</span> !maj_numberp(y.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                       <span style="color: #c586c0;">maj_list!</span>(y));
    }

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x_type</span> = maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, x.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x_type_sym</span> = x_type.to_raw_sym().unwrap();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x_type_sym</span> = <span style="color: #4ec9b0;">FromPrimitive</span>::from_u64(x_type_sym).unwrap();

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y_type</span> = maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, y.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y_type_sym</span> = y_type.to_raw_sym().unwrap();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y_type_sym</span> = <span style="color: #4ec9b0;">FromPrimitive</span>::from_u64(y_type_sym).unwrap();

    <span style="color: #569cd6;">match</span> x_type_sym {
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span> =&gt; {
            <span style="color: #569cd6;">match</span> y_type_sym {
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span>  |
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span>    |
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span> |
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span>  =&gt; y_type,
                _ =&gt; <span style="color: #c586c0;">unimplemented!</span>(
                    <span style="color: #ce9178;">"Usage of unknown number subtype"</span>),
            }
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span> =&gt; {
            <span style="color: #569cd6;">match</span> y_type_sym {
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span>  =&gt; x_type,
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span>    |
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span> |
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span>  =&gt; y_type,
                _ =&gt; <span style="color: #c586c0;">unimplemented!</span>(
                    <span style="color: #ce9178;">"Usage of unknown number subtype"</span>),
            }
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span> =&gt; {
            <span style="color: #569cd6;">match</span> y_type_sym {
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span> |
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span>   |
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span> =&gt; x_type,
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span>  =&gt; y_type,
                _ =&gt; <span style="color: #c586c0;">unimplemented!</span>(
                    <span style="color: #ce9178;">"Usage of unknown number subtype"</span>),
            }
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span> =&gt; {
            <span style="color: #569cd6;">match</span> y_type_sym {
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span>  |
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span>    |
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span> |
                <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span>  =&gt; x_type,
                _ =&gt; <span style="color: #c586c0;">unimplemented!</span>(
                    <span style="color: #ce9178;">"Usage of unknown number subtype"</span>),
            }
        },
        _ =&gt; <span style="color: #c586c0;">unimplemented!</span>(<span style="color: #ce9178;">"Usage of unknown number subtype"</span>),
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfdc67db" class="outline-3">
<h3 id="orgfdc67db"><span class="section-number-3">27.7.</span> <code>(rich-number-coerce x y)</code></h3>
<div class="outline-text-3" id="text-27-7">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_rich_number_coerce</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">best_type</span> = maj_richest_number_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                                            x.clone(),
                                            y.clone());
    <span style="color: #569cd6;">if</span> maj_errorp(best_type.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> best_type;
    }
    <span style="color: #c586c0;">maj_list!</span>(maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                                best_type.clone(), x),
              maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, best_type, y))
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga04262f" class="outline-3">
<h3 id="orga04262f"><span class="section-number-3">27.8.</span> <code>(iota n)</code></h3>
<div class="outline-text-3" id="text-27-8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[inline]</span>
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_iota</span>(<span style="color: #9cdcfe;">n</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_integerp;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">common_err</span> = maj_err(
        <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"iota expects a positive integer number"</span>),
        <span style="color: #4ec9b0;">Maj</span>::nil());
    <span style="color: #569cd6;">if</span> !maj_integerp(n.clone()).to_bool() {
        common_err
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">num</span> = n.to_integer().unwrap();
        <span style="color: #569cd6;">if</span> num &lt; 0 {
            common_err
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">list</span> = <span style="color: #4ec9b0;">Maj</span>::nil();
            <span style="color: #569cd6;">while</span> num &gt; 0 {
                list = <span style="color: #4ec9b0;">Maj</span>::cons(<span style="color: #4ec9b0;">Maj</span>::integer(num - 1), list);
                num -= 1;
            }
            list
        }
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb4b2bd3" class="outline-2">
<h2 id="orgb4b2bd3"><span class="section-number-2">28.</span> <span class="todo TODO">TODO</span> Funções de comparação</h2>
<div class="outline-text-2" id="text-28">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_zerop;
</pre>
</div>
</div>
