05-03-funcoes-primitivas.org
**** Ajudante de coerções aritméticas

#+begin_src rust
fn maj_arithm_coercion_helper(
    mut state: &mut MajState,
    x: Gc<Maj>,
    y: Gc<Maj>
) -> Result<(Gc<Maj>, Gc<Maj>, MajRawSym), Gc<Maj>> {
    if !maj_numberp(x.clone()).to_bool() {
        return Err(maj_err(
            Maj::string("{} is not a number"),
            maj_list!(x)));
    }
    if !maj_numberp(y.clone()).to_bool() {
        return Err(maj_err(
            Maj::string("{} is not a number"),
            maj_list!(y)));
    }
    // Perform rich coercion
    let coerced = maj_rich_number_coerce(&mut state, x, y);
    if maj_errorp(coerced.clone()).to_bool() {
        return Err(coerced);
    }
    let x = maj_car(coerced.clone());
    let y = maj_car(maj_cdr(coerced));
    let ntype = maj_type(&mut state, x.clone());

    Ok((x, y,
        FromPrimitive::from_u64(ntype.to_raw_sym()
                                .unwrap())
        .unwrap()))
}
#+end_src

**** Tipos de despacho de aritmética

#+begin_src rust
#[derive(Debug)]
enum MajArithmFnType {
    Equals,
    Greater,
    Lesser,
    Plus,
    Minus,
    Multiply,
    Divide,
}
#+end_src

**** Ajudante de despacho de aritmética

#+begin_src rust
fn maj_arithm_dispatch(
    mut state: &mut MajState,
    env: Gc<Maj>,
    fntype: MajArithmFnType,
    x: Gc<Maj>,
    y: Gc<Maj>,
    rest: Gc<Maj>,
    accum: bool
) -> Gc<Maj> {
    let mut origy = y.clone();
    match maj_arithm_coercion_helper(&mut state, x, y.clone()) {
        Err(e) => e,
        Ok((x, y, ntype)) => {
            let result =
                match fntype {
                    MajArithmFnType::Equals => {
                        maj_arithm_internal_eq(
                            &mut state, env.clone(),
                            x, y, ntype)
                    },
                    MajArithmFnType::Greater => {
                        maj_arithm_internal_gl(
                            x, y, ntype, true)
                    },
                    MajArithmFnType::Lesser => {
                        maj_arithm_internal_gl(
                            x, y, ntype, false)
                    },
                    MajArithmFnType::Plus => {
                        maj_arithm_internal_sum(
                            &mut state, env.clone(),
                            x, y, ntype)
                    },
                    MajArithmFnType::Minus => {
                        maj_arithm_internal_subtract(
                            &mut state, env.clone(),
                            x, y, ntype)
                    },
                    MajArithmFnType::Multiply => {
                        maj_arithm_internal_multiply(
                            &mut state, env.clone(),
                            x, y, ntype)
                    },
                    MajArithmFnType::Divide => {
                        maj_arithm_internal_divide(
                            &mut state, env.clone(),
                            x, y, ntype)
                    },
                };

            let result = match result {
                Ok(b) => b,
                Err(e) => return e,
            };

            if accum {
                origy = result.clone();
            }

            if !maj_nilp(rest.clone()).to_bool() {
                maj_arithm_dispatch(
                    &mut state, env,
                    fntype,
                    origy,
                    maj_car(rest.clone()),
                    maj_cdr(rest),
                    accum)
            } else {
                result
            }
        }
    }
}
#+end_src

