05-03-funcoes-primitivas.html

<div id="outline-container-org67cdc05" class="outline-3">
<h3 id="org67cdc05"><span class="section-number-3">28.1.</span> Funções de ajuda e ferramentas</h3>
<div class="outline-text-3" id="text-28-1">
</div>
<div id="outline-container-org1b77933" class="outline-4">
<h4 id="org1b77933"><span class="section-number-4">28.1.1.</span> Ajudante de coerções aritméticas</h4>
<div class="outline-text-4" id="text-28-1-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_coercion_helper</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Result</span>&lt;(<span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #4ec9b0;">MajRawSym</span>), <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;&gt; {
    <span style="color: #569cd6;">if</span> !maj_numberp(x.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Err</span>(maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
            <span style="color: #c586c0;">maj_list!</span>(x)));
    }
    <span style="color: #569cd6;">if</span> !maj_numberp(y.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Err</span>(maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
            <span style="color: #c586c0;">maj_list!</span>(y)));
    }
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Perform rich coercion</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">coerced</span> = maj_rich_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, x, y);
    <span style="color: #569cd6;">if</span> maj_errorp(coerced.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Err</span>(coerced);
    }
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = maj_car(coerced.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = maj_car(maj_cdr(coerced));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">ntype</span> = maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, x.clone());

    <span style="color: #4ec9b0;">Ok</span>((x, y,
        <span style="color: #4ec9b0;">FromPrimitive</span>::from_u64(ntype.to_raw_sym()
                                .unwrap())
        .unwrap()))
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2be9dc1" class="outline-4">
<h4 id="org2be9dc1"><span class="section-number-4">28.1.2.</span> Tipos de despacho de aritmética</h4>
<div class="outline-text-4" id="text-28-1-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[derive(Debug)]</span>
<span style="color: #569cd6;">enum</span> <span style="color: #4ec9b0;">MajArithmFnType</span> {
    <span style="color: #4ec9b0;">Equals</span>,
    <span style="color: #4ec9b0;">Greater</span>,
    <span style="color: #4ec9b0;">Lesser</span>,
    <span style="color: #4ec9b0;">Plus</span>,
    <span style="color: #4ec9b0;">Minus</span>,
    <span style="color: #4ec9b0;">Multiply</span>,
    <span style="color: #4ec9b0;">Divide</span>,
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7213bc" class="outline-4">
<h4 id="orge7213bc"><span class="section-number-4">28.1.3.</span> Ajudante de despacho de aritmética</h4>
<div class="outline-text-4" id="text-28-1-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_dispatch</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">fntype</span>: <span style="color: #4ec9b0;">MajArithmFnType</span>,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">accum</span>: <span style="color: #4ec9b0;">bool</span>
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">origy</span> = y.clone();
    <span style="color: #569cd6;">match</span> maj_arithm_coercion_helper(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, x, y.clone()) {
        <span style="color: #4ec9b0;">Err</span>(e) =&gt; e,
        <span style="color: #4ec9b0;">Ok</span>((x, y, ntype)) =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> =
                <span style="color: #569cd6;">match</span> fntype {
                    <span style="color: #4ec9b0;">MajArithmFnType</span>::<span style="color: #4ec9b0;">Equals</span> =&gt; {
                        maj_arithm_internal_eq(
                            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                            x, y, ntype)
                    },
                    <span style="color: #4ec9b0;">MajArithmFnType</span>::<span style="color: #4ec9b0;">Greater</span> =&gt; {
                        maj_arithm_internal_gl(
                            x, y, ntype, <span style="color: #569cd6;">true</span>)
                    },
                    <span style="color: #4ec9b0;">MajArithmFnType</span>::<span style="color: #4ec9b0;">Lesser</span> =&gt; {
                        maj_arithm_internal_gl(
                            x, y, ntype, <span style="color: #569cd6;">false</span>)
                    },
                    <span style="color: #4ec9b0;">MajArithmFnType</span>::<span style="color: #4ec9b0;">Plus</span> =&gt; {
                        maj_arithm_internal_sum(
                            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                            x, y, ntype)
                    },
                    <span style="color: #4ec9b0;">MajArithmFnType</span>::<span style="color: #4ec9b0;">Minus</span> =&gt; {
                        maj_arithm_internal_subtract(
                            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                            x, y, ntype)
                    },
                    <span style="color: #4ec9b0;">MajArithmFnType</span>::<span style="color: #4ec9b0;">Multiply</span> =&gt; {
                        maj_arithm_internal_multiply(
                            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                            x, y, ntype)
                    },
                    <span style="color: #4ec9b0;">MajArithmFnType</span>::<span style="color: #4ec9b0;">Divide</span> =&gt; {
                        maj_arithm_internal_divide(
                            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                            x, y, ntype)
                    },
                };

            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> = <span style="color: #569cd6;">match</span> result {
                <span style="color: #4ec9b0;">Ok</span>(b) =&gt; b,
                <span style="color: #4ec9b0;">Err</span>(e) =&gt; <span style="color: #569cd6;">return</span> e,
            };

            <span style="color: #569cd6;">if</span> accum {
                origy = result.clone();
            }

            <span style="color: #569cd6;">if</span> !maj_nilp(rest.clone()).to_bool() {
                maj_arithm_dispatch(
                    <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env,
                    fntype,
                    origy,
                    maj_car(rest.clone()),
                    maj_cdr(rest),
                    accum)
            } <span style="color: #569cd6;">else</span> {
                result
            }
        }
    }
}
</pre>
</div>
</div>
</div>
