05-03-funcoes-primitivas.org
**** Comparação por igualdade

#+begin_src rust
fn maj_arithm_internal_eq(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>,
    y: Gc<Maj>,
    ntype: MajRawSym
) -> Result<Gc<Maj>, Gc<Maj>> {
    match ntype {
        MajRawSym::Integer => {
            let x = x.to_integer().unwrap();
            let y = y.to_integer().unwrap();
            Ok(if x == y { Maj::t() } else { Maj::nil() })
        },
        MajRawSym::Fraction => {
            let (n1, d1) = x.to_fraction().unwrap();
            let (n2, d2) = y.to_fraction().unwrap();
            Ok(if (n1 == n2) && (d1 == d2) {
                Maj::t()
            } else {
                Maj::nil()
            })
        },
        MajRawSym::Complex => {
            // Comparação recursiva.
            // Ah... eu posso realmente comparar esses
            // números dessa forma?
            let r1 = maj_real_part(x.clone());
            let i1 = maj_imag_part(x);
            let r2 = maj_real_part(y.clone());
            let i2 = maj_imag_part(y);
            let res =
                maj_arithm_eq(&mut state, env.clone(),
                              r1, r2,
                              Maj::nil()).to_bool() &&
                maj_arithm_eq(&mut state, env.clone(),
                              i1, i2,
                              Maj::nil()).to_bool();
            Ok(if res { Maj::t() } else { Maj::nil() })
        },
        MajRawSym::Float => {
            let fres =
                maj_arithm_floateq(&mut state, env.clone(),
                                   x, y);
            if maj_errorp(fres.clone()).to_bool() {
                return Err(fres);
            }
            Ok(fres)
        },
        t => panic!("{:?} is not a number subtype", t),
    }
}
#+end_src

**** Comparação de maior que / menor que

#+begin_src rust
fn maj_arithm_internal_gl(
    x: Gc<Maj>,
    y: Gc<Maj>,
    ntype: MajRawSym,
    is_greater: bool
) -> Result<Gc<Maj>, Gc<Maj>> {
    match ntype {
        MajRawSym::Integer => {
            let x = x.to_integer().unwrap();
            let y = y.to_integer().unwrap();
            let res = if is_greater {
                x > y
            } else {
                x < y
            };
            Ok(if res { Maj::t() } else { Maj::nil() })
        },
        MajRawSym::Float => {
            let x = x.to_float().unwrap();
            let y = y.to_float().unwrap();
            let res = if is_greater {
                x > y
            } else {
                x < y
            };
            Ok(if res { Maj::t() } else { Maj::nil() })
        },
        MajRawSym::Fraction => {
            // Use common denominator test
            let (n1, d1) = x.to_fraction().unwrap();
            let (n2, d2) = y.to_fraction().unwrap();
            let res = if is_greater {
                (n1 * d2) > (n2 * d1)
            } else {
                (n1 * d2) < (n2 * d1)
            };
            Ok(if res { Maj::t() } else { Maj::nil() })
        },
        MajRawSym::Complex =>
            Err(maj_err(Maj::string(
                "The set of complex numbers can't be an ordered field"),
                        Maj::nil())),
        t => panic!("{:?} is not a number subtype", t),
    }
}
#+end_src

*** ~(= x y . rest)~

#+begin_src rust
pub fn maj_arithm_eq(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>,
    y: Gc<Maj>,
    rest: Gc<Maj>
) -> Gc<Maj> {
    maj_arithm_dispatch(&mut state, env,
                        MajArithmFnType::Equals,
                        x, y, rest, false)
}
#+end_src

