05-03-funcoes-primitivas.html

<div id="outline-container-org0de633e" class="outline-4">
<h4 id="org0de633e"><span class="section-number-4">28.1.4.</span> Comparação por igualdade</h4>
<div class="outline-text-4" id="text-28-1-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_internal_eq</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">ntype</span>: <span style="color: #4ec9b0;">MajRawSym</span>
) -&gt; <span style="color: #4ec9b0;">Result</span>&lt;<span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;&gt; {
    <span style="color: #569cd6;">match</span> ntype {
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span> =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = x.to_integer().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = y.to_integer().unwrap();
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #569cd6;">if</span> x == y { <span style="color: #4ec9b0;">Maj</span>::t() } <span style="color: #569cd6;">else</span> { <span style="color: #4ec9b0;">Maj</span>::nil() })
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span> =&gt; {
            <span style="color: #569cd6;">let</span> (n1, d1) = x.to_fraction().unwrap();
            <span style="color: #569cd6;">let</span> (n2, d2) = y.to_fraction().unwrap();
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #569cd6;">if</span> (n1 == n2) &amp;&amp; (d1 == d2) {
                <span style="color: #4ec9b0;">Maj</span>::t()
            } <span style="color: #569cd6;">else</span> {
                <span style="color: #4ec9b0;">Maj</span>::nil()
            })
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span> =&gt; {
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Compara&#231;&#227;o recursiva.</span>
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Ah... eu posso realmente comparar esses</span>
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">n&#250;meros dessa forma?</span>
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">r1</span> = maj_real_part(x.clone());
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">i1</span> = maj_imag_part(x);
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">r2</span> = maj_real_part(y.clone());
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">i2</span> = maj_imag_part(y);
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">res</span> =
                maj_arithm_eq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                              r1, r2,
                              <span style="color: #4ec9b0;">Maj</span>::nil()).to_bool() &amp;&amp;
                maj_arithm_eq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                              i1, i2,
                              <span style="color: #4ec9b0;">Maj</span>::nil()).to_bool();
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #569cd6;">if</span> res { <span style="color: #4ec9b0;">Maj</span>::t() } <span style="color: #569cd6;">else</span> { <span style="color: #4ec9b0;">Maj</span>::nil() })
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span> =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fres</span> =
                maj_arithm_floateq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                                   x, y);
            <span style="color: #569cd6;">if</span> maj_errorp(fres.clone()).to_bool() {
                <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Err</span>(fres);
            }
            <span style="color: #4ec9b0;">Ok</span>(fres)
        },
        t =&gt; <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"{:?} is not a number subtype"</span>, t),
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8bfc5c1" class="outline-4">
<h4 id="org8bfc5c1"><span class="section-number-4">28.1.5.</span> Comparação de maior que / menor que</h4>
<div class="outline-text-4" id="text-28-1-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_internal_gl</span>(
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">ntype</span>: <span style="color: #4ec9b0;">MajRawSym</span>,
    <span style="color: #9cdcfe;">is_greater</span>: <span style="color: #4ec9b0;">bool</span>
) -&gt; <span style="color: #4ec9b0;">Result</span>&lt;<span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;&gt; {
    <span style="color: #569cd6;">match</span> ntype {
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span> =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = x.to_integer().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = y.to_integer().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">res</span> = <span style="color: #569cd6;">if</span> is_greater {
                x &gt; y
            } <span style="color: #569cd6;">else</span> {
                x &lt; y
            };
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #569cd6;">if</span> res { <span style="color: #4ec9b0;">Maj</span>::t() } <span style="color: #569cd6;">else</span> { <span style="color: #4ec9b0;">Maj</span>::nil() })
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span> =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = x.to_float().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = y.to_float().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">res</span> = <span style="color: #569cd6;">if</span> is_greater {
                x &gt; y
            } <span style="color: #569cd6;">else</span> {
                x &lt; y
            };
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #569cd6;">if</span> res { <span style="color: #4ec9b0;">Maj</span>::t() } <span style="color: #569cd6;">else</span> { <span style="color: #4ec9b0;">Maj</span>::nil() })
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span> =&gt; {
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Use common denominator test</span>
            <span style="color: #569cd6;">let</span> (n1, d1) = x.to_fraction().unwrap();
            <span style="color: #569cd6;">let</span> (n2, d2) = y.to_fraction().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">res</span> = <span style="color: #569cd6;">if</span> is_greater {
                (n1 * d2) &gt; (n2 * d1)
            } <span style="color: #569cd6;">else</span> {
                (n1 * d2) &lt; (n2 * d1)
            };
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #569cd6;">if</span> res { <span style="color: #4ec9b0;">Maj</span>::t() } <span style="color: #569cd6;">else</span> { <span style="color: #4ec9b0;">Maj</span>::nil() })
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span> =&gt;
            <span style="color: #4ec9b0;">Err</span>(maj_err(<span style="color: #4ec9b0;">Maj</span>::string(
                <span style="color: #ce9178;">"The set of complex numbers can't be an ordered field"</span>),
                        <span style="color: #4ec9b0;">Maj</span>::nil())),
        t =&gt; <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"{:?} is not a number subtype"</span>, t),
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0244a0a" class="outline-3">
<h3 id="org0244a0a"><span class="section-number-3">28.2.</span> <code>(= x y . rest)</code></h3>
<div class="outline-text-3" id="text-28-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_eq</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    maj_arithm_dispatch(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env,
                        <span style="color: #4ec9b0;">MajArithmFnType</span>::<span style="color: #4ec9b0;">Equals</span>,
                        x, y, rest, <span style="color: #569cd6;">false</span>)
}
</pre>
</div>
</div>
</div>
