05-03-funcoes-primitivas.org
*** ~(float= x y)~

#+begin_src rust
pub fn maj_arithm_floateq(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>,
    y: Gc<Maj>
) -> Gc<Maj> {
    use crate::axioms::predicates::maj_floatp;
    use core::f64;
    use float_cmp::approx_eq;
    if !maj_floatp(x.clone()).to_bool() {
        return maj_err(Maj::string("{} is not a float number"),
                       maj_list!(x));
    } else if !maj_floatp(y.clone()).to_bool() {
        return maj_err(Maj::string("{} is not a float number"),
                       maj_list!(y));
    }

    let ulps = Maj::symbol(&mut state, "*ulps*");
    let ulps = state.lookup(env, ulps);
    if maj_errorp(ulps.clone()).to_bool() {
        return ulps;
    }
    if let Some(u) = ulps.to_integer() {
        if u < 0 {
            maj_err(
                Maj::string("*ulps* cannot be smaller than 0"),
                Maj::nil())
        } else {
            let x = x.to_float().unwrap();
            let y = y.to_float().unwrap();
            if approx_eq!(f64, x, y, ulps = u) {
                Maj::t()
            } else {
                Maj::nil()
            }
        }
    } else {
        maj_err(Maj::string("*ulps* is not an integer"),
                Maj::nil())
    }
}
#+end_src

*** ~(> x y . rest)~

#+begin_src rust
pub fn maj_arithm_greater(
    mut state: &mut MajState,
    x: Gc<Maj>,
    y: Gc<Maj>,
    rest: Gc<Maj>
) -> Gc<Maj> {
    maj_arithm_dispatch(&mut state, Maj::nil(),
                        MajArithmFnType::Greater,
                        x, y, rest, false)
}
#+end_src

*** ~(< x y . rest)~

#+begin_src rust
pub fn maj_arithm_lesser(
    mut state: &mut MajState,
    x: Gc<Maj>,
    y: Gc<Maj>,
    rest: Gc<Maj>
) -> Gc<Maj> {
    maj_arithm_dispatch(&mut state, Maj::nil(),
                        MajArithmFnType::Lesser,
                        x, y, rest, false)
}
#+end_src

*** ~(>= x y . rest)~

#+begin_src rust
pub fn maj_arithm_geq(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>,
    y: Gc<Maj>,
    rest: Gc<Maj>
) -> Gc<Maj> {
    let result = maj_arithm_greater(&mut state,
                                    x.clone(), y.clone(),
                                    rest.clone());
    if maj_errorp(result.clone()).to_bool() {
        result
    } else if result.to_bool() {
        Maj::t()
    } else {
        maj_arithm_eq(&mut state, env, x, y, rest)
    }
}
#+end_src

*** ~(<= x y . rest)~

#+begin_src rust
pub fn maj_arithm_leq(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>,
    y: Gc<Maj>,
    rest: Gc<Maj>
) -> Gc<Maj> {
    let result = maj_arithm_lesser(&mut state,
                                   x.clone(), y.clone(),
                                   rest.clone());
    if maj_errorp(result.clone()).to_bool() {
        result
    } else if result.to_bool() {
        Maj::t()
    } else {
        maj_arithm_eq(&mut state, env, x, y, rest)
    }
}
#+end_src

** Funções aritméticas
*** Funções de ajuda e ferramentas
