05-03-funcoes-primitivas.html

<div id="outline-container-org60804c5" class="outline-3">
<h3 id="org60804c5"><span class="section-number-3">28.3.</span> <code>(float= x y)</code></h3>
<div class="outline-text-3" id="text-28-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_floateq</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_floatp;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">core</span>::<span style="color: #4ec9b0;">f64</span>;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">float_cmp</span>::approx_eq;
    <span style="color: #569cd6;">if</span> !maj_floatp(x.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a float number"</span>),
                       <span style="color: #c586c0;">maj_list!</span>(x));
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> !maj_floatp(y.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a float number"</span>),
                       <span style="color: #c586c0;">maj_list!</span>(y));
    }

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">ulps</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*ulps*"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">ulps</span> = state.lookup(env, ulps);
    <span style="color: #569cd6;">if</span> maj_errorp(ulps.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> ulps;
    }
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Some</span>(u) = ulps.to_integer() {
        <span style="color: #569cd6;">if</span> u &lt; 0 {
            maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"*ulps* cannot be smaller than 0"</span>),
                <span style="color: #4ec9b0;">Maj</span>::nil())
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = x.to_float().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = y.to_float().unwrap();
            <span style="color: #569cd6;">if</span> <span style="color: #c586c0;">approx_eq!</span>(<span style="color: #4ec9b0;">f64</span>, x, y, ulps = u) {
                <span style="color: #4ec9b0;">Maj</span>::t()
            } <span style="color: #569cd6;">else</span> {
                <span style="color: #4ec9b0;">Maj</span>::nil()
            }
        }
    } <span style="color: #569cd6;">else</span> {
        maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"*ulps* is not an integer"</span>),
                <span style="color: #4ec9b0;">Maj</span>::nil())
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org14e3a1c" class="outline-3">
<h3 id="org14e3a1c"><span class="section-number-3">28.4.</span> <code>(&gt; x y . rest)</code></h3>
<div class="outline-text-3" id="text-28-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_greater</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    maj_arithm_dispatch(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(),
                        <span style="color: #4ec9b0;">MajArithmFnType</span>::<span style="color: #4ec9b0;">Greater</span>,
                        x, y, rest, <span style="color: #569cd6;">false</span>)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2124622" class="outline-3">
<h3 id="org2124622"><span class="section-number-3">28.5.</span> <code>(&lt; x y . rest)</code></h3>
<div class="outline-text-3" id="text-28-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_lesser</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    maj_arithm_dispatch(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(),
                        <span style="color: #4ec9b0;">MajArithmFnType</span>::<span style="color: #4ec9b0;">Lesser</span>,
                        x, y, rest, <span style="color: #569cd6;">false</span>)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge793585" class="outline-3">
<h3 id="orge793585"><span class="section-number-3">28.6.</span> <code>(&gt;= x y . rest)</code></h3>
<div class="outline-text-3" id="text-28-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_geq</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> = maj_arithm_greater(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                                    x.clone(), y.clone(),
                                    rest.clone());
    <span style="color: #569cd6;">if</span> maj_errorp(result.clone()).to_bool() {
        result
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> result.to_bool() {
        <span style="color: #4ec9b0;">Maj</span>::t()
    } <span style="color: #569cd6;">else</span> {
        maj_arithm_eq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, x, y, rest)
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge837e09" class="outline-3">
<h3 id="orge837e09"><span class="section-number-3">28.7.</span> <code>(&lt;= x y . rest)</code></h3>
<div class="outline-text-3" id="text-28-7">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_leq</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> = maj_arithm_lesser(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                                   x.clone(), y.clone(),
                                   rest.clone());
    <span style="color: #569cd6;">if</span> maj_errorp(result.clone()).to_bool() {
        result
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> result.to_bool() {
        <span style="color: #4ec9b0;">Maj</span>::t()
    } <span style="color: #569cd6;">else</span> {
        maj_arithm_eq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, x, y, rest)
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb3cb4f9" class="outline-2">
<h2 id="orgb3cb4f9"><span class="section-number-2">29.</span> Funções aritméticas</h2>
<div class="outline-text-2" id="text-29">
</div>
