05-03-funcoes-primitivas.org
**** Ajudante de soma

#+begin_src rust
fn maj_arithm_internal_sum(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>,
    y: Gc<Maj>,
    ntype: MajRawSym
) -> Result<Gc<Maj>, Gc<Maj>> {
    match ntype {
        MajRawSym::Integer => {
            let x = x.to_integer().unwrap();
            let y = y.to_integer().unwrap();
            Ok(Maj::integer(x + y))
        },
        MajRawSym::Float => {
            let x = x.to_float().unwrap();
            let y = y.to_float().unwrap();
            Ok(Maj::float(x + y))
        },
        MajRawSym::Fraction => {
            let (nx, dx) = x.to_fraction().unwrap();
            let (ny, dy) = y.to_fraction().unwrap();
            let dr = dx * dy;
            let nr = (nx * dy) + (ny * dx);
            simplify_frac_coerce(Maj::fraction(nr, dr))
        },
        MajRawSym::Complex => {
            let xr = maj_real_part(x.clone());
            let xi = maj_imag_part(x);
            let yr = maj_real_part(y.clone());
            let yi = maj_imag_part(y);
            let real = maj_arithm_plus(
                &mut state, env.clone(),
                maj_list!(xr, yr));
            let imag = maj_arithm_plus(
                &mut state, env, maj_list!(xi, yi));
            Ok(Maj::complex(real, imag))
        },
        t => panic!("{:?} is not a number subtype", t),
    }
}
#+end_src

***** Ajudante de conjugado

#+begin_src rust
fn maj_conjugate(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>
) -> Gc<Maj> {
    use crate::axioms::predicates::maj_complexp;
    if !maj_complexp(x.clone()).to_bool() {
        x
    } else {
        let realpart = maj_real_part(x.clone());
        let imagpart = maj_imag_part(x);
        let imagpart = maj_arithm_times(
            &mut state, env,
            maj_list!(imagpart, Maj::integer(-1)));
        if maj_errorp(imagpart.clone()).to_bool() {
            imagpart
        } else {
            Maj::complex(realpart, imagpart)
        }
    }
}
#+end_src

**** Ajudante de subtração

#+begin_src rust
fn maj_arithm_internal_subtract(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>,
    y: Gc<Maj>,
    ntype: MajRawSym
) -> Result<Gc<Maj>, Gc<Maj>> {
    match ntype {
        MajRawSym::Integer => {
            let x = x.to_integer().unwrap();
            let y = y.to_integer().unwrap();
            Ok(Maj::integer(x - y))
        },
        MajRawSym::Float => {
            let x = x.to_float().unwrap();
            let y = y.to_float().unwrap();
            Ok(Maj::float(x - y))
        },
        MajRawSym::Fraction => {
            let (nx, dx) = x.to_fraction().unwrap();
            let (ny, dy) = y.to_fraction().unwrap();
            let dr = dx * dy;
            let nr = (nx * dy) - (ny * dx);
            simplify_frac_coerce(Maj::fraction(nr, dr))
        },
        MajRawSym::Complex => {
            let xr = maj_real_part(x.clone());
            let xi = maj_imag_part(x);
            let yr = maj_real_part(y.clone());
            let yi = maj_imag_part(y);
            let real = maj_arithm_minus(
                &mut state, env.clone(),
                maj_list!(xr, yr));
            let imag = maj_arithm_minus(
                &mut state, env, maj_list!(xi, yi));
            Ok(Maj::complex(real, imag))
        },
        t => panic!("{:?} is not a number subtype", t),
    }
}
#+end_src

