05-03-funcoes-primitivas.html
<div id="outline-container-org2efa026" class="outline-3">
<h3 id="org2efa026"><span class="section-number-3">29.1.</span> Funções de ajuda e ferramentas</h3>
<div class="outline-text-3" id="text-29-1">
</div>
<div id="outline-container-org82e3635" class="outline-4">
<h4 id="org82e3635"><span class="section-number-4">29.1.1.</span> Ajudante de soma</h4>
<div class="outline-text-4" id="text-29-1-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_internal_sum</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">ntype</span>: <span style="color: #4ec9b0;">MajRawSym</span>
) -&gt; <span style="color: #4ec9b0;">Result</span>&lt;<span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;&gt; {
    <span style="color: #569cd6;">match</span> ntype {
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span> =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = x.to_integer().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = y.to_integer().unwrap();
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #4ec9b0;">Maj</span>::integer(x + y))
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span> =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = x.to_float().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = y.to_float().unwrap();
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #4ec9b0;">Maj</span>::float(x + y))
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span> =&gt; {
            <span style="color: #569cd6;">let</span> (nx, dx) = x.to_fraction().unwrap();
            <span style="color: #569cd6;">let</span> (ny, dy) = y.to_fraction().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">dr</span> = dx * dy;
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">nr</span> = (nx * dy) + (ny * dx);
            simplify_frac_coerce(<span style="color: #4ec9b0;">Maj</span>::fraction(nr, dr))
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span> =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">xr</span> = maj_real_part(x.clone());
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">xi</span> = maj_imag_part(x);
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">yr</span> = maj_real_part(y.clone());
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">yi</span> = maj_imag_part(y);
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">real</span> = maj_arithm_plus(
                <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                <span style="color: #c586c0;">maj_list!</span>(xr, yr));
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">imag</span> = maj_arithm_plus(
                <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, <span style="color: #c586c0;">maj_list!</span>(xi, yi));
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #4ec9b0;">Maj</span>::complex(real, imag))
        },
        t =&gt; <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"{:?} is not a number subtype"</span>, t),
    }
}
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgdfd88ee"></a>Ajudante de conjugado<br />
<div class="outline-text-5" id="text-29-1-1-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_conjugate</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_complexp;
    <span style="color: #569cd6;">if</span> !maj_complexp(x.clone()).to_bool() {
        x
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">realpart</span> = maj_real_part(x.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">imagpart</span> = maj_imag_part(x);
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">imagpart</span> = maj_arithm_times(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env,
            <span style="color: #c586c0;">maj_list!</span>(imagpart, <span style="color: #4ec9b0;">Maj</span>::integer(-1)));
        <span style="color: #569cd6;">if</span> maj_errorp(imagpart.clone()).to_bool() {
            imagpart
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #4ec9b0;">Maj</span>::complex(realpart, imagpart)
        }
    }
}
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org189ca58" class="outline-4">
<h4 id="org189ca58"><span class="section-number-4">29.1.2.</span> Ajudante de subtração</h4>
<div class="outline-text-4" id="text-29-1-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_internal_subtract</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">ntype</span>: <span style="color: #4ec9b0;">MajRawSym</span>
) -&gt; <span style="color: #4ec9b0;">Result</span>&lt;<span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;&gt; {
    <span style="color: #569cd6;">match</span> ntype {
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span> =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = x.to_integer().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = y.to_integer().unwrap();
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #4ec9b0;">Maj</span>::integer(x - y))
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span> =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = x.to_float().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = y.to_float().unwrap();
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #4ec9b0;">Maj</span>::float(x - y))
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span> =&gt; {
            <span style="color: #569cd6;">let</span> (nx, dx) = x.to_fraction().unwrap();
            <span style="color: #569cd6;">let</span> (ny, dy) = y.to_fraction().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">dr</span> = dx * dy;
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">nr</span> = (nx * dy) - (ny * dx);
            simplify_frac_coerce(<span style="color: #4ec9b0;">Maj</span>::fraction(nr, dr))
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span> =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">xr</span> = maj_real_part(x.clone());
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">xi</span> = maj_imag_part(x);
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">yr</span> = maj_real_part(y.clone());
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">yi</span> = maj_imag_part(y);
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">real</span> = maj_arithm_minus(
                <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                <span style="color: #c586c0;">maj_list!</span>(xr, yr));
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">imag</span> = maj_arithm_minus(
                <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, <span style="color: #c586c0;">maj_list!</span>(xi, yi));
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #4ec9b0;">Maj</span>::complex(real, imag))
        },
        t =&gt; <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"{:?} is not a number subtype"</span>, t),
    }
}
</pre>
</div>
</div>

<ol class="org-ol">
