05-03-funcoes-primitivas.org
***** Ajudante de negação

#+begin_src rust
fn maj_negate(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>
) -> Gc<Maj> {
    maj_arithm_times(
        &mut state, env,
        maj_list!(x, Maj::integer(-1)))
}
#+end_src

**** Ajudante de multiplicação

#+begin_src rust
fn maj_arithm_internal_multiply(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>,
    y: Gc<Maj>,
    ntype: MajRawSym
) -> Result<Gc<Maj>, Gc<Maj>> {
    match ntype {
        MajRawSym::Integer => {
            let x = x.to_integer().unwrap();
            let y = y.to_integer().unwrap();
            Ok(Maj::integer(x * y))
        },
        MajRawSym::Float => {
            let x = x.to_float().unwrap();
            let y = y.to_float().unwrap();
            Ok(Maj::float(x * y))
        },
        MajRawSym::Fraction => {
            let (nx, dx) = x.to_fraction().unwrap();
            let (ny, dy) = y.to_fraction().unwrap();
            let nr = nx * ny;
            let dr = dx * dy;
            simplify_frac_coerce(Maj::fraction(nr, dr))
        },
        MajRawSym::Complex => {
            Ok(maj_arithm_internal_complex_mult(
                &mut state, env, x, y))
        },
        t => panic!("{:?} is not a number subtype", t),
    }
}
#+end_src

#+begin_src rust
fn maj_arithm_internal_complex_mult(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>,
    y: Gc<Maj>
) -> Gc<Maj> {
    let xr = maj_real_part(x.clone());
    let xi = maj_imag_part(x);
    let yr = maj_real_part(y.clone());
    let yi = maj_imag_part(y);

    let firsts = maj_arithm_times(
        &mut state, env.clone(),
        maj_list!(xr.clone(), yr.clone()));
    let outers = Maj::complex(
        Maj::integer(0),
        maj_arithm_times(
            &mut state, env.clone(),
            maj_list!(xr.clone(), yi.clone())));
    let inners = Maj::complex(
        Maj::integer(0),
        maj_arithm_times(
            &mut state, env.clone(),
            maj_list!(xi.clone(), yr.clone())));
    let lasts = maj_arithm_times(
        &mut state, env.clone(),
        maj_list!(xi, yi));
    let lasts = maj_negate(&mut state, env.clone(), lasts);

    maj_arithm_plus(
        &mut state, env,
        maj_list!(firsts, outers, inners, lasts))
}
#+end_src

***** Ajudante de dedução de sinal

#+begin_src rust
fn maj_signum(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>
) -> Gc<Maj> {
    if maj_zerop(&mut state, env, x.clone()).to_bool() {
        x
    } else if maj_arithm_lesser(
        &mut state,
        x.clone(),
        Maj::integer(0),
        Maj::nil()).to_bool() {
        Maj::integer(-1)
    } else {
        Maj::integer(1)
    }
}
#+end_src

