05-03-funcoes-primitivas.html
<li><a id="orge4931c4"></a>Ajudante de negação<br />
<div class="outline-text-5" id="text-29-1-2-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_negate</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    maj_arithm_times(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env,
        <span style="color: #c586c0;">maj_list!</span>(x, <span style="color: #4ec9b0;">Maj</span>::integer(-1)))
}
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgafa0365" class="outline-4">
<h4 id="orgafa0365"><span class="section-number-4">29.1.3.</span> Ajudante de multiplicação</h4>
<div class="outline-text-4" id="text-29-1-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_internal_multiply</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">ntype</span>: <span style="color: #4ec9b0;">MajRawSym</span>
) -&gt; <span style="color: #4ec9b0;">Result</span>&lt;<span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;&gt; {
    <span style="color: #569cd6;">match</span> ntype {
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span> =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = x.to_integer().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = y.to_integer().unwrap();
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #4ec9b0;">Maj</span>::integer(x * y))
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span> =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = x.to_float().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = y.to_float().unwrap();
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #4ec9b0;">Maj</span>::float(x * y))
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span> =&gt; {
            <span style="color: #569cd6;">let</span> (nx, dx) = x.to_fraction().unwrap();
            <span style="color: #569cd6;">let</span> (ny, dy) = y.to_fraction().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">nr</span> = nx * ny;
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">dr</span> = dx * dy;
            simplify_frac_coerce(<span style="color: #4ec9b0;">Maj</span>::fraction(nr, dr))
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span> =&gt; {
            <span style="color: #4ec9b0;">Ok</span>(maj_arithm_internal_complex_mult(
                <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, x, y))
        },
        t =&gt; <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"{:?} is not a number subtype"</span>, t),
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_internal_complex_mult</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">xr</span> = maj_real_part(x.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">xi</span> = maj_imag_part(x);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">yr</span> = maj_real_part(y.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">yi</span> = maj_imag_part(y);

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">firsts</span> = maj_arithm_times(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
        <span style="color: #c586c0;">maj_list!</span>(xr.clone(), yr.clone()));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">outers</span> = <span style="color: #4ec9b0;">Maj</span>::complex(
        <span style="color: #4ec9b0;">Maj</span>::integer(0),
        maj_arithm_times(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
            <span style="color: #c586c0;">maj_list!</span>(xr.clone(), yi.clone())));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">inners</span> = <span style="color: #4ec9b0;">Maj</span>::complex(
        <span style="color: #4ec9b0;">Maj</span>::integer(0),
        maj_arithm_times(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
            <span style="color: #c586c0;">maj_list!</span>(xi.clone(), yr.clone())));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">lasts</span> = maj_arithm_times(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
        <span style="color: #c586c0;">maj_list!</span>(xi, yi));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">lasts</span> = maj_negate(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(), lasts);

    maj_arithm_plus(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env,
        <span style="color: #c586c0;">maj_list!</span>(firsts, outers, inners, lasts))
}
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org00c7411"></a>Ajudante de dedução de sinal<br />
<div class="outline-text-5" id="text-29-1-3-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_signum</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> maj_zerop(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, x.clone()).to_bool() {
        x
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_arithm_lesser(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
        x.clone(),
        <span style="color: #4ec9b0;">Maj</span>::integer(0),
        <span style="color: #4ec9b0;">Maj</span>::nil()).to_bool() {
        <span style="color: #4ec9b0;">Maj</span>::integer(-1)
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #4ec9b0;">Maj</span>::integer(1)
    }
}
</pre>
</div>
</div>
</li>
</ol>
</div>
