05-03-funcoes-primitivas.org
**** Ajudante de divisão

#+begin_src rust
fn maj_arithm_internal_divide(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>,
    y: Gc<Maj>,
    ntype: MajRawSym
) -> Result<Gc<Maj>, Gc<Maj>> {
    match ntype {
        MajRawSym::Integer => {
            let x = x.to_integer().unwrap();
            let y = y.to_integer().unwrap();
            if y == 0 {
                Err(maj_err(Maj::string("Division by zero"),
                            Maj::nil()))
            } else {
                Ok(if x % y == 0 {
                    Maj::integer(x / y)
                } else {
                    simplify_frac_coerce(Maj::fraction(x, y)).unwrap()
                })
            }
        },
        MajRawSym::Float => {
            if maj_zerop(&mut state, env, y.clone()).to_bool() {
                Err(maj_err(Maj::string("Division by zero"),
                            Maj::nil()))
            } else {
                let x = x.to_float().unwrap();
                let y = y.to_float().unwrap();
                Ok(Maj::float(x / y))
            }
        },
        MajRawSym::Fraction => {
            let (nx, dx) = x.to_fraction().unwrap();
            let (ny, dy) = y.to_fraction().unwrap();
            let nr = nx * dy;
            let dr = dx * ny;
            // Division by zero verified by this function
            simplify_frac_coerce(Maj::fraction(nr, dr))
        },
        MajRawSym::Complex => {
            return maj_arithm_internal_complex_div(
                &mut state, env, x, y);
        },
        t => panic!("{:?} is not a number subtype", t),
    }
}
#+end_src

#+begin_src rust
fn maj_arithm_internal_complex_div(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>,
    y: Gc<Maj>
) -> Result<Gc<Maj>, Gc<Maj>> {
    let yconj = maj_arithm_plus(
        &mut state, env.clone(),
        maj_list!(y.clone()));

    let dividend = maj_arithm_times(
        &mut state, env.clone(),
        maj_list!(x, yconj.clone()));
    let divisor = maj_arithm_times(
        &mut state, env.clone(),
        maj_list!(y, yconj.clone()));

    let divisor = maj_real_part(divisor);
    if maj_zerop(&mut state,
                 env.clone(),
                 divisor.clone()
    ).to_bool() {
        return Err(maj_err(Maj::string("Division by zero"),
                           Maj::nil()));
    }

    let dividend_r = maj_real_part(dividend.clone());
    let dividend_i = maj_imag_part(dividend);

    let realpart = maj_arithm_divide(
        &mut state, env.clone(),
        maj_list!(dividend_r, divisor.clone()));
    let imagpart = maj_arithm_divide(
        &mut state, env.clone(),
        maj_list!(dividend_i, divisor.clone()));
    Ok(Maj::complex(realpart, imagpart))
}
#+end_src

***** Ajudante de recíproco

#+begin_src rust
fn maj_reciprocal(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>
) -> Gc<Maj> {
    if maj_zerop(&mut state, env.clone(), x.clone()).to_bool() {
        maj_err(Maj::string("Division by zero"),
                Maj::nil())
    } else {
        maj_arithm_divide(
            &mut state, env,
            maj_list!(Maj::fraction(1, 1), x.clone()))
    }
}
#+end_src

