05-03-funcoes-primitivas.html

<div id="outline-container-org229d514" class="outline-4">
<h4 id="org229d514"><span class="section-number-4">29.1.4.</span> Ajudante de divisão</h4>
<div class="outline-text-4" id="text-29-1-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_internal_divide</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">ntype</span>: <span style="color: #4ec9b0;">MajRawSym</span>
) -&gt; <span style="color: #4ec9b0;">Result</span>&lt;<span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;&gt; {
    <span style="color: #569cd6;">match</span> ntype {
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Integer</span> =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = x.to_integer().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = y.to_integer().unwrap();
            <span style="color: #569cd6;">if</span> y == 0 {
                <span style="color: #4ec9b0;">Err</span>(maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Division by zero"</span>),
                            <span style="color: #4ec9b0;">Maj</span>::nil()))
            } <span style="color: #569cd6;">else</span> {
                <span style="color: #4ec9b0;">Ok</span>(<span style="color: #569cd6;">if</span> x % y == 0 {
                    <span style="color: #4ec9b0;">Maj</span>::integer(x / y)
                } <span style="color: #569cd6;">else</span> {
                    simplify_frac_coerce(<span style="color: #4ec9b0;">Maj</span>::fraction(x, y)).unwrap()
                })
            }
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Float</span> =&gt; {
            <span style="color: #569cd6;">if</span> maj_zerop(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, y.clone()).to_bool() {
                <span style="color: #4ec9b0;">Err</span>(maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Division by zero"</span>),
                            <span style="color: #4ec9b0;">Maj</span>::nil()))
            } <span style="color: #569cd6;">else</span> {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = x.to_float().unwrap();
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = y.to_float().unwrap();
                <span style="color: #4ec9b0;">Ok</span>(<span style="color: #4ec9b0;">Maj</span>::float(x / y))
            }
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fraction</span> =&gt; {
            <span style="color: #569cd6;">let</span> (nx, dx) = x.to_fraction().unwrap();
            <span style="color: #569cd6;">let</span> (ny, dy) = y.to_fraction().unwrap();
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">nr</span> = nx * dy;
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">dr</span> = dx * ny;
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Division by zero verified by this function</span>
            simplify_frac_coerce(<span style="color: #4ec9b0;">Maj</span>::fraction(nr, dr))
        },
        <span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Complex</span> =&gt; {
            <span style="color: #569cd6;">return</span> maj_arithm_internal_complex_div(
                <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, x, y);
        },
        t =&gt; <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"{:?} is not a number subtype"</span>, t),
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_internal_complex_div</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Result</span>&lt;<span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">yconj</span> = maj_arithm_plus(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
        <span style="color: #c586c0;">maj_list!</span>(y.clone()));

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">dividend</span> = maj_arithm_times(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
        <span style="color: #c586c0;">maj_list!</span>(x, yconj.clone()));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">divisor</span> = maj_arithm_times(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
        <span style="color: #c586c0;">maj_list!</span>(y, yconj.clone()));

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">divisor</span> = maj_real_part(divisor);
    <span style="color: #569cd6;">if</span> maj_zerop(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                 env.clone(),
                 divisor.clone()
    ).to_bool() {
        <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Err</span>(maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Division by zero"</span>),
                           <span style="color: #4ec9b0;">Maj</span>::nil()));
    }

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">dividend_r</span> = maj_real_part(dividend.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">dividend_i</span> = maj_imag_part(dividend);

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">realpart</span> = maj_arithm_divide(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
        <span style="color: #c586c0;">maj_list!</span>(dividend_r, divisor.clone()));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">imagpart</span> = maj_arithm_divide(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
        <span style="color: #c586c0;">maj_list!</span>(dividend_i, divisor.clone()));
    <span style="color: #4ec9b0;">Ok</span>(<span style="color: #4ec9b0;">Maj</span>::complex(realpart, imagpart))
}
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org9f09798"></a>Ajudante de recíproco<br />
<div class="outline-text-5" id="text-29-1-4-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_reciprocal</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> maj_zerop(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(), x.clone()).to_bool() {
        maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Division by zero"</span>),
                <span style="color: #4ec9b0;">Maj</span>::nil())
    } <span style="color: #569cd6;">else</span> {
        maj_arithm_divide(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env,
            <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::fraction(1, 1), x.clone()))
    }
}
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
