05-03-funcoes-primitivas.html

<div id="outline-container-orgc2bb12a" class="outline-3">
<h3 id="orgc2bb12a"><span class="section-number-3">29.2.</span> <code>(+ . rest)</code></h3>
<div class="outline-text-3" id="text-29-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_plus</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = maj_length(rest.clone());
    <span style="color: #569cd6;">if</span> maj_errorp(len.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> len;
    }
    <span style="color: #569cd6;">match</span> len.to_integer().unwrap() {
        0 =&gt; <span style="color: #4ec9b0;">Maj</span>::integer(1),
        1 =&gt; {
            <span style="color: #c586c0;">maj_destructure_args!</span>(rest, x);
            <span style="color: #569cd6;">if</span> !maj_numberp(x.clone()).to_bool() {
                maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(x))
            } <span style="color: #569cd6;">else</span> {
                maj_conjugate(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, x)
            }
        },
        _ =&gt; {
            <span style="color: #c586c0;">maj_destructure_args!</span>(rest, x, r1, y, rest);
            <span style="color: #569cd6;">if</span> !maj_numberp(x.clone()).to_bool() {
                maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(x))
            } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> !maj_numberp(y.clone()).to_bool() {
                maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(y))
            } <span style="color: #569cd6;">else</span> {
                maj_arithm_dispatch(
                    <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(),
                    <span style="color: #4ec9b0;">MajArithmFnType</span>::<span style="color: #4ec9b0;">Plus</span>,
                    x, y, rest, <span style="color: #569cd6;">true</span>)
            }
        },
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbad963c" class="outline-3">
<h3 id="orgbad963c"><span class="section-number-3">29.3.</span> <code>(- . rest)</code></h3>
<div class="outline-text-3" id="text-29-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_minus</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = maj_length(rest.clone());
    <span style="color: #569cd6;">if</span> maj_errorp(len.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> len;
    }
    <span style="color: #569cd6;">match</span> len.to_integer().unwrap() {
        0 =&gt; <span style="color: #4ec9b0;">Maj</span>::integer(0),
        1 =&gt; {
            <span style="color: #c586c0;">maj_destructure_args!</span>(rest, x);
            <span style="color: #569cd6;">if</span> !maj_numberp(x.clone()).to_bool() {
                maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(x))
            } <span style="color: #569cd6;">else</span> {
                maj_negate(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, x)
            }
        },
        _ =&gt; {
            <span style="color: #c586c0;">maj_destructure_args!</span>(rest, x, r1, y, rest);
            <span style="color: #569cd6;">if</span> !maj_numberp(x.clone()).to_bool() {
                maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(x))
            } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> !maj_numberp(y.clone()).to_bool() {
                maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(y))
            } <span style="color: #569cd6;">else</span> {
                maj_arithm_dispatch(
                    <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(),
                    <span style="color: #4ec9b0;">MajArithmFnType</span>::<span style="color: #4ec9b0;">Minus</span>,
                    x, y, rest, <span style="color: #569cd6;">true</span>)
            }
        },
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf807765" class="outline-3">
<h3 id="orgf807765"><span class="section-number-3">29.4.</span> <code>(* . rest)</code></h3>
<div class="outline-text-3" id="text-29-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_times</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = maj_length(rest.clone());
    <span style="color: #569cd6;">if</span> maj_errorp(len.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> len;
    }
    <span style="color: #569cd6;">match</span> len.to_integer().unwrap() {
        0 =&gt; <span style="color: #4ec9b0;">Maj</span>::integer(1),
        1 =&gt; {
            <span style="color: #c586c0;">maj_destructure_args!</span>(rest, x);
            <span style="color: #569cd6;">if</span> !maj_numberp(x.clone()).to_bool() {
                maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(x))
            } <span style="color: #569cd6;">else</span> {
                maj_signum(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, x)
            }
        },
        _ =&gt; {
            <span style="color: #c586c0;">maj_destructure_args!</span>(rest, x, r1, y, rest);
            <span style="color: #569cd6;">if</span> !maj_numberp(x.clone()).to_bool() {
                maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(x))
            } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> !maj_numberp(y.clone()).to_bool() {
                maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(y))
            } <span style="color: #569cd6;">else</span> {
                maj_arithm_dispatch(
                    <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(),
                    <span style="color: #4ec9b0;">MajArithmFnType</span>::<span style="color: #4ec9b0;">Multiply</span>,
                    x, y, rest, <span style="color: #569cd6;">true</span>)
            }
        },
    }
}
</pre>
</div>
</div>
</div>
