05-03-funcoes-primitivas.org
*** ~(/ . rest)~

#+begin_src rust
pub fn maj_arithm_divide(
    mut state: &mut MajState,
    env: Gc<Maj>,
    rest: Gc<Maj>
) -> Gc<Maj> {
    let len = maj_length(rest.clone());
    if maj_errorp(len.clone()).to_bool() {
        return len;
    }
    match len.to_integer().unwrap() {
        0 => Maj::integer(1),
        1 => {
            maj_destructure_args!(rest, x);
            if !maj_numberp(x.clone()).to_bool() {
                maj_err(Maj::string("{} is not a number"),
                        maj_list!(x))
            } else {
                maj_reciprocal(&mut state, env, x)
            }
        },
        _ => {
            maj_destructure_args!(rest, x, r1, y, rest);
            if !maj_numberp(x.clone()).to_bool() {
                maj_err(Maj::string("{} is not a number"),
                        maj_list!(x))
            } else if !maj_numberp(y.clone()).to_bool() {
                maj_err(Maj::string("{} is not a number"),
                        maj_list!(y))
            } else {
                maj_arithm_dispatch(
                    &mut state, Maj::nil(),
                    MajArithmFnType::Divide,
                    x, y, rest, true)
            }
        },
    }
}
#+end_src

** Funções de streams
*** Funções auxiliares

#+begin_src rust
use crate::core::types::{
    MajStreamType,
    MajStreamDirection
};
#+end_src

**** Desempacotamento de um File

#+begin_src rust
fn get_raw_stream(
    mut state: &mut MajState,
    stream: Gc<Maj>,
    expected_dir: MajStreamDirection
) -> Result<&std::fs::File, Gc<Maj>> {
    use std::io::Seek;
    if let Maj::Stream(mstream) = &*stream.clone() {
        if mstream.is_internal() {
            panic!("Never try to use *stdin* or *stdout* as ordinary streams!");
        }

        if maj_nilp(state.stat_stream(mstream.handle)).to_bool() {
            Err(maj_err(
                Maj::string("The stream {} is closed"),
                maj_list!(stream)))
        }
        else if mstream.direction == expected_dir {
            let eof_sym = Maj::symbol(&mut state, "eof");
            let file = state.borrow_stream(mstream.handle);
            let mut file = file.unwrap();
            if expected_dir == MajStreamDirection::In {
                // Check if eof.
                // If fails, position is unspecified and should
                // error out anyway. So we use unwrap.
                let length = file.stream_len().unwrap();
                let pos    = file.stream_position().unwrap();
                if pos >= length {
                    return Err(eof_sym)
                }
            }
            Ok(file)
        }
        else {
            Err(maj_err(
                Maj::string("{} is not an {} stream"),
                maj_list!(
                    stream,
                Maj::string(
                    if expected_dir ==
                        MajStreamDirection::In {
                            "input"
                        } else {
                            "output"
                        }))))
        }
    } else {
        Err(maj_err(
            Maj::string("{} is not a stream"),
            maj_list!(stream)))
    }
}
#+end_src

