05-03-funcoes-primitivas.html

<div id="outline-container-org454baf2" class="outline-3">
<h3 id="org454baf2"><span class="section-number-3">29.5.</span> <code>(/ . rest)</code></h3>
<div class="outline-text-3" id="text-29-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_arithm_divide</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = maj_length(rest.clone());
    <span style="color: #569cd6;">if</span> maj_errorp(len.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> len;
    }
    <span style="color: #569cd6;">match</span> len.to_integer().unwrap() {
        0 =&gt; <span style="color: #4ec9b0;">Maj</span>::integer(1),
        1 =&gt; {
            <span style="color: #c586c0;">maj_destructure_args!</span>(rest, x);
            <span style="color: #569cd6;">if</span> !maj_numberp(x.clone()).to_bool() {
                maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(x))
            } <span style="color: #569cd6;">else</span> {
                maj_reciprocal(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, x)
            }
        },
        _ =&gt; {
            <span style="color: #c586c0;">maj_destructure_args!</span>(rest, x, r1, y, rest);
            <span style="color: #569cd6;">if</span> !maj_numberp(x.clone()).to_bool() {
                maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(x))
            } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> !maj_numberp(y.clone()).to_bool() {
                maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(y))
            } <span style="color: #569cd6;">else</span> {
                maj_arithm_dispatch(
                    <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(),
                    <span style="color: #4ec9b0;">MajArithmFnType</span>::<span style="color: #4ec9b0;">Divide</span>,
                    x, y, rest, <span style="color: #569cd6;">true</span>)
            }
        },
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org847d885" class="outline-2">
<h2 id="org847d885"><span class="section-number-2">30.</span> Funções de streams</h2>
<div class="outline-text-2" id="text-30">
</div>
<div id="outline-container-orgece963d" class="outline-3">
<h3 id="orgece963d"><span class="section-number-3">30.1.</span> Funções auxiliares</h3>
<div class="outline-text-3" id="text-30-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::{
    <span style="color: #4ec9b0;">MajStreamType</span>,
    <span style="color: #4ec9b0;">MajStreamDirection</span>
};
</pre>
</div>
</div>

<div id="outline-container-org6e22c52" class="outline-4">
<h4 id="org6e22c52"><span class="section-number-4">30.1.1.</span> Desempacotamento de um File</h4>
<div class="outline-text-4" id="text-30-1-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">get_raw_stream</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">stream</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">expected_dir</span>: <span style="color: #4ec9b0;">MajStreamDirection</span>
) -&gt; <span style="color: #4ec9b0;">Result</span>&lt;<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">std</span>::<span style="color: #569cd6;">fs</span>::<span style="color: #4ec9b0;">File</span>, <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::<span style="color: #569cd6;">io</span>::<span style="color: #4ec9b0;">Seek</span>;
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Stream</span>(mstream) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*stream.clone() {
        <span style="color: #569cd6;">if</span> mstream.is_internal() {
            <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Never try to use *stdin* or *stdout* as ordinary streams!"</span>);
        }

        <span style="color: #569cd6;">if</span> maj_nilp(state.stat_stream(mstream.handle)).to_bool() {
            <span style="color: #4ec9b0;">Err</span>(maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"The stream {} is closed"</span>),
                <span style="color: #c586c0;">maj_list!</span>(stream)))
        }
        <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> mstream.direction == expected_dir {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">eof_sym</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"eof"</span>);
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">file</span> = state.borrow_stream(mstream.handle);
            <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">file</span> = file.unwrap();
            <span style="color: #569cd6;">if</span> expected_dir == <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">In</span> {
                <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Check if eof.</span>
                <span style="color: #6a9955;">// </span><span style="color: #6a9955;">If fails, position is unspecified and should</span>
                <span style="color: #6a9955;">// </span><span style="color: #6a9955;">error out anyway. So we use unwrap.</span>
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">length</span> = file.stream_len().unwrap();
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">pos</span>    = file.stream_position().unwrap();
                <span style="color: #569cd6;">if</span> pos &gt;= length {
                    <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Err</span>(eof_sym)
                }
            }
            <span style="color: #4ec9b0;">Ok</span>(file)
        }
        <span style="color: #569cd6;">else</span> {
            <span style="color: #4ec9b0;">Err</span>(maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not an {} stream"</span>),
                <span style="color: #c586c0;">maj_list!</span>(
                    stream,
                <span style="color: #4ec9b0;">Maj</span>::string(
                    <span style="color: #569cd6;">if</span> expected_dir ==
                        <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">In</span> {
                            <span style="color: #ce9178;">"input"</span>
                        } <span style="color: #569cd6;">else</span> {
                            <span style="color: #ce9178;">"output"</span>
                        }))))
        }
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #4ec9b0;">Err</span>(maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a stream"</span>),
            <span style="color: #c586c0;">maj_list!</span>(stream)))
    }
}
</pre>
</div>
</div>
</div>
