05-03-funcoes-primitivas.org
**** Testes de stream padrão

#+begin_src rust
fn stdstreamp(x: Gc<Maj>) -> bool {
    if let Maj::Stream(mstream) = &*x.clone() {
        mstream.is_internal()
    } else {
        false
    }
}
#+end_src

#+begin_src rust
fn stdstreamdirp(x: Gc<Maj>, dir: MajStreamDirection) -> bool {
    if let Maj::Stream(mstream) = &*x.clone() {
        if !mstream.is_internal() {
            panic!("Not a standard stream being tested");
        }
        dir == mstream.direction
    } else {
        false
    }    
}
#+end_src

#+begin_src rust
fn stdstreamtype(x: Gc<Maj>) -> MajStreamType {
    if let Maj::Stream(mstream) = &*x.clone() {
        if !mstream.is_internal() {
            panic!("Not a standard stream being tested");
        }
        mstream.stype.clone()
    } else {
        panic!("Not a standard stream being tested");
    }
}
#+end_src

*** ~(open-stream dir path)~

#+begin_src rust
pub fn maj_open_stream(
    mut state: &mut MajState,
    dir: Gc<Maj>,
    path: Gc<Maj>
) -> Gc<Maj> {
    let path_opt = path.stringify();
    if path_opt.is_none() {
        return maj_err(
            Maj::string("{} is not a string"),
            maj_list!(path));
    }

    let direction =
        if maj_eq(Maj::symbol(&mut state, "in"),
                  dir.clone()).to_bool() {
            MajStreamDirection::In
        } else if maj_eq(Maj::symbol(&mut state, "out"),
                         dir.clone()).to_bool() {
            MajStreamDirection::Out
        } else {
            return maj_err(
                Maj::string("{} should be one of symbols 'in or 'out"),
                maj_list!(dir));
        };

    let stream =
        state.make_stream(&path_opt.unwrap(), direction);

    match stream {
        Some(obj) => obj,
        None => maj_err(
            Maj::string("Cannot open stream to path {}"),
            maj_list!(path)),
    }
}
#+end_src

*** ~(close-stream x)~

#+begin_src rust
pub fn maj_close_stream(
    state: &mut MajState,
    x: Gc<Maj>
) -> Gc<Maj> {
    state.close_stream(x)
}
#+end_src

*** ~(stat x)~

#+begin_src rust
pub fn maj_stat(mut state: &mut MajState, x: Gc<Maj>) -> Gc<Maj> {
    if let Maj::Stream(mstream) = &*x.clone() {
        let index  = mstream.handle;
        let result = state.stat_stream(index);

        if maj_errorp(result.clone()).to_bool() {
            result
        } else if maj_nilp(result.clone()).to_bool() {
            Maj::symbol(&mut state, "closed")
        } else {
            Maj::symbol(&mut state, "open")
        }
    } else {
        maj_err(
            Maj::string("Not a stream: {}"),
            maj_list!(x))
    }
}
#+end_src

