05-03-funcoes-primitivas.html

<div id="outline-container-org882ec1a" class="outline-4">
<h4 id="org882ec1a"><span class="section-number-4">30.1.2.</span> Testes de stream padrão</h4>
<div class="outline-text-4" id="text-30-1-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">stdstreamp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">bool</span> {
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Stream</span>(mstream) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x.clone() {
        mstream.is_internal()
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #569cd6;">false</span>
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">stdstreamdirp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">dir</span>: <span style="color: #4ec9b0;">MajStreamDirection</span>) -&gt; <span style="color: #4ec9b0;">bool</span> {
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Stream</span>(mstream) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x.clone() {
        <span style="color: #569cd6;">if</span> !mstream.is_internal() {
            <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Not a standard stream being tested"</span>);
        }
        dir == mstream.direction
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #569cd6;">false</span>
    }    
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">stdstreamtype</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">MajStreamType</span> {
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Stream</span>(mstream) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x.clone() {
        <span style="color: #569cd6;">if</span> !mstream.is_internal() {
            <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Not a standard stream being tested"</span>);
        }
        mstream.stype.clone()
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Not a standard stream being tested"</span>);
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1403921" class="outline-3">
<h3 id="org1403921"><span class="section-number-3">30.2.</span> <code>(open-stream dir path)</code></h3>
<div class="outline-text-3" id="text-30-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_open_stream</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">dir</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">path</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">path_opt</span> = path.stringify();
    <span style="color: #569cd6;">if</span> path_opt.is_none() {
        <span style="color: #569cd6;">return</span> maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a string"</span>),
            <span style="color: #c586c0;">maj_list!</span>(path));
    }

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">direction</span> =
        <span style="color: #569cd6;">if</span> maj_eq(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"in"</span>),
                  dir.clone()).to_bool() {
            <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">In</span>
        } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_eq(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"out"</span>),
                         dir.clone()).to_bool() {
            <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">Out</span>
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #569cd6;">return</span> maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} should be one of symbols 'in or 'out"</span>),
                <span style="color: #c586c0;">maj_list!</span>(dir));
        };

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stream</span> =
        state.make_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>path_opt.unwrap(), direction);

    <span style="color: #569cd6;">match</span> stream {
        <span style="color: #4ec9b0;">Some</span>(obj) =&gt; obj,
        <span style="color: #4ec9b0;">None</span> =&gt; maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Cannot open stream to path {}"</span>),
            <span style="color: #c586c0;">maj_list!</span>(path)),
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge4b63fe" class="outline-3">
<h3 id="orge4b63fe"><span class="section-number-3">30.3.</span> <code>(close-stream x)</code></h3>
<div class="outline-text-3" id="text-30-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_close_stream</span>(
    <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    state.close_stream(x)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge3ad0b5" class="outline-3">
<h3 id="orge3ad0b5"><span class="section-number-3">30.4.</span> <code>(stat x)</code></h3>
<div class="outline-text-3" id="text-30-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_stat</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>, <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Stream</span>(mstream) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x.clone() {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">index</span>  = mstream.handle;
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> = state.stat_stream(index);

        <span style="color: #569cd6;">if</span> maj_errorp(result.clone()).to_bool() {
            result
        } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_nilp(result.clone()).to_bool() {
            <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"closed"</span>)
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"open"</span>)
        }
    } <span style="color: #569cd6;">else</span> {
        maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Not a stream: {}"</span>),
            <span style="color: #c586c0;">maj_list!</span>(x))
    }
}
</pre>
</div>
</div>
</div>
