05-03-funcoes-primitivas.org
*** ~(read-char stream)~

#+begin_src rust
pub fn maj_read_char(mut state: &mut MajState,
                     stream: Gc<Maj>
) -> Gc<Maj> {
    use std::io::Read;
    let mut buffer = [0; 1];
    if stdstreamp(stream.clone()) {
        if stdstreamdirp(stream.clone(), MajStreamDirection::In) {
            let peekopt = state.pop_stdin_peeked();
            match peekopt {
                Some(c) => {
                    return Maj::character(c);
                },
                None => {
                    use std::io;
                    match io::stdin().read(&mut buffer) {
                        Ok(_) => {
                            return Maj::character(buffer[0] as char);
                        },
                        Err(_) => {
                            return maj_err(
                                Maj::string(
                                    "Could not read from stream *stdin*"),
                                Maj::nil());
                        }
                    }
                },
            }
        } else {
            return maj_err(
                Maj::string("{} is not an input stream"),
                maj_list!(stream));
        }
    }

    match get_raw_stream(&mut state,
                         stream.clone(),
                         MajStreamDirection::In) {
        Ok(mut file) => {
            match file.read(&mut buffer) {
                Ok(_) => {
                    Maj::character(buffer[0] as char)
                },
                Err(_) => {
                    maj_err(
                        Maj::string(
                            "Could not read from stream {}"),
                        maj_list!(stream))
                }
            }
        },
        Err(expr) => expr,
    }
}
#+end_src

*** ~(peek-char stream)~

#+begin_src rust
pub fn maj_peek_char(mut state: &mut MajState,
                     stream: Gc<Maj>
) -> Gc<Maj> {
    use std::io::{ Read, Seek, SeekFrom };
    let mut buffer = [0; 1];
    if stdstreamp(stream.clone()) {
        if stdstreamdirp(stream.clone(), MajStreamDirection::In) {
            let peekopt = state.pop_stdin_peeked();
            match peekopt {
                Some(c) => {
                    state.push_stdin_peeked(c);
                    return Maj::character(c);
                },
                None => {
                    use std::io;
                    match io::stdin().read(&mut buffer) {
                        Ok(_) => {
                            state.push_stdin_peeked(buffer[0] as char);
                            return Maj::character(buffer[0] as char);
                        },
                        Err(_) => {
                            return maj_err(
                                Maj::string(
                                    "Could not read from stream *stdin*"),
                                Maj::nil());
                        }
                    }
                },
            }
        } else {
            return maj_err(
                Maj::string("{} is not an input stream"),
                maj_list!(stream));
        }
    }

    match get_raw_stream(&mut state,
                         stream.clone(),
                         MajStreamDirection::In) {
        Ok(mut file) => {
            match file.read(&mut buffer) {
                Ok(_) => {
                    // Since a character was read,
                    // seek back to a point before it.
                    // If unable, this should fail anyway
                    file.seek(SeekFrom::Current(-1))
                        .unwrap();
                    Maj::character(buffer[0] as char)
                },
                Err(_) => {
                    maj_err(
                        Maj::string(
                            "Could not read from stream {}"),
                        maj_list!(stream))
                }
            }
        },
        Err(expr) => expr,
    }
}
#+end_src

