05-03-funcoes-primitivas.html

<div id="outline-container-org6b5a5d1" class="outline-3">
<h3 id="org6b5a5d1"><span class="section-number-3">30.5.</span> <code>(read-char stream)</code></h3>
<div class="outline-text-3" id="text-30-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_read_char</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                     <span style="color: #9cdcfe;">stream</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::<span style="color: #569cd6;">io</span>::<span style="color: #4ec9b0;">Read</span>;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">buffer</span> = [0; 1];
    <span style="color: #569cd6;">if</span> stdstreamp(stream.clone()) {
        <span style="color: #569cd6;">if</span> stdstreamdirp(stream.clone(), <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">In</span>) {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">peekopt</span> = state.pop_stdin_peeked();
            <span style="color: #569cd6;">match</span> peekopt {
                <span style="color: #4ec9b0;">Some</span>(c) =&gt; {
                    <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::character(c);
                },
                <span style="color: #4ec9b0;">None</span> =&gt; {
                    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::io;
                    <span style="color: #569cd6;">match</span> <span style="color: #569cd6;">io</span>::stdin().read(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer) {
                        <span style="color: #4ec9b0;">Ok</span>(_) =&gt; {
                            <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::character(buffer[0] <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">char</span>);
                        },
                        <span style="color: #4ec9b0;">Err</span>(_) =&gt; {
                            <span style="color: #569cd6;">return</span> maj_err(
                                <span style="color: #4ec9b0;">Maj</span>::string(
                                    <span style="color: #ce9178;">"Could not read from stream *stdin*"</span>),
                                <span style="color: #4ec9b0;">Maj</span>::nil());
                        }
                    }
                },
            }
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #569cd6;">return</span> maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not an input stream"</span>),
                <span style="color: #c586c0;">maj_list!</span>(stream));
        }
    }

    <span style="color: #569cd6;">match</span> get_raw_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                         stream.clone(),
                         <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">In</span>) {
        <span style="color: #4ec9b0;">Ok</span>(<span style="color: #569cd6;">mut</span> file) =&gt; {
            <span style="color: #569cd6;">match</span> file.read(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer) {
                <span style="color: #4ec9b0;">Ok</span>(_) =&gt; {
                    <span style="color: #4ec9b0;">Maj</span>::character(buffer[0] <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">char</span>)
                },
                <span style="color: #4ec9b0;">Err</span>(_) =&gt; {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"Could not read from stream {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(stream))
                }
            }
        },
        <span style="color: #4ec9b0;">Err</span>(expr) =&gt; expr,
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfe70f6b" class="outline-3">
<h3 id="orgfe70f6b"><span class="section-number-3">30.6.</span> <code>(peek-char stream)</code></h3>
<div class="outline-text-3" id="text-30-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_peek_char</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                     <span style="color: #9cdcfe;">stream</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::<span style="color: #569cd6;">io</span>::{ <span style="color: #4ec9b0;">Read</span>, <span style="color: #4ec9b0;">Seek</span>, <span style="color: #4ec9b0;">SeekFrom</span> };
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">buffer</span> = [0; 1];
    <span style="color: #569cd6;">if</span> stdstreamp(stream.clone()) {
        <span style="color: #569cd6;">if</span> stdstreamdirp(stream.clone(), <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">In</span>) {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">peekopt</span> = state.pop_stdin_peeked();
            <span style="color: #569cd6;">match</span> peekopt {
                <span style="color: #4ec9b0;">Some</span>(c) =&gt; {
                    state.push_stdin_peeked(c);
                    <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::character(c);
                },
                <span style="color: #4ec9b0;">None</span> =&gt; {
                    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::io;
                    <span style="color: #569cd6;">match</span> <span style="color: #569cd6;">io</span>::stdin().read(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer) {
                        <span style="color: #4ec9b0;">Ok</span>(_) =&gt; {
                            state.push_stdin_peeked(buffer[0] <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">char</span>);
                            <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::character(buffer[0] <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">char</span>);
                        },
                        <span style="color: #4ec9b0;">Err</span>(_) =&gt; {
                            <span style="color: #569cd6;">return</span> maj_err(
                                <span style="color: #4ec9b0;">Maj</span>::string(
                                    <span style="color: #ce9178;">"Could not read from stream *stdin*"</span>),
                                <span style="color: #4ec9b0;">Maj</span>::nil());
                        }
                    }
                },
            }
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #569cd6;">return</span> maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not an input stream"</span>),
                <span style="color: #c586c0;">maj_list!</span>(stream));
        }
    }

    <span style="color: #569cd6;">match</span> get_raw_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                         stream.clone(),
                         <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">In</span>) {
        <span style="color: #4ec9b0;">Ok</span>(<span style="color: #569cd6;">mut</span> file) =&gt; {
            <span style="color: #569cd6;">match</span> file.read(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer) {
                <span style="color: #4ec9b0;">Ok</span>(_) =&gt; {
                    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Since a character was read,</span>
                    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">seek back to a point before it.</span>
                    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">If unable, this should fail anyway</span>
                    file.seek(<span style="color: #4ec9b0;">SeekFrom</span>::<span style="color: #4ec9b0;">Current</span>(-1))
                        .unwrap();
                    <span style="color: #4ec9b0;">Maj</span>::character(buffer[0] <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">char</span>)
                },
                <span style="color: #4ec9b0;">Err</span>(_) =&gt; {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"Could not read from stream {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(stream))
                }
            }
        },
        <span style="color: #4ec9b0;">Err</span>(expr) =&gt; expr,
    }
}
</pre>
</div>
</div>
</div>
