05-03-funcoes-primitivas.org
*** ~(write-char c stream)~

#+begin_src rust
pub fn maj_write_char(mut state: &mut MajState,
                      c: Gc<Maj>,
                      stream: Gc<Maj>
) -> Gc<Maj> {
    use std::io::Write;
    use crate::axioms::predicates::maj_charp;
    if !maj_charp(c.clone()).to_bool() {
        return maj_err(
            Maj::string("{} is not a character"),
            maj_list!(c));
    }
    let c = c.to_char().unwrap();

    if stdstreamp(stream.clone()) {
        if stdstreamdirp(stream.clone(), MajStreamDirection::Out) {
            match stdstreamtype(stream) {
                MajStreamType::Stdout =>
                    print!("{}", c),
                MajStreamType::Stderr =>
                    eprint!("{}", c),
                _ => panic!("write char to stream of wrong type"),
            };
            return Maj::nil();
        } else {
            return maj_err(
                Maj::string("{} is not an output stream"),
                maj_list!(stream));
        }
    }

    match get_raw_stream(&mut state,
                         stream.clone(),
                         MajStreamDirection::Out) {
        Ok(mut file) => {
            match write!(file, "{}", c) {
                Ok(_) => {
                    let _ = file.flush();
                    Maj::nil()
                },
                Err(_) => {
                    maj_err(
                        Maj::string(
                            "Could not write to stream {}"),
                        maj_list!(stream))
                }
            }
        },
        Err(expr) => expr,
    }
}
#+end_src

*** ~(write-string str stream)~

#+begin_src rust
pub fn maj_write_string(mut state: &mut MajState,
                        strn: Gc<Maj>,
                        stream: Gc<Maj>
) -> Gc<Maj> {
    use std::io::Write;
    if !maj_stringp(strn.clone()).to_bool() {
        return maj_err(
            Maj::string("{} is not a string"),
            maj_list!(strn));
    }
    let strn = strn.stringify().unwrap();
    
    if stdstreamp(stream.clone()) {
        if stdstreamdirp(stream.clone(), MajStreamDirection::Out) {
            match stdstreamtype(stream) {
                MajStreamType::Stdout =>
                    print!("{}", strn),
                MajStreamType::Stderr =>
                    eprint!("{}", strn),
                _ => panic!("write string to stream of wrong type"),
            };
            return Maj::nil();
        } else {
            return maj_err(
                Maj::string("{} is not an output stream"),
                maj_list!(stream));
        }
    }

    match get_raw_stream(&mut state,
                         stream.clone(),
                         MajStreamDirection::Out) {
        Ok(mut file) => {
            match write!(file, "{}", strn) {
                Ok(_) => {
                    let _ = file.flush();
                    Maj::nil()
                },
                Err(_) => {
                    maj_err(
                        Maj::string(
                            "Could not write to stream {}"),
                        maj_list!(stream))
                }
            }
        },
        Err(expr) => expr,
    }
}
#+end_src

*** ~(write x stream)~

#+begin_src rust
pub fn maj_write(mut state: &mut MajState,
                 x: Gc<Maj>,
                 stream: Gc<Maj>
) -> Gc<Maj> {
    use crate::printing::maj_format;
    let string = Maj::string(&maj_format(&state, x));
    maj_write_string(&mut state, string, stream)
}
#+end_src

*** TODO ~(read stream)~
** Funções de entrada e saída

