05-03-funcoes-primitivas.html

<div id="outline-container-orgb718d2a" class="outline-3">
<h3 id="orgb718d2a"><span class="section-number-3">30.7.</span> <code>(write-char c stream)</code></h3>
<div class="outline-text-3" id="text-30-7">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_write_char</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                      <span style="color: #9cdcfe;">c</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                      <span style="color: #9cdcfe;">stream</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::<span style="color: #569cd6;">io</span>::<span style="color: #4ec9b0;">Write</span>;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_charp;
    <span style="color: #569cd6;">if</span> !maj_charp(c.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a character"</span>),
            <span style="color: #c586c0;">maj_list!</span>(c));
    }
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">c</span> = c.to_char().unwrap();

    <span style="color: #569cd6;">if</span> stdstreamp(stream.clone()) {
        <span style="color: #569cd6;">if</span> stdstreamdirp(stream.clone(), <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">Out</span>) {
            <span style="color: #569cd6;">match</span> stdstreamtype(stream) {
                <span style="color: #4ec9b0;">MajStreamType</span>::<span style="color: #4ec9b0;">Stdout</span> =&gt;
                    <span style="color: #c586c0;">print!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, c),
                <span style="color: #4ec9b0;">MajStreamType</span>::<span style="color: #4ec9b0;">Stderr</span> =&gt;
                    <span style="color: #c586c0;">eprint!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, c),
                _ =&gt; <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"write char to stream of wrong type"</span>),
            };
            <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::nil();
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #569cd6;">return</span> maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not an output stream"</span>),
                <span style="color: #c586c0;">maj_list!</span>(stream));
        }
    }

    <span style="color: #569cd6;">match</span> get_raw_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                         stream.clone(),
                         <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">Out</span>) {
        <span style="color: #4ec9b0;">Ok</span>(<span style="color: #569cd6;">mut</span> file) =&gt; {
            <span style="color: #569cd6;">match</span> <span style="color: #c586c0;">write!</span>(file, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, c) {
                <span style="color: #4ec9b0;">Ok</span>(_) =&gt; {
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = file.flush();
                    <span style="color: #4ec9b0;">Maj</span>::nil()
                },
                <span style="color: #4ec9b0;">Err</span>(_) =&gt; {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"Could not write to stream {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(stream))
                }
            }
        },
        <span style="color: #4ec9b0;">Err</span>(expr) =&gt; expr,
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3eadbe1" class="outline-3">
<h3 id="org3eadbe1"><span class="section-number-3">30.8.</span> <code>(write-string str stream)</code></h3>
<div class="outline-text-3" id="text-30-8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_write_string</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                        <span style="color: #9cdcfe;">strn</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                        <span style="color: #9cdcfe;">stream</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::<span style="color: #569cd6;">io</span>::<span style="color: #4ec9b0;">Write</span>;
    <span style="color: #569cd6;">if</span> !maj_stringp(strn.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a string"</span>),
            <span style="color: #c586c0;">maj_list!</span>(strn));
    }
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">strn</span> = strn.stringify().unwrap();
    
    <span style="color: #569cd6;">if</span> stdstreamp(stream.clone()) {
        <span style="color: #569cd6;">if</span> stdstreamdirp(stream.clone(), <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">Out</span>) {
            <span style="color: #569cd6;">match</span> stdstreamtype(stream) {
                <span style="color: #4ec9b0;">MajStreamType</span>::<span style="color: #4ec9b0;">Stdout</span> =&gt;
                    <span style="color: #c586c0;">print!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, strn),
                <span style="color: #4ec9b0;">MajStreamType</span>::<span style="color: #4ec9b0;">Stderr</span> =&gt;
                    <span style="color: #c586c0;">eprint!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, strn),
                _ =&gt; <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"write string to stream of wrong type"</span>),
            };
            <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::nil();
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #569cd6;">return</span> maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not an output stream"</span>),
                <span style="color: #c586c0;">maj_list!</span>(stream));
        }
    }

    <span style="color: #569cd6;">match</span> get_raw_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                         stream.clone(),
                         <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">Out</span>) {
        <span style="color: #4ec9b0;">Ok</span>(<span style="color: #569cd6;">mut</span> file) =&gt; {
            <span style="color: #569cd6;">match</span> <span style="color: #c586c0;">write!</span>(file, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, strn) {
                <span style="color: #4ec9b0;">Ok</span>(_) =&gt; {
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = file.flush();
                    <span style="color: #4ec9b0;">Maj</span>::nil()
                },
                <span style="color: #4ec9b0;">Err</span>(_) =&gt; {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"Could not write to stream {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(stream))
                }
            }
        },
        <span style="color: #4ec9b0;">Err</span>(expr) =&gt; expr,
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0705a60" class="outline-3">
<h3 id="org0705a60"><span class="section-number-3">30.9.</span> <code>(write x stream)</code></h3>
<div class="outline-text-3" id="text-30-9">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_write</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                 <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                 <span style="color: #9cdcfe;">stream</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">printing</span>::maj_format;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">string</span> = <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, x));
    maj_write_string(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, string, stream)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb9cc1c" class="outline-3">
<h3 id="orgeb9cc1c"><span class="section-number-3">30.10.</span> <span class="todo TODO">TODO</span> <code>(read stream)</code></h3>
</div>
</div>
<div id="outline-container-org8a331f2" class="outline-2">
<h2 id="org8a331f2"><span class="section-number-2">31.</span> Funções de entrada e saída</h2>
<div class="outline-text-2" id="text-31">
</div>
