05-03-funcoes-primitivas.org
*** ~(terpri)~

#+begin_src rust
pub fn maj_terpri(mut state: &mut MajState,
                  env: Gc<Maj>) -> Gc<Maj> {
    // Lookup dynamically bound stdout
    let stdout = Maj::symbol(&mut state, "*stdout*");
    let stdout = state.lookup(env.clone(), stdout);
    if maj_errorp(stdout.clone()).to_bool() {
        return stdout;
    }

    maj_write_char(&mut state, Maj::character('\n'),
                   stdout)
}
#+end_src

*** ~(display x)~

#+begin_src rust
pub fn maj_display(mut state: &mut MajState,
                   x: Gc<Maj>,
                   env: Gc<Maj>
) -> Gc<Maj> {
    // Lookup dynamically bound stdout
    let stdout = Maj::symbol(&mut state, "*stdout*");
    let stdout = state.lookup(env.clone(), stdout);
    if maj_errorp(stdout.clone()).to_bool() {
        return stdout;
    }

    maj_write(&mut state, x, stdout)
}
#+end_src

*** TODO ~(pretty-display x)~

# TODO: Vai ficar inútil em breve

#+begin_src rust
pub fn maj_pretty_display(mut state: &mut MajState,
                          x: Gc<Maj>,
                          env: Gc<Maj>
) -> Gc<Maj> {
    use crate::printing::maj_pretty_format;
    // Lookup dynamically bound stdout
    let stdout = Maj::symbol(&mut state, "*stdout*");
    let stdout = state.lookup(env.clone(), stdout);
    if maj_errorp(stdout.clone()).to_bool() {
        return stdout;
    }

    let string = maj_pretty_format(&state, x);
    let string = Maj::string(&string);
    maj_write_string(&mut state, string, stdout)
}
#+end_src

*** ~(print fmt . args)~

#+begin_src rust
pub fn maj_print(
    mut state: &mut MajState,
    fmt: Gc<Maj>,
    rest: Gc<Maj>,
    env: Gc<Maj>
) -> Gc<Maj> {
    // Lookup dynamically bound stdout
    let stdout = Maj::symbol(&mut state, "*stdout*");
    let stdout = state.lookup(env.clone(), stdout);
    if maj_errorp(stdout.clone()).to_bool() {
        return stdout;
    }

    let formatted = maj_format_prim(&state, fmt, rest);
    if maj_errorp(formatted.clone()).to_bool() {
        formatted
    } else {
        maj_write_string(&mut state, formatted,
                         stdout.clone());
        maj_write_char(&mut state, Maj::character('\n'),
                   stdout)
    }
}
#+end_src

