05-03-funcoes-primitivas.html
<div id="outline-container-org976e6e6" class="outline-3">
<h3 id="org976e6e6"><span class="section-number-3">31.1.</span> <code>(terpri)</code></h3>
<div class="outline-text-3" id="text-31-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_terpri</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                  <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Lookup dynamically bound stdout</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stdout</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*stdout*"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stdout</span> = state.lookup(env.clone(), stdout);
    <span style="color: #569cd6;">if</span> maj_errorp(stdout.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> stdout;
    }

    maj_write_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'\n'</span>),
                   stdout)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga07aa3a" class="outline-3">
<h3 id="orga07aa3a"><span class="section-number-3">31.2.</span> <code>(display x)</code></h3>
<div class="outline-text-3" id="text-31-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_display</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                   <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                   <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Lookup dynamically bound stdout</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stdout</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*stdout*"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stdout</span> = state.lookup(env.clone(), stdout);
    <span style="color: #569cd6;">if</span> maj_errorp(stdout.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> stdout;
    }

    maj_write(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, x, stdout)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org243fde1" class="outline-3">
<h3 id="org243fde1"><span class="section-number-3">31.3.</span> <span class="todo TODO">TODO</span> <code>(pretty-display x)</code></h3>
<div class="outline-text-3" id="text-31-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_pretty_display</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                          <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                          <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">printing</span>::maj_pretty_format;
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Lookup dynamically bound stdout</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stdout</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*stdout*"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stdout</span> = state.lookup(env.clone(), stdout);
    <span style="color: #569cd6;">if</span> maj_errorp(stdout.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> stdout;
    }

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">string</span> = maj_pretty_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, x);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">string</span> = <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>string);
    maj_write_string(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, string, stdout)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org13e79a7" class="outline-3">
<h3 id="org13e79a7"><span class="section-number-3">31.4.</span> <code>(print fmt . args)</code></h3>
<div class="outline-text-3" id="text-31-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_print</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">fmt</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Lookup dynamically bound stdout</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stdout</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*stdout*"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stdout</span> = state.lookup(env.clone(), stdout);
    <span style="color: #569cd6;">if</span> maj_errorp(stdout.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> stdout;
    }

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">formatted</span> = maj_format_prim(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, fmt, rest);
    <span style="color: #569cd6;">if</span> maj_errorp(formatted.clone()).to_bool() {
        formatted
    } <span style="color: #569cd6;">else</span> {
        maj_write_string(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, formatted,
                         stdout.clone());
        maj_write_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'\n'</span>),
                   stdout)
    }
}
</pre>
</div>
</div>
</div>
