05-03-funcoes-primitivas.org
*** TODO ~(load path)~

#+begin_src rust
pub fn maj_load(
    mut state: &mut MajState,
    env: Gc<Maj>,
    path: Gc<Maj>
) -> Gc<Maj> {
    use crate::reader::parser::maj_parse;
    use crate::reader::tokenizer::maj_tokenize_file;
    use crate::evaluator::maj_eval;
    match path.clone().stringify() {
        Some(pathstr) => {
            let mut buffer = String::new();
            match maj_tokenize_file(&pathstr, &mut buffer) {
                Ok(tokens) => {
                    match maj_parse(&mut state, tokens.clone()) {
                        Ok(expressions) => {
                            // TODO: Iterate over forms and yield errors
                            // depending on them
                            let results = maj_eval(&mut state, Maj::cons(
                                Maj::do_sym(), expressions), env);
                            if maj_errorp(results.clone()).to_bool() {
                                maj_err(
                                    Maj::string(
                                        "On evaluation of file {}: {}"),
                                    maj_list!(path, results))
                            } else {
                                results
                            }
                        },
                        Err(msg) => {
                            maj_err(
                                Maj::string("While parsing file {}: {}"),
                                maj_list!(path, Maj::string(msg)))
                        },
                    }
                },
                Err((line, msg)) => {
                    if line != 0 {
                        maj_err(
                            Maj::string("While reading file {}:{}: {}"),
                            maj_list!(path, Maj::integer(line as i64),
                                      Maj::string(msg)))
                    } else {
                        maj_err(
                            Maj::string("While reading file {}: {}"),
                            maj_list!(path, Maj::string(msg)))
                    }
                },
            }
        },
        None => maj_err(Maj::string("{} is not a string"),
                        maj_list!(path)),
    }
}
#+end_src

** Funções de vetores

*** ~(vec-type vec)~

#+begin_src rust
pub fn maj_vec_type(mut state: &mut MajState,
                    vec: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajVector;
    if !maj_vectorp(vec.clone()).to_bool() {
        return maj_err(
            Maj::string("{} is not a vector"),
            maj_list!(vec));
    }
    if let Maj::Vector(v) = &*vec {
        return Maj::symbol(&mut state, match v {
            MajVector::Integer(_) => "integer",
            MajVector::Float(_)   => "float",
            MajVector::Char(_)    => "char",
            MajVector::Any(_)     => "any",
        });
    }
    panic!("vec-type: Unknown vector type");
}
#+end_src

*** ~(vec-push x vec)~

#+begin_src rust
pub fn maj_vec_push(mut state: &mut MajState, x: Gc<Maj>, vec: Gc<Maj>) -> Gc<Maj> {
    let pos = maj_vec_length(vec.clone());
    if maj_errorp(pos.clone()).to_bool() {
        return pos;
    }

    maj_vec_insert(&mut state, pos, x, vec)
}
#+end_src

