05-03-funcoes-primitivas.html

<div id="outline-container-orgf195a19" class="outline-3">
<h3 id="orgf195a19"><span class="section-number-3">31.5.</span> <span class="todo TODO">TODO</span> <code>(load path)</code></h3>
<div class="outline-text-3" id="text-31-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_load</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">path</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">reader</span>::<span style="color: #569cd6;">parser</span>::maj_parse;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">reader</span>::<span style="color: #569cd6;">tokenizer</span>::maj_tokenize_file;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">evaluator</span>::maj_eval;
    <span style="color: #569cd6;">match</span> path.clone().stringify() {
        <span style="color: #4ec9b0;">Some</span>(pathstr) =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">buffer</span> = <span style="color: #4ec9b0;">String</span>::new();
            <span style="color: #569cd6;">match</span> maj_tokenize_file(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>pathstr, <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer) {
                <span style="color: #4ec9b0;">Ok</span>(tokens) =&gt; {
                    <span style="color: #569cd6;">match</span> maj_parse(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, tokens.clone()) {
                        <span style="color: #4ec9b0;">Ok</span>(expressions) =&gt; {
                            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">TODO: Iterate over forms and yield errors</span>
                            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">depending on them</span>
                            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">results</span> = maj_eval(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::cons(
                                <span style="color: #4ec9b0;">Maj</span>::do_sym(), expressions), env);
                            <span style="color: #569cd6;">if</span> maj_errorp(results.clone()).to_bool() {
                                maj_err(
                                    <span style="color: #4ec9b0;">Maj</span>::string(
                                        <span style="color: #ce9178;">"On evaluation of file {}: {}"</span>),
                                    <span style="color: #c586c0;">maj_list!</span>(path, results))
                            } <span style="color: #569cd6;">else</span> {
                                results
                            }
                        },
                        <span style="color: #4ec9b0;">Err</span>(msg) =&gt; {
                            maj_err(
                                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"While parsing file {}: {}"</span>),
                                <span style="color: #c586c0;">maj_list!</span>(path, <span style="color: #4ec9b0;">Maj</span>::string(msg)))
                        },
                    }
                },
                <span style="color: #4ec9b0;">Err</span>((line, msg)) =&gt; {
                    <span style="color: #569cd6;">if</span> line != 0 {
                        maj_err(
                            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"While reading file {}:{}: {}"</span>),
                            <span style="color: #c586c0;">maj_list!</span>(path, <span style="color: #4ec9b0;">Maj</span>::integer(line <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">i64</span>),
                                      <span style="color: #4ec9b0;">Maj</span>::string(msg)))
                    } <span style="color: #569cd6;">else</span> {
                        maj_err(
                            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"While reading file {}: {}"</span>),
                            <span style="color: #c586c0;">maj_list!</span>(path, <span style="color: #4ec9b0;">Maj</span>::string(msg)))
                    }
                },
            }
        },
        <span style="color: #4ec9b0;">None</span> =&gt; maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a string"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(path)),
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org13cc223" class="outline-2">
<h2 id="org13cc223"><span class="section-number-2">32.</span> Funções de vetores</h2>
<div class="outline-text-2" id="text-32">
</div>
<div id="outline-container-org16dba35" class="outline-3">
<h3 id="org16dba35"><span class="section-number-3">32.1.</span> <code>(vec-type vec)</code></h3>
<div class="outline-text-3" id="text-32-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_vec_type</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                    <span style="color: #9cdcfe;">vec</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajVector</span>;
    <span style="color: #569cd6;">if</span> !maj_vectorp(vec.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a vector"</span>),
            <span style="color: #c586c0;">maj_list!</span>(vec));
    }
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(v) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*vec {
        <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #569cd6;">match</span> v {
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Integer</span>(_) =&gt; <span style="color: #ce9178;">"integer"</span>,
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Float</span>(_)   =&gt; <span style="color: #ce9178;">"float"</span>,
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Char</span>(_)    =&gt; <span style="color: #ce9178;">"char"</span>,
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Any</span>(_)     =&gt; <span style="color: #ce9178;">"any"</span>,
        });
    }
    <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"vec-type: Unknown vector type"</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ceaa49" class="outline-3">
<h3 id="org7ceaa49"><span class="section-number-3">32.2.</span> <code>(vec-push x vec)</code></h3>
<div class="outline-text-3" id="text-32-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_vec_push</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>, <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">vec</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">pos</span> = maj_vec_length(vec.clone());
    <span style="color: #569cd6;">if</span> maj_errorp(pos.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> pos;
    }

    maj_vec_insert(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, pos, x, vec)
}
</pre>
</div>
</div>
</div>
