05-03-funcoes-primitivas.org
*** ~(vec-insert pos x vec)~

#+begin_src rust
pub fn maj_vec_insert(mut state: &mut MajState,
                      pos: Gc<Maj>,
                      x: Gc<Maj>,
                      vec: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajVector;

    if !maj_vectorp(vec.clone()).to_bool() {
        return maj_err(
            Maj::string("{} is not a vector"),
            maj_list!(vec));
    }

    let xtype = maj_type(&mut state, x.clone());
    let vectype = maj_vec_type(&mut state, vec.clone());
    let any = Maj::symbol(&mut state, "any");

    let index =
        match pos.clone().to_integer() {
            Some(x) => {
                if x < 0 {
                    return maj_err(
                        Maj::string(
                            "Index {} is out of bounds in {}"),
                        maj_list!(pos, vec));
                }
                x as usize
            },
            None => {
                return maj_err(
                    Maj::string("{} is not an integer"),
                    maj_list!(pos));
            },
        };

    if !maj_eq(vectype.clone(), any).to_bool()
        && !maj_eq(xtype.clone(), vectype.clone()).to_bool() {
        return maj_err(
            Maj::string(
                "{} has type {}, which is incompatible with insertion on vector of type {}"),
            maj_list!(x, xtype, vectype));
    }

    if let Maj::Vector(v) = &*vec.clone() {
        match v {
            MajVector::Integer(v) => {
                let val = x.to_integer().unwrap();
                let len = v.borrow().len();
                if index > len {
                    maj_err(
                        Maj::string(
                            "Index {} is out of bounds in {}"),
                        maj_list!(pos, vec))
                } else {
                    v.borrow_mut().insert(index, val);
                    vec
                }
            },
            MajVector::Float(v) => {
                let val = x.to_float().unwrap();
                let len = v.borrow().len();
                if index > len {
                    maj_err(
                        Maj::string(
                            "Index {} is out of bounds in {}"),
                        maj_list!(pos, vec))
                } else {
                    v.borrow_mut().insert(index, val);
                    vec
                }
            },
            MajVector::Char(s) => {
                let val = x.to_char().unwrap();
                let len = s.borrow().chars().count();
                if index > len {
                    maj_err(
                        Maj::string(
                            "Index {} is out of bounds in {}"),
                        maj_list!(pos, vec))
                } else {
                    s.borrow_mut().insert(index, val);
                    vec
                }
            },
            MajVector::Any(v) => {
                let len = v.borrow().len();
                if index > len {
                    maj_err(
                        Maj::string(
                            "Index {} is out of bounds in {}"),
                        maj_list!(pos, vec))
                } else {
                    v.borrow_mut().insert(index, x.clone());
                    vec
                }
            }
        }
    } else {
        panic!("vec-insert: Not a vector");
    }
}
#+end_src

