05-03-funcoes-primitivas.html

<div id="outline-container-orgf44e962" class="outline-3">
<h3 id="orgf44e962"><span class="section-number-3">32.3.</span> <code>(vec-insert pos x vec)</code></h3>
<div class="outline-text-3" id="text-32-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_vec_insert</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                      <span style="color: #9cdcfe;">pos</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                      <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                      <span style="color: #9cdcfe;">vec</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajVector</span>;

    <span style="color: #569cd6;">if</span> !maj_vectorp(vec.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a vector"</span>),
            <span style="color: #c586c0;">maj_list!</span>(vec));
    }

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">xtype</span> = maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, x.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">vectype</span> = maj_vec_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, vec.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">any</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"any"</span>);

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">index</span> =
        <span style="color: #569cd6;">match</span> pos.clone().to_integer() {
            <span style="color: #4ec9b0;">Some</span>(x) =&gt; {
                <span style="color: #569cd6;">if</span> x &lt; 0 {
                    <span style="color: #569cd6;">return</span> maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(pos, vec));
                }
                x <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">usize</span>
            },
            <span style="color: #4ec9b0;">None</span> =&gt; {
                <span style="color: #569cd6;">return</span> maj_err(
                    <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not an integer"</span>),
                    <span style="color: #c586c0;">maj_list!</span>(pos));
            },
        };

    <span style="color: #569cd6;">if</span> !maj_eq(vectype.clone(), any).to_bool()
        &amp;&amp; !maj_eq(xtype.clone(), vectype.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(
                <span style="color: #ce9178;">"{} has type {}, which is incompatible with insertion on vector of type {}"</span>),
            <span style="color: #c586c0;">maj_list!</span>(x, xtype, vectype));
    }

    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(v) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*vec.clone() {
        <span style="color: #569cd6;">match</span> v {
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Integer</span>(v) =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">val</span> = x.to_integer().unwrap();
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = v.borrow().len();
                <span style="color: #569cd6;">if</span> index &gt; len {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(pos, vec))
                } <span style="color: #569cd6;">else</span> {
                    v.borrow_mut().insert(index, val);
                    vec
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Float</span>(v) =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">val</span> = x.to_float().unwrap();
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = v.borrow().len();
                <span style="color: #569cd6;">if</span> index &gt; len {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(pos, vec))
                } <span style="color: #569cd6;">else</span> {
                    v.borrow_mut().insert(index, val);
                    vec
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Char</span>(s) =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">val</span> = x.to_char().unwrap();
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = s.borrow().chars().count();
                <span style="color: #569cd6;">if</span> index &gt; len {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(pos, vec))
                } <span style="color: #569cd6;">else</span> {
                    s.borrow_mut().insert(index, val);
                    vec
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Any</span>(v) =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = v.borrow().len();
                <span style="color: #569cd6;">if</span> index &gt; len {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(pos, vec))
                } <span style="color: #569cd6;">else</span> {
                    v.borrow_mut().insert(index, x.clone());
                    vec
                }
            }
        }
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"vec-insert: Not a vector"</span>);
    }
}
</pre>
</div>
</div>
</div>
