05-03-funcoes-primitivas.org
*** ~(vec-coerce vec type)~

#+begin_src rust
fn sym_to_vectype(mut state: &mut MajState,
                  vtype: Gc<Maj>) -> MajVectorType {
    if maj_eq(vtype.clone(),
              Maj::symbol(&mut state, "integer")).to_bool() {
        MajVectorType::Integer
    } else if maj_eq(
        vtype.clone(),
        Maj::symbol(&mut state, "float")).to_bool() {
        MajVectorType::Float
    } else if maj_eq(
        vtype.clone(),
        Maj::symbol(&mut state, "char")).to_bool() {
        MajVectorType::Char
    } else {
        MajVectorType::Any
    }
}
#+end_src

#+begin_src rust
pub fn maj_vec_coerce(mut state: &mut MajState,
                      vtype: Gc<Maj>,
                      vec: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajVector;
    if !maj_vectorp(vec.clone()).to_bool() {
        return maj_err(
            Maj::string("{} is not a vector"),
            maj_list!(vec));
    }
    let intended_type = sym_to_vectype(&mut state, vtype.clone());
    let newvec = Maj::vector(intended_type);
    let is_any_intended = maj_eq(vtype.clone(),
                                 Maj::symbol(&mut state, "any"))
        .to_bool();

    if let Maj::Vector(v) = &*vec {
        match v {
            MajVector::Integer(v) => {
                for n in v.borrow().iter() {
                    let num = Maj::integer(*n);
                    if !is_any_intended {
                        let num = maj_number_coerce(
                            &mut state, vtype.clone(), num.clone());
                        if maj_errorp(num.clone()).to_bool() {
                            return num;
                        }
                    }
                    let result =
                        maj_vec_push(&mut state,
                                     num.clone(),
                                     newvec.clone());
                    if maj_errorp(result.clone()).to_bool() {
                        return result;
                    }
                }
            },
            MajVector::Float(v) => {
                for n in v.borrow().iter() {
                    let num = Maj::float(*n);
                    if !is_any_intended {
                        let num = maj_number_coerce(
                            &mut state, vtype.clone(), num.clone());
                        if maj_errorp(num.clone()).to_bool() {
                            return num;
                        }
                    }
                    let result =
                        maj_vec_push(&mut state,
                                     num.clone(),
                                     newvec.clone());
                    if maj_errorp(result.clone()).to_bool() {
                        return result;
                    }
                }
            },
            MajVector::Char(s) => {
                for c in s.borrow().chars() {
                    let result =
                        maj_vec_push(&mut state,
                                     Maj::character(c),
                                     newvec.clone());
                    if maj_errorp(result.clone()).to_bool() {
                        return result;
                    }
                }
            },
            MajVector::Any(v) => {
                for elt in v.borrow().iter() {
                    let result =
                        maj_vec_push(&mut state,
                                     elt.clone(),
                                     newvec.clone());
                    if maj_errorp(result.clone()).to_bool() {
                        return result;
                    }
                }
            }
        }
    } else {
        panic!("vec-coerce: Not a vector");
    }
    newvec
}
#+end_src

