05-03-funcoes-primitivas.html

<div id="outline-container-orgf8f51a5" class="outline-3">
<h3 id="orgf8f51a5"><span class="section-number-3">32.4.</span> <code>(vec-coerce vec type)</code></h3>
<div class="outline-text-3" id="text-32-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">sym_to_vectype</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                  <span style="color: #9cdcfe;">vtype</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">MajVectorType</span> {
    <span style="color: #569cd6;">if</span> maj_eq(vtype.clone(),
              <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"integer"</span>)).to_bool() {
        <span style="color: #4ec9b0;">MajVectorType</span>::<span style="color: #4ec9b0;">Integer</span>
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_eq(
        vtype.clone(),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"float"</span>)).to_bool() {
        <span style="color: #4ec9b0;">MajVectorType</span>::<span style="color: #4ec9b0;">Float</span>
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_eq(
        vtype.clone(),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"char"</span>)).to_bool() {
        <span style="color: #4ec9b0;">MajVectorType</span>::<span style="color: #4ec9b0;">Char</span>
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #4ec9b0;">MajVectorType</span>::<span style="color: #4ec9b0;">Any</span>
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_vec_coerce</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                      <span style="color: #9cdcfe;">vtype</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                      <span style="color: #9cdcfe;">vec</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajVector</span>;
    <span style="color: #569cd6;">if</span> !maj_vectorp(vec.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a vector"</span>),
            <span style="color: #c586c0;">maj_list!</span>(vec));
    }
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">intended_type</span> = sym_to_vectype(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, vtype.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">newvec</span> = <span style="color: #4ec9b0;">Maj</span>::vector(intended_type);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">is_any_intended</span> = maj_eq(vtype.clone(),
                                 <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"any"</span>))
        .to_bool();

    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(v) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*vec {
        <span style="color: #569cd6;">match</span> v {
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Integer</span>(v) =&gt; {
                <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">n</span> <span style="color: #569cd6;">in</span> v.borrow().iter() {
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">num</span> = <span style="color: #4ec9b0;">Maj</span>::integer(*n);
                    <span style="color: #569cd6;">if</span> !is_any_intended {
                        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">num</span> = maj_number_coerce(
                            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, vtype.clone(), num.clone());
                        <span style="color: #569cd6;">if</span> maj_errorp(num.clone()).to_bool() {
                            <span style="color: #569cd6;">return</span> num;
                        }
                    }
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> =
                        maj_vec_push(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                                     num.clone(),
                                     newvec.clone());
                    <span style="color: #569cd6;">if</span> maj_errorp(result.clone()).to_bool() {
                        <span style="color: #569cd6;">return</span> result;
                    }
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Float</span>(v) =&gt; {
                <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">n</span> <span style="color: #569cd6;">in</span> v.borrow().iter() {
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">num</span> = <span style="color: #4ec9b0;">Maj</span>::float(*n);
                    <span style="color: #569cd6;">if</span> !is_any_intended {
                        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">num</span> = maj_number_coerce(
                            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, vtype.clone(), num.clone());
                        <span style="color: #569cd6;">if</span> maj_errorp(num.clone()).to_bool() {
                            <span style="color: #569cd6;">return</span> num;
                        }
                    }
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> =
                        maj_vec_push(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                                     num.clone(),
                                     newvec.clone());
                    <span style="color: #569cd6;">if</span> maj_errorp(result.clone()).to_bool() {
                        <span style="color: #569cd6;">return</span> result;
                    }
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Char</span>(s) =&gt; {
                <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">c</span> <span style="color: #569cd6;">in</span> s.borrow().chars() {
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> =
                        maj_vec_push(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                                     <span style="color: #4ec9b0;">Maj</span>::character(c),
                                     newvec.clone());
                    <span style="color: #569cd6;">if</span> maj_errorp(result.clone()).to_bool() {
                        <span style="color: #569cd6;">return</span> result;
                    }
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Any</span>(v) =&gt; {
                <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">elt</span> <span style="color: #569cd6;">in</span> v.borrow().iter() {
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> =
                        maj_vec_push(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                                     elt.clone(),
                                     newvec.clone());
                    <span style="color: #569cd6;">if</span> maj_errorp(result.clone()).to_bool() {
                        <span style="color: #569cd6;">return</span> result;
                    }
                }
            }
        }
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"vec-coerce: Not a vector"</span>);
    }
    newvec
}
</pre>
</div>
</div>
</div>
