05-03-funcoes-primitivas.org
*** ~(vector . rest)~

#+begin_src rust
fn vectype_compatible(mut state: &mut MajState,
                      vtype: MajVectorType,
                      xtype: Gc<Maj>) -> bool {
    match vtype {
        MajVectorType::Any => true,
        MajVectorType::Integer =>
            maj_eq(xtype,
                   Maj::symbol(&mut state, "integer"))
            .to_bool(),
        MajVectorType::Float =>
            maj_eq(xtype,
                   Maj::symbol(&mut state, "float"))
            .to_bool(),
        MajVectorType::Char =>
            maj_eq(xtype,
                   Maj::symbol(&mut state, "char"))
            .to_bool(),
    }
}
#+end_src

#+begin_src rust
fn best_vectype(mut state: &mut MajState,
                xtype: Gc<Maj>) -> MajVectorType {
    let integer = Maj::symbol(&mut state, "integer");
    let float   = Maj::symbol(&mut state, "float");
    let charsym = Maj::symbol(&mut state, "char");
    
    let sym =
        if maj_eq(xtype.clone(), integer).to_bool()
        || maj_eq(xtype.clone(), float).to_bool()
        || maj_eq(xtype.clone(), charsym).to_bool() {
            xtype
        } else {
            Maj::symbol(&mut state, "any")
        };
    sym_to_vectype(&mut state, sym)
}
#+end_src

#+begin_src rust
pub fn maj_vector(mut state: &mut MajState, rest: Gc<Maj>) -> Gc<Maj> {
    if maj_nilp(rest.clone()).to_bool() {
        Maj::vector(MajVectorType::Any)
    } else {
        let mut iter = rest.clone();

        let first = maj_car(iter.clone());
        let fsttype = maj_type(&mut state, first);
        let mut vector = Maj::vector(
            best_vectype(&mut state, fsttype));

        while !maj_nilp(iter.clone()).to_bool() {
            let first = maj_car(iter.clone());
            let fsttype = maj_type(&mut state, first.clone());

            let vtype = maj_vec_type(&mut state, vector.clone());
            let vtype = sym_to_vectype(&mut state, vtype);

            if !vectype_compatible(
                &mut state, vtype, fsttype) {
                let any = Maj::symbol(&mut state, "any");
                vector = maj_vec_coerce(
                    &mut state, any, vector);
                if maj_errorp(vector.clone()).to_bool() {
                    return vector;
                }
            }
            let res =
                maj_vec_push(&mut state, first, vector.clone());
            if maj_errorp(res.clone()).to_bool() {
                return res;
            }
            iter = maj_cdr(iter);
        }
        vector
    }
}
#+end_src

*** ~(vec-length vec)~

#+begin_src rust
pub fn maj_vec_length(vec: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajVector;
    if let Maj::Vector(v) = &*vec.clone() {
        Maj::integer(
            match v {
                MajVector::Integer(v) => v.borrow().len(),
                MajVector::Float(v) => v.borrow().len(),
                MajVector::Char(s) => s.borrow().chars().count(),
                MajVector::Any(v) => v.borrow().len(),
            } as i64)
    } else {
        maj_err(
            Maj::string("{} is not a vector"),
            maj_list!(vec))
    }
}
#+end_src

