05-03-funcoes-primitivas.html

<div id="outline-container-org95912f7" class="outline-3">
<h3 id="org95912f7"><span class="section-number-3">32.5.</span> <code>(vector . rest)</code></h3>
<div class="outline-text-3" id="text-32-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">vectype_compatible</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                      <span style="color: #9cdcfe;">vtype</span>: <span style="color: #4ec9b0;">MajVectorType</span>,
                      <span style="color: #9cdcfe;">xtype</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">bool</span> {
    <span style="color: #569cd6;">match</span> vtype {
        <span style="color: #4ec9b0;">MajVectorType</span>::<span style="color: #4ec9b0;">Any</span> =&gt; <span style="color: #569cd6;">true</span>,
        <span style="color: #4ec9b0;">MajVectorType</span>::<span style="color: #4ec9b0;">Integer</span> =&gt;
            maj_eq(xtype,
                   <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"integer"</span>))
            .to_bool(),
        <span style="color: #4ec9b0;">MajVectorType</span>::<span style="color: #4ec9b0;">Float</span> =&gt;
            maj_eq(xtype,
                   <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"float"</span>))
            .to_bool(),
        <span style="color: #4ec9b0;">MajVectorType</span>::<span style="color: #4ec9b0;">Char</span> =&gt;
            maj_eq(xtype,
                   <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"char"</span>))
            .to_bool(),
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">best_vectype</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                <span style="color: #9cdcfe;">xtype</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">MajVectorType</span> {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">integer</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"integer"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">float</span>   = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"float"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">charsym</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"char"</span>);
    
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">sym</span> =
        <span style="color: #569cd6;">if</span> maj_eq(xtype.clone(), integer).to_bool()
        || maj_eq(xtype.clone(), float).to_bool()
        || maj_eq(xtype.clone(), charsym).to_bool() {
            xtype
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"any"</span>)
        };
    sym_to_vectype(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, sym)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_vector</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>, <span style="color: #9cdcfe;">rest</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> maj_nilp(rest.clone()).to_bool() {
        <span style="color: #4ec9b0;">Maj</span>::vector(<span style="color: #4ec9b0;">MajVectorType</span>::<span style="color: #4ec9b0;">Any</span>)
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">iter</span> = rest.clone();

        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">first</span> = maj_car(iter.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fsttype</span> = maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first);
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">vector</span> = <span style="color: #4ec9b0;">Maj</span>::vector(
            best_vectype(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, fsttype));

        <span style="color: #569cd6;">while</span> !maj_nilp(iter.clone()).to_bool() {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">first</span> = maj_car(iter.clone());
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fsttype</span> = maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first.clone());

            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">vtype</span> = maj_vec_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, vector.clone());
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">vtype</span> = sym_to_vectype(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, vtype);

            <span style="color: #569cd6;">if</span> !vectype_compatible(
                <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, vtype, fsttype) {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">any</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"any"</span>);
                vector = maj_vec_coerce(
                    <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, any, vector);
                <span style="color: #569cd6;">if</span> maj_errorp(vector.clone()).to_bool() {
                    <span style="color: #569cd6;">return</span> vector;
                }
            }
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">res</span> =
                maj_vec_push(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, vector.clone());
            <span style="color: #569cd6;">if</span> maj_errorp(res.clone()).to_bool() {
                <span style="color: #569cd6;">return</span> res;
            }
            iter = maj_cdr(iter);
        }
        vector
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf5a691b" class="outline-3">
<h3 id="orgf5a691b"><span class="section-number-3">32.6.</span> <code>(vec-length vec)</code></h3>
<div class="outline-text-3" id="text-32-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_vec_length</span>(<span style="color: #9cdcfe;">vec</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajVector</span>;
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(v) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*vec.clone() {
        <span style="color: #4ec9b0;">Maj</span>::integer(
            <span style="color: #569cd6;">match</span> v {
                <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Integer</span>(v) =&gt; v.borrow().len(),
                <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Float</span>(v) =&gt; v.borrow().len(),
                <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Char</span>(s) =&gt; s.borrow().chars().count(),
                <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Any</span>(v) =&gt; v.borrow().len(),
            } <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">i64</span>)
    } <span style="color: #569cd6;">else</span> {
        maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a vector"</span>),
            <span style="color: #c586c0;">maj_list!</span>(vec))
    }
}
</pre>
</div>
</div>
</div>
