05-03-funcoes-primitivas.org
*** ~(vec-pop vec)~

#+begin_src rust
pub fn maj_vec_pop(vec: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajVector;
    if let Maj::Vector(vv) = &*vec.clone() {
        match vv {
            MajVector::Integer(v) => {
                match v.borrow_mut().pop() {
                    Some(val) => Maj::integer(val),
                    None => Maj::nil(),
                }
            },
            MajVector::Float(v) => {
                match v.borrow_mut().pop() {
                    Some(val) => Maj::float(val),
                    None => Maj::nil(),
                }
            },
            MajVector::Char(s) => {
                match s.borrow_mut().pop() {
                    Some(val) => Maj::character(val),
                    None => Maj::nil(),
                }
            },
            MajVector::Any(v) => {
                match v.borrow_mut().pop() {
                    Some(val) => val,
                    None => Maj::nil(),
                }
            }
        }
    } else {
        maj_err(
            Maj::string("{} is not a vector"),
            maj_list!(vec))
    }
}
#+end_src

*** ~(vec-deq vec)~

#+begin_src rust
pub fn maj_vec_deq(vec: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajVector;
    if let Maj::Vector(vv) = &*vec.clone() {
        match vv {
            MajVector::Integer(v) => {
                if v.borrow().is_empty() {
                    Maj::nil()
                } else {
                    Maj::integer(
                        v.borrow_mut().remove(0))
                }
            },
            MajVector::Float(v) => {
                if v.borrow().is_empty() {
                    Maj::nil()
                } else {
                    Maj::float(
                        v.borrow_mut().remove(0))
                }
            },
            MajVector::Char(s) => {
                if s.borrow().is_empty() {
                    Maj::nil()
                } else {
                    Maj::character(
                        s.borrow_mut().remove(0))
                }
            },
            MajVector::Any(v) => {
                if v.borrow().is_empty() {
                    Maj::nil()
                } else {
                    v.borrow_mut().remove(0)
                }
            }
        }
    } else {
        maj_err(
            Maj::string("{} is not a vector"),
            maj_list!(vec))
    }
}
#+end_src

*** ~(vec-at x vec)~

#+begin_src rust
pub fn maj_vec_at(x: Gc<Maj>, vec: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajVector;
    use crate::axioms::predicates::maj_integerp;

    if !maj_integerp(x.clone()).to_bool() {
        return maj_err(
            Maj::string("{} is not an integer"),
            maj_list!(x));
    }

    let index = x.to_integer().unwrap() as usize;

    if let Maj::Vector(vv) = &*vec.clone() {
        match vv {
            MajVector::Integer(v) => {
                match v.borrow().get(index) {
                    Some(val) => Maj::integer(*val),
                    None => maj_err(
                        Maj::string("Index {} is out of bounds in {}"),
                        maj_list!(x.clone(), vec)),
                }
            },
            MajVector::Float(v) => {
                match v.borrow().get(index) {
                    Some(val) => Maj::float(*val),
                    None => maj_err(
                        Maj::string("Index {} is out of bounds in {}"),
                        maj_list!(x.clone(), vec)),
                }
            },
            MajVector::Char(s) => {
                match s.borrow().chars().nth(index) {
                    Some(val) => Maj::character(val),
                    None => maj_err(
                        Maj::string("Index {} is out of bounds in {}"),
                        maj_list!(x.clone(), vec)),
                }
            },
            MajVector::Any(v) => {
                match v.borrow().get(index) {
                    Some(val) => val.clone(),
                    None => maj_err(
                        Maj::string("Index {} is out of bounds in {}"),
                        maj_list!(x.clone(), vec)),
                }
            }
        }
    } else {
        maj_err(
            Maj::string("{} is not a vector"),
            maj_list!(vec))
    }
}
#+end_src

