05-03-funcoes-primitivas.html

<div id="outline-container-org26b724f" class="outline-3">
<h3 id="org26b724f"><span class="section-number-3">32.7.</span> <code>(vec-pop vec)</code></h3>
<div class="outline-text-3" id="text-32-7">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_vec_pop</span>(<span style="color: #9cdcfe;">vec</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajVector</span>;
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(vv) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*vec.clone() {
        <span style="color: #569cd6;">match</span> vv {
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Integer</span>(v) =&gt; {
                <span style="color: #569cd6;">match</span> v.borrow_mut().pop() {
                    <span style="color: #4ec9b0;">Some</span>(val) =&gt; <span style="color: #4ec9b0;">Maj</span>::integer(val),
                    <span style="color: #4ec9b0;">None</span> =&gt; <span style="color: #4ec9b0;">Maj</span>::nil(),
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Float</span>(v) =&gt; {
                <span style="color: #569cd6;">match</span> v.borrow_mut().pop() {
                    <span style="color: #4ec9b0;">Some</span>(val) =&gt; <span style="color: #4ec9b0;">Maj</span>::float(val),
                    <span style="color: #4ec9b0;">None</span> =&gt; <span style="color: #4ec9b0;">Maj</span>::nil(),
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Char</span>(s) =&gt; {
                <span style="color: #569cd6;">match</span> s.borrow_mut().pop() {
                    <span style="color: #4ec9b0;">Some</span>(val) =&gt; <span style="color: #4ec9b0;">Maj</span>::character(val),
                    <span style="color: #4ec9b0;">None</span> =&gt; <span style="color: #4ec9b0;">Maj</span>::nil(),
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Any</span>(v) =&gt; {
                <span style="color: #569cd6;">match</span> v.borrow_mut().pop() {
                    <span style="color: #4ec9b0;">Some</span>(val) =&gt; val,
                    <span style="color: #4ec9b0;">None</span> =&gt; <span style="color: #4ec9b0;">Maj</span>::nil(),
                }
            }
        }
    } <span style="color: #569cd6;">else</span> {
        maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a vector"</span>),
            <span style="color: #c586c0;">maj_list!</span>(vec))
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd8d5a46" class="outline-3">
<h3 id="orgd8d5a46"><span class="section-number-3">32.8.</span> <code>(vec-deq vec)</code></h3>
<div class="outline-text-3" id="text-32-8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_vec_deq</span>(<span style="color: #9cdcfe;">vec</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajVector</span>;
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(vv) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*vec.clone() {
        <span style="color: #569cd6;">match</span> vv {
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Integer</span>(v) =&gt; {
                <span style="color: #569cd6;">if</span> v.borrow().is_empty() {
                    <span style="color: #4ec9b0;">Maj</span>::nil()
                } <span style="color: #569cd6;">else</span> {
                    <span style="color: #4ec9b0;">Maj</span>::integer(
                        v.borrow_mut().remove(0))
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Float</span>(v) =&gt; {
                <span style="color: #569cd6;">if</span> v.borrow().is_empty() {
                    <span style="color: #4ec9b0;">Maj</span>::nil()
                } <span style="color: #569cd6;">else</span> {
                    <span style="color: #4ec9b0;">Maj</span>::float(
                        v.borrow_mut().remove(0))
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Char</span>(s) =&gt; {
                <span style="color: #569cd6;">if</span> s.borrow().is_empty() {
                    <span style="color: #4ec9b0;">Maj</span>::nil()
                } <span style="color: #569cd6;">else</span> {
                    <span style="color: #4ec9b0;">Maj</span>::character(
                        s.borrow_mut().remove(0))
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Any</span>(v) =&gt; {
                <span style="color: #569cd6;">if</span> v.borrow().is_empty() {
                    <span style="color: #4ec9b0;">Maj</span>::nil()
                } <span style="color: #569cd6;">else</span> {
                    v.borrow_mut().remove(0)
                }
            }
        }
    } <span style="color: #569cd6;">else</span> {
        maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a vector"</span>),
            <span style="color: #c586c0;">maj_list!</span>(vec))
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org212cdde" class="outline-3">
<h3 id="org212cdde"><span class="section-number-3">32.9.</span> <code>(vec-at x vec)</code></h3>
<div class="outline-text-3" id="text-32-9">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_vec_at</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">vec</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajVector</span>;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_integerp;

    <span style="color: #569cd6;">if</span> !maj_integerp(x.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not an integer"</span>),
            <span style="color: #c586c0;">maj_list!</span>(x));
    }

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">index</span> = x.to_integer().unwrap() <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">usize</span>;

    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(vv) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*vec.clone() {
        <span style="color: #569cd6;">match</span> vv {
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Integer</span>(v) =&gt; {
                <span style="color: #569cd6;">match</span> v.borrow().get(index) {
                    <span style="color: #4ec9b0;">Some</span>(val) =&gt; <span style="color: #4ec9b0;">Maj</span>::integer(*val),
                    <span style="color: #4ec9b0;">None</span> =&gt; maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(x.clone(), vec)),
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Float</span>(v) =&gt; {
                <span style="color: #569cd6;">match</span> v.borrow().get(index) {
                    <span style="color: #4ec9b0;">Some</span>(val) =&gt; <span style="color: #4ec9b0;">Maj</span>::float(*val),
                    <span style="color: #4ec9b0;">None</span> =&gt; maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(x.clone(), vec)),
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Char</span>(s) =&gt; {
                <span style="color: #569cd6;">match</span> s.borrow().chars().nth(index) {
                    <span style="color: #4ec9b0;">Some</span>(val) =&gt; <span style="color: #4ec9b0;">Maj</span>::character(val),
                    <span style="color: #4ec9b0;">None</span> =&gt; maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(x.clone(), vec)),
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Any</span>(v) =&gt; {
                <span style="color: #569cd6;">match</span> v.borrow().get(index) {
                    <span style="color: #4ec9b0;">Some</span>(val) =&gt; val.clone(),
                    <span style="color: #4ec9b0;">None</span> =&gt; maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(x.clone(), vec)),
                }
            }
        }
    } <span style="color: #569cd6;">else</span> {
        maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a vector"</span>),
            <span style="color: #c586c0;">maj_list!</span>(vec))
    }
}
</pre>
</div>
</div>
</div>
