05-03-funcoes-primitivas.org
*** ~(vec-set pos x vec)~

#+begin_src rust
fn replace_string_char(strn: &mut String, index: usize, rep: char) {
    let mut vec = strn.chars().collect::<Vec<_>>();
    vec[index] = rep;
    *strn = vec.iter().collect::<String>();
}
#+end_src

#+begin_src rust
pub fn maj_vec_set(
    pos: Gc<Maj>, x: Gc<Maj>, vec: Gc<Maj>
) -> Gc<Maj> {
    use crate::core::types::MajVector;
    use crate::axioms::predicates::{
        maj_integerp,
        maj_floatp,
        maj_charp
    };
    let index =
        match pos.clone().to_integer() {
            Some(x) => {
                if x < 0 {
                    return maj_err(
                        Maj::string(
                            "Index {} is out of bounds in {}"),
                        maj_list!(pos, vec));
                }
                x as usize
            },
            None => {
                return maj_err(
                    Maj::string("{} is not an integer"),
                    maj_list!(pos));
            },
        };

    if let Maj::Vector(vv) = &*vec.clone() {
        match vv {
            MajVector::Integer(v) => {
                if !maj_integerp(x.clone()).to_bool() {
                    return maj_err(
                        Maj::string(
                            "{} is not type-compatible with vector {}"),
                        maj_list!(x.clone(), vec.clone()));
                }
                let x = x.to_integer().unwrap();
                let len = v.borrow().len();
                if index >= len {
                    maj_err(
                        Maj::string("Index {} is out of bounds in {}"),
                        maj_list!(pos, vec))
                } else {
                    v.borrow_mut()[index] = x;
                    vec
                }
            },
            MajVector::Float(v) => {
                if!maj_floatp(x.clone()).to_bool() {
                    return maj_err(
                        Maj::string(
                            "{} is not type-compatible with vector {}"),
                        maj_list!(x.clone(), vec.clone()));
                }
                let x = x.to_float().unwrap();
                let len = v.borrow().len();
                if index >= len {
                    maj_err(
                        Maj::string("Index {} is out of bounds in {}"),
                        maj_list!(pos, vec))
                } else {
                    v.borrow_mut()[index] = x;
                    vec
                }
            },
            MajVector::Char(s) => {
                if!maj_charp(x.clone()).to_bool() {
                    maj_err(
                        Maj::string(
                            "{} is not type-compatible with vector {}"),
                        maj_list!(x.clone(), vec.clone()));
                }
                let c = x.clone().to_char().unwrap();
                let len = s.borrow().len();
                if index >= len {
                    maj_err(
                        Maj::string("Index {} is out of bounds in {}"),
                        maj_list!(pos, vec))
                } else {
                    replace_string_char(&mut s.borrow_mut(), index, c);
                    vec
                }
            },
            MajVector::Any(v) => {
                let len = v.borrow().len();
                if index >= len {
                    return maj_err(
                        Maj::string("Index {} is out of bounds in {}"),
                        maj_list!(pos, vec))
                } else {
                    v.borrow_mut()[index] = x.clone();
                    vec
                }
            },
        }
    } else {
        maj_err(
            Maj::string("{} is not a vector"),
            maj_list!(vec))
    }
}
#+end_src

