05-03-funcoes-primitivas.html

<div id="outline-container-orga58bee7" class="outline-3">
<h3 id="orga58bee7"><span class="section-number-3">32.10.</span> <code>(vec-set pos x vec)</code></h3>
<div class="outline-text-3" id="text-32-10">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">replace_string_char</span>(<span style="color: #9cdcfe;">strn</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">String</span>, <span style="color: #9cdcfe;">index</span>: <span style="color: #4ec9b0;">usize</span>, <span style="color: #9cdcfe;">rep</span>: <span style="color: #4ec9b0;">char</span>) {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">vec</span> = strn.chars().collect::&lt;<span style="color: #4ec9b0;">Vec</span>&lt;_&gt;&gt;();
    vec[index] = rep;
    *strn = vec.iter().collect::&lt;<span style="color: #4ec9b0;">String</span>&gt;();
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_vec_set</span>(
    <span style="color: #9cdcfe;">pos</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">vec</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajVector</span>;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::{
        maj_integerp,
        maj_floatp,
        maj_charp
    };
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">index</span> =
        <span style="color: #569cd6;">match</span> pos.clone().to_integer() {
            <span style="color: #4ec9b0;">Some</span>(x) =&gt; {
                <span style="color: #569cd6;">if</span> x &lt; 0 {
                    <span style="color: #569cd6;">return</span> maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(pos, vec));
                }
                x <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">usize</span>
            },
            <span style="color: #4ec9b0;">None</span> =&gt; {
                <span style="color: #569cd6;">return</span> maj_err(
                    <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not an integer"</span>),
                    <span style="color: #c586c0;">maj_list!</span>(pos));
            },
        };

    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(vv) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*vec.clone() {
        <span style="color: #569cd6;">match</span> vv {
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Integer</span>(v) =&gt; {
                <span style="color: #569cd6;">if</span> !maj_integerp(x.clone()).to_bool() {
                    <span style="color: #569cd6;">return</span> maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"{} is not type-compatible with vector {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(x.clone(), vec.clone()));
                }
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = x.to_integer().unwrap();
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = v.borrow().len();
                <span style="color: #569cd6;">if</span> index &gt;= len {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(pos, vec))
                } <span style="color: #569cd6;">else</span> {
                    v.borrow_mut()[index] = x;
                    vec
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Float</span>(v) =&gt; {
                <span style="color: #569cd6;">if</span>!maj_floatp(x.clone()).to_bool() {
                    <span style="color: #569cd6;">return</span> maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"{} is not type-compatible with vector {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(x.clone(), vec.clone()));
                }
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = x.to_float().unwrap();
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = v.borrow().len();
                <span style="color: #569cd6;">if</span> index &gt;= len {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(pos, vec))
                } <span style="color: #569cd6;">else</span> {
                    v.borrow_mut()[index] = x;
                    vec
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Char</span>(s) =&gt; {
                <span style="color: #569cd6;">if</span>!maj_charp(x.clone()).to_bool() {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"{} is not type-compatible with vector {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(x.clone(), vec.clone()));
                }
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">c</span> = x.clone().to_char().unwrap();
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = s.borrow().len();
                <span style="color: #569cd6;">if</span> index &gt;= len {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(pos, vec))
                } <span style="color: #569cd6;">else</span> {
                    replace_string_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> s.borrow_mut(), index, c);
                    vec
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Any</span>(v) =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = v.borrow().len();
                <span style="color: #569cd6;">if</span> index &gt;= len {
                    <span style="color: #569cd6;">return</span> maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(pos, vec))
                } <span style="color: #569cd6;">else</span> {
                    v.borrow_mut()[index] = x.clone();
                    vec
                }
            },
        }
    } <span style="color: #569cd6;">else</span> {
        maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a vector"</span>),
            <span style="color: #c586c0;">maj_list!</span>(vec))
    }
}
</pre>
</div>
</div>
</div>
