05-03-funcoes-primitivas.org
*** ~(vec-remove vec pos)~

#+begin_src rust
pub fn maj_vec_remove(pos: Gc<Maj>, vec: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajVector;
    let index =
        match pos.clone().to_integer() {
            Some(x) => {
                if x < 0 {
                    return maj_err(
                        Maj::string(
                            "Index {} is out of bounds in {}"),
                        maj_list!(pos, vec));
                }
                x as usize
            },
            None => {
                return maj_err(
                    Maj::string("{} is not an integer"),
                    maj_list!(pos));
            },
        };
    if let Maj::Vector(vv) = &*vec {
        match vv {
            MajVector::Integer(v) => {
                let len = v.borrow().len();
                if index >= len {
                    maj_err(
                        Maj::string(
                            "Index {} is out of bounds in {}"),
                        maj_list!(pos, vec))
                } else {
                    let value = v.borrow_mut().remove(index);
                    Maj::integer(value)
                }
            },
            MajVector::Float(v) => {
                let len = v.borrow().len();
                if index >= len {
                    maj_err(
                        Maj::string(
                            "Index {} is out of bounds in {}"),
                        maj_list!(pos, vec))
                } else {
                    let value = v.borrow_mut().remove(index);
                    Maj::float(value)
                }
            },
            MajVector::Char(s) => {
                let len = s.borrow().chars().count();
                if index >= len {
                    maj_err(
                        Maj::string(
                            "Index {} is out of bounds in {}"),
                        maj_list!(pos, vec))
                } else {
                    let value = s.borrow_mut().remove(index);
                    Maj::character(value)
                }
            },
            MajVector::Any(v) => {
                let len = v.borrow().len();
                if index >= len {
                    maj_err(
                        Maj::string(
                            "Index {} is out of bounds in {}"),
                        maj_list!(pos, vec))
                } else {
                    v.borrow_mut().remove(index)
                }
            },
        }
    } else {
        maj_err(Maj::string("{} is not a vector"),
                maj_list!(vec))
    }
}
#+end_src

** Funções customizadas
*** ~(gc)~

# Non-standard, implementation-wise

#+begin_src rust
pub fn maj_gc() -> Gc<Maj> {
    use gc::force_collect;
    force_collect();
    Maj::nil()
}
#+end_src

*** ~(print-env type)~

# Not accessible outside of package

#+begin_src rust
fn maj_print_env(
    mut state: &mut MajState,
    args: Gc<Maj>,
    env: Gc<Maj>
) -> Gc<Maj> {
    use crate::printing::maj_format_env;
    let is_global =
        maj_eq(maj_car(args.clone()),
               Maj::symbol(&mut state, "global"))
        .to_bool();
    let is_lexical =
        maj_eq(maj_car(args.clone()),
               Maj::symbol(&mut state, "lexical"))
        .to_bool();

    if is_global {
        println!("{}", state);
        Maj::nil()
    } else if is_lexical {
        println!("{}", maj_format_env(&state, env));
        Maj::nil()
    } else {
        maj_err(Maj::string("Unknown environment type {}"),
                maj_list!(maj_car(args)))
    }
}
#+end_src

*** ~(stack-state)~

#+begin_src rust
fn maj_stack_state() -> Gc<Maj> {
    match stacker::remaining_stack() {
        Some(n) => {
            println!("Remaining stack: {}B (roughly {}KB)",
                     n, n / 1024);
            use std::convert::TryInto;
            match n.try_into() {
                Ok(n) => Maj::integer(n),
                Err(_) => Maj::t()
            }
        },
        None => {
            println!("Couldn't query stack state");
            Maj::nil()
        }
    }
}
#+end_src

