05-03-funcoes-primitivas.html

<div id="outline-container-org67d495f" class="outline-3">
<h3 id="org67d495f"><span class="section-number-3">32.11.</span> <code>(vec-remove vec pos)</code></h3>
<div class="outline-text-3" id="text-32-11">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_vec_remove</span>(<span style="color: #9cdcfe;">pos</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">vec</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajVector</span>;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">index</span> =
        <span style="color: #569cd6;">match</span> pos.clone().to_integer() {
            <span style="color: #4ec9b0;">Some</span>(x) =&gt; {
                <span style="color: #569cd6;">if</span> x &lt; 0 {
                    <span style="color: #569cd6;">return</span> maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(pos, vec));
                }
                x <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">usize</span>
            },
            <span style="color: #4ec9b0;">None</span> =&gt; {
                <span style="color: #569cd6;">return</span> maj_err(
                    <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not an integer"</span>),
                    <span style="color: #c586c0;">maj_list!</span>(pos));
            },
        };
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(vv) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*vec {
        <span style="color: #569cd6;">match</span> vv {
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Integer</span>(v) =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = v.borrow().len();
                <span style="color: #569cd6;">if</span> index &gt;= len {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(pos, vec))
                } <span style="color: #569cd6;">else</span> {
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">value</span> = v.borrow_mut().remove(index);
                    <span style="color: #4ec9b0;">Maj</span>::integer(value)
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Float</span>(v) =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = v.borrow().len();
                <span style="color: #569cd6;">if</span> index &gt;= len {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(pos, vec))
                } <span style="color: #569cd6;">else</span> {
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">value</span> = v.borrow_mut().remove(index);
                    <span style="color: #4ec9b0;">Maj</span>::float(value)
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Char</span>(s) =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = s.borrow().chars().count();
                <span style="color: #569cd6;">if</span> index &gt;= len {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(pos, vec))
                } <span style="color: #569cd6;">else</span> {
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">value</span> = s.borrow_mut().remove(index);
                    <span style="color: #4ec9b0;">Maj</span>::character(value)
                }
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Any</span>(v) =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = v.borrow().len();
                <span style="color: #569cd6;">if</span> index &gt;= len {
                    maj_err(
                        <span style="color: #4ec9b0;">Maj</span>::string(
                            <span style="color: #ce9178;">"Index {} is out of bounds in {}"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(pos, vec))
                } <span style="color: #569cd6;">else</span> {
                    v.borrow_mut().remove(index)
                }
            },
        }
    } <span style="color: #569cd6;">else</span> {
        maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a vector"</span>),
                <span style="color: #c586c0;">maj_list!</span>(vec))
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2f40199" class="outline-2">
<h2 id="org2f40199"><span class="section-number-2">33.</span> Funções customizadas</h2>
<div class="outline-text-2" id="text-33">
</div>
<div id="outline-container-orgc4e8ef5" class="outline-3">
<h3 id="orgc4e8ef5"><span class="section-number-3">33.1.</span> <code>(gc)</code></h3>
<div class="outline-text-3" id="text-33-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_gc</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">gc</span>::force_collect;
    force_collect();
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org53d9558" class="outline-3">
<h3 id="org53d9558"><span class="section-number-3">33.2.</span> <code>(print-env type)</code></h3>
<div class="outline-text-3" id="text-33-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_print_env</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">args</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">printing</span>::maj_format_env;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">is_global</span> =
        maj_eq(maj_car(args.clone()),
               <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"global"</span>))
        .to_bool();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">is_lexical</span> =
        maj_eq(maj_car(args.clone()),
               <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"lexical"</span>))
        .to_bool();

    <span style="color: #569cd6;">if</span> is_global {
        <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, state);
        <span style="color: #4ec9b0;">Maj</span>::nil()
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> is_lexical {
        <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, maj_format_env(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, env));
        <span style="color: #4ec9b0;">Maj</span>::nil()
    } <span style="color: #569cd6;">else</span> {
        maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Unknown environment type {}"</span>),
                <span style="color: #c586c0;">maj_list!</span>(maj_car(args)))
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org425fb20" class="outline-3">
<h3 id="org425fb20"><span class="section-number-3">33.3.</span> <code>(stack-state)</code></h3>
<div class="outline-text-3" id="text-33-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_stack_state</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">match</span> <span style="color: #569cd6;">stacker</span>::remaining_stack() {
        <span style="color: #4ec9b0;">Some</span>(n) =&gt; {
            <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"Remaining stack: </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">B (roughly </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">KB)"</span>,
                     n, n / 1024);
            <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::<span style="color: #569cd6;">convert</span>::<span style="color: #4ec9b0;">TryInto</span>;
            <span style="color: #569cd6;">match</span> n.try_into() {
                <span style="color: #4ec9b0;">Ok</span>(n) =&gt; <span style="color: #4ec9b0;">Maj</span>::integer(n),
                <span style="color: #4ec9b0;">Err</span>(_) =&gt; <span style="color: #4ec9b0;">Maj</span>::t()
            }
        },
        <span style="color: #4ec9b0;">None</span> =&gt; {
            <span style="color: #c586c0;">println!</span>(<span style="color: #ce9178;">"Couldn't query stack state"</span>);
            <span style="color: #4ec9b0;">Maj</span>::nil()
        }
    }
}
</pre>
</div>
</div>
</div>
</div>
