05-03-funcoes-primitivas.org
** Registro em contexto global

#+begin_src rust
pub fn maj_gen_primitives(state: &mut MajState) {
    use crate::axioms::{ MajPrimFn, MajPrimArgs };
    let primitives: Vec<(&str, MajPrimArgs, MajPrimFn)> = vec![
        ("cons", MajPrimArgs::Required(2), |_, args, _| {
            maj_destructure_args!(args, first, rest, second);
            maj_cons(first, second)
        }),
        ("car", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_car(first)
        }),
        ("cdr", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_cdr(first)
        }),
        ("copy", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_copy(first)
        }),
        ("length", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_length(first)
        }),
        ("depth", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_depth(first)
        }),
        ("type", MajPrimArgs::Required(1), |mut state, args, _| {
            maj_destructure_args!(args, first);
            maj_type(&mut state, first)
        }),
        ("intern", MajPrimArgs::Required(1), |mut state, args, _| {
            maj_destructure_args!(args, first);
            maj_intern(&mut state, first)
        }),
        ("name", MajPrimArgs::Required(1), |mut state, args, _| {
            maj_destructure_args!(args, first);
            maj_name(&mut state, first)
        }),
        ("get-environment", MajPrimArgs::Required(1),
         |mut state, args, env| {
            maj_destructure_args!(args, first);
            maj_get_environment(&mut state, first, env)
        }),
        ("coin", MajPrimArgs::None, |_, _, _| maj_coin()),
        ("sys", MajPrimArgs::Variadic(1), |_, args, _| {
            maj_destructure_args!(args, first, rest);
            maj_sys(first, rest)
        }),
        ("format", MajPrimArgs::Variadic(1), |state, args, _| {
            maj_destructure_args!(args, first, rest);
            maj_format_prim(&state, first, rest)
        }),
        ("err", MajPrimArgs::Variadic(1), |_, args, _| {
            maj_destructure_args!(args, first, rest);
            maj_err(first, rest)
        }),
        ("warn", MajPrimArgs::Variadic(1), |mut state, args, env| {
            maj_destructure_args!(args, first, rest);
            maj_warn(&mut state, first, rest, env)
        }),
        ("list", MajPrimArgs::Variadic(0),
         |_, args, _| maj_list(args)),
        ("append", MajPrimArgs::Variadic(0),
         |_, args, _| maj_append(args)),
        ("last", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_last(first)
        }),
        ("reverse", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_reverse(first)
        }),
        ("nth", MajPrimArgs::Required(2), |_, args, _| {
            maj_destructure_args!(args, first, rest, second);
            maj_nth(first, second)
        }),
        ("nthcdr", MajPrimArgs::Required(2), |_, args, _| {
            maj_destructure_args!(args, first, rest, second);
            maj_nthcdr(first, second)
        }),
        ("macroexpand-1", MajPrimArgs::Required(1),
         |mut state, args, env| {
             maj_destructure_args!(args, first);
             let (result, _) =
                 maj_macroexpand_1(&mut state, first, env);
             result
         }),
        ("not", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_not(first)
        }),
        ("gensym", MajPrimArgs::None,
         |mut state, _, _| maj_gensym(&mut state)),
        ("iota", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_iota(first)
         }),

        // Number functions
        ("number-coerce", MajPrimArgs::Required(2),
         |mut state, args, _| {
             maj_destructure_args!(args, first, rest, second);
             maj_number_coerce(&mut state, first, second)
         }),
        ("real-part", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_real_part(first)
        }),
        ("imag-part", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_imag_part(first)
        }),
        ("numer", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_numer(first)
        }),
        ("denom", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_denom(first)
        }),
        ("richest-number-type", MajPrimArgs::Required(2),
         |mut state, args, _| {
            maj_destructure_args!(args, first, rest, second);
            maj_richest_number_type(&mut state, first, second)
        }),
        ("rich-number-coerce", MajPrimArgs::Required(2),
         |mut state, args, _| {
             maj_destructure_args!(args, first, rest, second);
             maj_rich_number_coerce(&mut state, first, second)
         }),
        ("=", MajPrimArgs::Variadic(2),
         |mut state, args, env| {
             maj_destructure_args!(args, first, r, second, rest);
             maj_arithm_eq(&mut state, env, first, second, rest)
         }),
        ("float=", MajPrimArgs::Required(2),
         |mut state, args, env| {
             maj_destructure_args!(args, first, r, second);
             maj_arithm_floateq(&mut state, env, first, second)
         }),
        (">", MajPrimArgs::Variadic(2),
         |mut state, args, _| {
             maj_destructure_args!(args, first, r, second, rest);
             maj_arithm_greater(&mut state, first, second, rest)
         }),
        ("<", MajPrimArgs::Variadic(2),
         |mut state, args, _| {
             maj_destructure_args!(args, first, r, second, rest);
             maj_arithm_lesser(&mut state, first, second, rest)
         }),
        (">=", MajPrimArgs::Variadic(2),
         |mut state, args, env| {
             maj_destructure_args!(args, first, r, second, rest);
             maj_arithm_geq(&mut state, env, first, second, rest)
         }),
        ("<=", MajPrimArgs::Variadic(2),
         |mut state, args, env| {
             maj_destructure_args!(args, first, r, second, rest);
             maj_arithm_leq(&mut state, env, first, second, rest)
         }),
        ("+", MajPrimArgs::Variadic(0),
         |mut state, args, env| {
             maj_arithm_plus(&mut state, env, args)
         }),
        ("-", MajPrimArgs::Variadic(0),
         |mut state, args, env| {
             maj_arithm_minus(&mut state, env, args)
         }),
        ("*", MajPrimArgs::Variadic(0),
         |mut state, args, env| {
             maj_arithm_times(&mut state, env, args)
         }),
        ("/", MajPrimArgs::Variadic(0),
         |mut state, args, env| {
             maj_arithm_divide(&mut state, env, args)
         }),

        // Stream functions
        ("open-stream", MajPrimArgs::Required(2), |mut state, args, _| {
            maj_destructure_args!(args, first, rest, second);
            maj_open_stream(&mut state, first, second)
        }),
        ("close-stream", MajPrimArgs::Required(1), |mut state, args, _| {
            maj_destructure_args!(args, first);
            maj_close_stream(&mut state, first)
        }),
        ("stat", MajPrimArgs::Required(1), |mut state, args, _| {
            maj_destructure_args!(args, first);
            maj_stat(&mut state, first)
        }),
        ("read-char", MajPrimArgs::Required(1), |mut state, args, _| {
            maj_destructure_args!(args, first);
            maj_read_char(&mut state, first)
        }),
        ("peek-char", MajPrimArgs::Required(1), |mut state, args, _| {
            maj_destructure_args!(args, first);
            maj_peek_char(&mut state, first)
        }),
        ("write-char", MajPrimArgs::Required(2), |mut state, args, _| {
            maj_destructure_args!(args, first, rest, second);
            maj_write_char(&mut state, first, second)
        }),
        ("write-string", MajPrimArgs::Required(2), |mut state, args, _| {
            maj_destructure_args!(args, first, rest, second);
            maj_write_string(&mut state, first, second)
        }),
        ("write", MajPrimArgs::Required(2), |mut state, args, _| {
            maj_destructure_args!(args, first, rest, second);
            maj_write(&mut state, first, second)
        }),
        ("terpri", MajPrimArgs::None, |mut state, _, env| {
            maj_terpri(&mut state, env)
        }),
        ("display", MajPrimArgs::Required(1), |mut state, args, env| {
            maj_destructure_args!(args, first);
            maj_display(&mut state, first, env)
        }),
        ("pretty-display", MajPrimArgs::Required(1),
         |mut state, args, env| {
             maj_destructure_args!(args, first);
             maj_pretty_display(&mut state, first, env)
         }),
        ("print", MajPrimArgs::Variadic(1), |mut state, args, env| {
            maj_destructure_args!(args, first, rest);
            maj_print(&mut state, first, rest, env)
        }),
        ("load", MajPrimArgs::Required(1), |mut state, args, env| {
            maj_destructure_args!(args, first);
            maj_load(&mut state, env, first)
        }),

        // Vector functions
        ("vec-type", MajPrimArgs::Required(1), |mut state, args, _| {
            maj_destructure_args!(args, first);
            maj_vec_type(&mut state, first)
        }),
        ("vec-push", MajPrimArgs::Required(2), |mut state, args, _| {
            maj_destructure_args!(args, first, rest, second);
            maj_vec_push(&mut state, first, second)
        }),
        ("vec-insert", MajPrimArgs::Required(3), |mut state, args, _| {
            maj_destructure_args!(args, first, rest, second,
                                  sndrst, third);
            maj_vec_insert(&mut state, first, second, third)
        }),
        ("vec-coerce", MajPrimArgs::Required(2), |mut state, args, _| {
            maj_destructure_args!(args, first, rest, second);
            maj_vec_coerce(&mut state, first, second)
        }),
        ("vector", MajPrimArgs::Variadic(0), |mut state, args, _| {
            maj_vector(&mut state, args)
        }),
        ("vec-length", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_vec_length(first)
        }),
        ("vec-pop", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_vec_pop(first)
        }),
        ("vec-deq", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_vec_deq(first)
        }),
        ("vec-at", MajPrimArgs::Required(2), |_, args, _| {
            maj_destructure_args!(args, first, rest, second);
            maj_vec_at(first, second)
        }),
        ("vec-set", MajPrimArgs::Required(3), |_, args, _| {
            maj_destructure_args!(args, first, rest, second,
                                  snd_rest, third);
            maj_vec_set(first, second, third)
        }),
        ("vec-remove", MajPrimArgs::Required(2), |_, args, _| {
            maj_destructure_args!(args, first, rest, second);
            maj_vec_remove(first, second)
        }),

        // Non-standard functions
        ("gc", MajPrimArgs::None, |_, _, _| maj_gc()),
        ("print-env", MajPrimArgs::Required(1), maj_print_env),
        ("stack-state", MajPrimArgs::None, |_, _, _| maj_stack_state()),
    ];

    for primitive in primitives.iter() {
        let (name, arity, f) = primitive;
        state.register_primitive(name, *arity, *f);
    }
}
#+end_src

