05-03-funcoes-primitivas.html

<div id="outline-container-org8f8802f" class="outline-2">
<h2 id="org8f8802f"><span class="section-number-2">34.</span> Registro em contexto global</h2>
<div class="outline-text-2" id="text-34">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_gen_primitives</span>(<span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>) {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::{ <span style="color: #4ec9b0;">MajPrimFn</span>, <span style="color: #4ec9b0;">MajPrimArgs</span> };
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">primitives</span>: <span style="color: #4ec9b0;">Vec</span>&lt;(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">str</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>, <span style="color: #4ec9b0;">MajPrimFn</span>)&gt; = <span style="color: #c586c0;">vec!</span>[
        (<span style="color: #ce9178;">"cons"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
            maj_cons(first, second)
        }),
        (<span style="color: #ce9178;">"car"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_car(first)
        }),
        (<span style="color: #ce9178;">"cdr"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_cdr(first)
        }),
        (<span style="color: #ce9178;">"copy"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_copy(first)
        }),
        (<span style="color: #ce9178;">"length"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_length(first)
        }),
        (<span style="color: #ce9178;">"depth"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_depth(first)
        }),
        (<span style="color: #ce9178;">"type"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first)
        }),
        (<span style="color: #ce9178;">"intern"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_intern(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first)
        }),
        (<span style="color: #ce9178;">"name"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_name(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first)
        }),
        (<span style="color: #ce9178;">"get-environment"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1),
         |<span style="color: #569cd6;">mut</span> state, args, env| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_get_environment(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, env)
        }),
        (<span style="color: #ce9178;">"coin"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">None</span>, |_, _, _| maj_coin()),
        (<span style="color: #ce9178;">"sys"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest);
            maj_sys(first, rest)
        }),
        (<span style="color: #ce9178;">"format"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(1), |state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest);
            maj_format_prim(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, first, rest)
        }),
        (<span style="color: #ce9178;">"err"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest);
            maj_err(first, rest)
        }),
        (<span style="color: #ce9178;">"warn"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(1), |<span style="color: #569cd6;">mut</span> state, args, env| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest);
            maj_warn(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, rest, env)
        }),
        (<span style="color: #ce9178;">"list"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(0),
         |_, args, _| maj_list(args)),
        (<span style="color: #ce9178;">"append"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(0),
         |_, args, _| maj_append(args)),
        (<span style="color: #ce9178;">"last"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_last(first)
        }),
        (<span style="color: #ce9178;">"reverse"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_reverse(first)
        }),
        (<span style="color: #ce9178;">"nth"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
            maj_nth(first, second)
        }),
        (<span style="color: #ce9178;">"nthcdr"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
            maj_nthcdr(first, second)
        }),
        (<span style="color: #ce9178;">"macroexpand-1"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1),
         |<span style="color: #569cd6;">mut</span> state, args, env| {
             <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
             <span style="color: #569cd6;">let</span> (result, _) =
                 maj_macroexpand_1(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, env);
             result
         }),
        (<span style="color: #ce9178;">"not"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_not(first)
        }),
        (<span style="color: #ce9178;">"gensym"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">None</span>,
         |<span style="color: #569cd6;">mut</span> state, _, _| maj_gensym(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state)),
        (<span style="color: #ce9178;">"iota"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_iota(first)
         }),

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Number functions</span>
        (<span style="color: #ce9178;">"number-coerce"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2),
         |<span style="color: #569cd6;">mut</span> state, args, _| {
             <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
             maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, second)
         }),
        (<span style="color: #ce9178;">"real-part"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_real_part(first)
        }),
        (<span style="color: #ce9178;">"imag-part"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_imag_part(first)
        }),
        (<span style="color: #ce9178;">"numer"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_numer(first)
        }),
        (<span style="color: #ce9178;">"denom"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_denom(first)
        }),
        (<span style="color: #ce9178;">"richest-number-type"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2),
         |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
            maj_richest_number_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, second)
        }),
        (<span style="color: #ce9178;">"rich-number-coerce"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2),
         |<span style="color: #569cd6;">mut</span> state, args, _| {
             <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
             maj_rich_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, second)
         }),
        (<span style="color: #ce9178;">"="</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(2),
         |<span style="color: #569cd6;">mut</span> state, args, env| {
             <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, r, second, rest);
             maj_arithm_eq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, first, second, rest)
         }),
        (<span style="color: #ce9178;">"float="</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2),
         |<span style="color: #569cd6;">mut</span> state, args, env| {
             <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, r, second);
             maj_arithm_floateq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, first, second)
         }),
        (<span style="color: #ce9178;">"&gt;"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(2),
         |<span style="color: #569cd6;">mut</span> state, args, _| {
             <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, r, second, rest);
             maj_arithm_greater(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, second, rest)
         }),
        (<span style="color: #ce9178;">"&lt;"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(2),
         |<span style="color: #569cd6;">mut</span> state, args, _| {
             <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, r, second, rest);
             maj_arithm_lesser(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, second, rest)
         }),
        (<span style="color: #ce9178;">"&gt;="</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(2),
         |<span style="color: #569cd6;">mut</span> state, args, env| {
             <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, r, second, rest);
             maj_arithm_geq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, first, second, rest)
         }),
        (<span style="color: #ce9178;">"&lt;="</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(2),
         |<span style="color: #569cd6;">mut</span> state, args, env| {
             <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, r, second, rest);
             maj_arithm_leq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, first, second, rest)
         }),
        (<span style="color: #ce9178;">"+"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(0),
         |<span style="color: #569cd6;">mut</span> state, args, env| {
             maj_arithm_plus(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, args)
         }),
        (<span style="color: #ce9178;">"-"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(0),
         |<span style="color: #569cd6;">mut</span> state, args, env| {
             maj_arithm_minus(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, args)
         }),
        (<span style="color: #ce9178;">"*"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(0),
         |<span style="color: #569cd6;">mut</span> state, args, env| {
             maj_arithm_times(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, args)
         }),
        (<span style="color: #ce9178;">"/"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(0),
         |<span style="color: #569cd6;">mut</span> state, args, env| {
             maj_arithm_divide(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, args)
         }),

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Stream functions</span>
        (<span style="color: #ce9178;">"open-stream"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2), |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
            maj_open_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, second)
        }),
        (<span style="color: #ce9178;">"close-stream"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_close_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first)
        }),
        (<span style="color: #ce9178;">"stat"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_stat(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first)
        }),
        (<span style="color: #ce9178;">"read-char"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_read_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first)
        }),
        (<span style="color: #ce9178;">"peek-char"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_peek_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first)
        }),
        (<span style="color: #ce9178;">"write-char"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2), |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
            maj_write_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, second)
        }),
        (<span style="color: #ce9178;">"write-string"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2), |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
            maj_write_string(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, second)
        }),
        (<span style="color: #ce9178;">"write"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2), |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
            maj_write(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, second)
        }),
        (<span style="color: #ce9178;">"terpri"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">None</span>, |<span style="color: #569cd6;">mut</span> state, _, env| {
            maj_terpri(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env)
        }),
        (<span style="color: #ce9178;">"display"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |<span style="color: #569cd6;">mut</span> state, args, env| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_display(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, env)
        }),
        (<span style="color: #ce9178;">"pretty-display"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1),
         |<span style="color: #569cd6;">mut</span> state, args, env| {
             <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
             maj_pretty_display(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, env)
         }),
        (<span style="color: #ce9178;">"print"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(1), |<span style="color: #569cd6;">mut</span> state, args, env| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest);
            maj_print(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, rest, env)
        }),
        (<span style="color: #ce9178;">"load"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |<span style="color: #569cd6;">mut</span> state, args, env| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_load(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, first)
        }),

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Vector functions</span>
        (<span style="color: #ce9178;">"vec-type"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_vec_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first)
        }),
        (<span style="color: #ce9178;">"vec-push"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2), |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
            maj_vec_push(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, second)
        }),
        (<span style="color: #ce9178;">"vec-insert"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(3), |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second,
                                  sndrst, third);
            maj_vec_insert(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, second, third)
        }),
        (<span style="color: #ce9178;">"vec-coerce"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2), |<span style="color: #569cd6;">mut</span> state, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
            maj_vec_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, first, second)
        }),
        (<span style="color: #ce9178;">"vector"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(0), |<span style="color: #569cd6;">mut</span> state, args, _| {
            maj_vector(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, args)
        }),
        (<span style="color: #ce9178;">"vec-length"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_vec_length(first)
        }),
        (<span style="color: #ce9178;">"vec-pop"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_vec_pop(first)
        }),
        (<span style="color: #ce9178;">"vec-deq"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_vec_deq(first)
        }),
        (<span style="color: #ce9178;">"vec-at"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
            maj_vec_at(first, second)
        }),
        (<span style="color: #ce9178;">"vec-set"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(3), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second,
                                  snd_rest, third);
            maj_vec_set(first, second, third)
        }),
        (<span style="color: #ce9178;">"vec-remove"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
            maj_vec_remove(first, second)
        }),

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Non-standard functions</span>
        (<span style="color: #ce9178;">"gc"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">None</span>, |_, _, _| maj_gc()),
        (<span style="color: #ce9178;">"print-env"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), maj_print_env),
        (<span style="color: #ce9178;">"stack-state"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">None</span>, |_, _, _| maj_stack_state()),
    ];

    <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">primitive</span> <span style="color: #569cd6;">in</span> primitives.iter() {
        <span style="color: #569cd6;">let</span> (name, arity, f) = primitive;
        state.register_primitive(name, *arity, *f);
    }
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lucas S. Vieira</p>
<p class="date">Created: 2022-10-23 dom 23:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
